{
  "fullmeal": [
    {
      "recipe_name": "Biryani",
      "recipe_image": "https://img.freepik.com/premium-photo/dum-handi-chicken-biryani-is-prepared-earthen-clay-pot-called-haandi-popular-indian-non-vegetarian-food_466689-52336.jpg?w=826",
      "recipe_category": "Full Meal",
      "recipe_description": "A flavorful and aromatic South Asian dish made with basmati rice, tender meat (usually chicken or mutton), and a blend of rich spices, cooked together to create a hearty one-pot meal.",
      "recipe_steps": [
        "Step 1: Wash and soak 2 cups basmati rice in water for 30 Mins. Drain the rice and set aside.",
        "Step 2: Heat 2 tablespoons oil or ghee in a large pot. Add 1 large onion, sliced, and fry until golden brown. Remove half of the fried onions and set aside for garnishing.",
        "Step 3: Add 1 tablespoon ginger-garlic paste and cook for 1 minute. Then add 500g chicken (or mutton) pieces and sauté until browned.",
        "Step 4: Add 2 chopped tomatoes, 1 teaspoon red chili powder, 1 teaspoon turmeric powder, 1 teaspoon garam masala, and salt to taste. Cook until the tomatoes soften.",
        "Step 5: Add 1/2 cup yogurt and mix well. Cook for 5-7 Mins until the gravy thickens and the meat is tender.",
        "Step 6: In a separate pot, bring 4 cups of water to a boil. Add 1 teaspoon cumin seeds, 2-3 green cardamom pods, 2-3 cloves, and a cinnamon stick.",
        "Step 7: Add the soaked and drained rice to the boiling water. Cook until the rice is 70% cooked (al dente). Drain the rice and set aside.",
        "Step 8: Layer the cooked rice over the meat gravy in the pot. Sprinkle some saffron soaked in milk (optional), fried onions, and fresh coriander and mint leaves on top.",
        "Step 9: Cover the pot with a tight lid and cook on low heat for 20-25 Mins to allow the flavors to meld together.",
        "Step 10: Garnish with additional fried onions, cilantro, and mint leaves before serving."
      ],
      "recipe_ingredients": [
        "2 cups basmati rice",
        "500g chicken or mutton, cut into pieces",
        "2 tablespoons oil or ghee",
        "1 large onion, sliced",
        "1 tablespoon ginger-garlic paste",
        "2 tomatoes, chopped",
        "1 teaspoon red chili powder",
        "1 teaspoon turmeric powder",
        "1 teaspoon garam masala",
        "1/2 cup yogurt",
        "Salt to taste",
        "4 cups water",
        "1 teaspoon cumin seeds",
        "2-3 green cardamom pods",
        "2-3 cloves",
        "1 cinnamon stick",
        "Saffron soaked in milk (optional)",
        "Fresh coriander and mint leaves",
        "Fried onions (for garnish)"
      ],
      "recipe_facts": {
        "Calories": 550,
        "Carbs": 70,
        "Fat": 22,
        "Protein": 28,
        "Fiber": 3,
        "Net Carbs": 67,
        "Sodium": 600,
        "Cholesterol": 70
      },
      "recipe_time": "1 Hr 30 Mins"
    },
    {
      "recipe_name": "Spaghetti Carbonara",
      "recipe_image": "https://img.freepik.com/premium-photo/composition-with-plate-tasty-pasta-wine-wooden-wall_185193-1045.jpg?w=826",
      "recipe_category": "Full Meal",
      "recipe_description": "A classic Italian pasta dish made with eggs, cheese, pancetta, and pepper, offering a creamy and flavorful experience.",
      "recipe_steps": [
        "Step 1: Cook 200g spaghetti in a large pot of salted boiling water until al dente, then drain and reserve 1/2 cup of pasta water.",
        "Step 2: In a pan, cook 100g diced pancetta or bacon over medium heat until crispy. Remove from heat.",
        "Step 3: In a bowl, whisk 2 large eggs and 1/2 cup grated Parmesan cheese until well combined.",
        "Step 4: Add the hot spaghetti to the pan with pancetta, then quickly pour the egg and cheese mixture over the pasta, stirring to create a creamy sauce. Add reserved pasta water as needed to adjust the consistency.",
        "Step 5: Season with freshly ground black pepper and garnish with additional Parmesan cheese if desired."
      ],
      "recipe_ingredients": [
        "200g spaghetti",
        "100g pancetta or bacon, diced",
        "2 large eggs",
        "1/2 cup grated Parmesan cheese",
        "Freshly ground black pepper",
        "Salt (for boiling pasta)"
      ],
      "recipe_facts": {
        "Calories": 450,
        "Carbs": 50,
        "Fat": 18,
        "Protein": 20,
        "Fiber": 2,
        "Net Carbs": 48,
        "Sodium": 450,
        "Cholesterol": 120
      },
      "recipe_time": "20 Mins"
    },
    {
      "recipe_name": "Beef Stroganoff",
      "recipe_image": "https://img.freepik.com/premium-photo/stroganoff-chicken-liver-with-mushrooms-cream_2829-15295.jpg?w=826",
      "recipe_category": "Full Meal",
      "recipe_description": "A hearty and creamy dish of sautéed beef and mushrooms in a flavorful sour cream sauce, served over noodles or rice.",
      "recipe_steps": [
        "Step 1: Slice 500g of beef into thin strips and season with salt and pepper.",
        "Step 2: Heat 2 tablespoons of oil in a skillet over medium-high heat and sear the beef until browned. Remove from skillet and set aside.",
        "Step 3: Add 1 chopped onion and 2 cups sliced mushrooms to the skillet and sauté until softened.",
        "Step 4: Stir in 1 tablespoon flour and cook for 1 minute. Gradually add 1 cup beef broth, stirring to combine.",
        "Step 5: Return the beef to the skillet, reduce heat to low, and stir in 1/2 cup sour cream. Cook until heated through without boiling.",
        "Step 6: Serve over cooked egg noodles or rice and garnish with fresh parsley if desired."
      ],
      "recipe_ingredients": [
        "500g beef (sirloin or tenderloin), thinly sliced",
        "2 tablespoons oil",
        "1 onion, chopped",
        "2 cups mushrooms, sliced",
        "1 tablespoon flour",
        "1 cup beef broth",
        "1/2 cup sour cream",
        "Salt and pepper to taste",
        "Cooked egg noodles or rice (for serving)",
        "Fresh parsley (optional garnish)"
      ],
      "recipe_facts": {
        "Calories": 480,
        "Carbs": 25,
        "Fat": 22,
        "Protein": 35,
        "Fiber": 2,
        "Net Carbs": 23,
        "Sodium": 400,
        "Cholesterol": 110
      },
      "recipe_time": "30 Mins"
    },
    {
      "recipe_name": "Chicken Tikka Masala",
      "recipe_image": "https://img.freepik.com/free-photo/chicken-skewers-with-slices-sweet-peppers-dill-tasty-food-weekend-meal_2829-7043.jpg?t=st=1733061626~exp=1733065226~hmac=dbe02b331e40bd004db796c26b685d4471e47e1f92a9ef66f8d3e5f8ec7737cb&w=826",
      "recipe_category": "Full Meal",
      "recipe_description": "A flavorful and creamy Indian-inspired dish featuring marinated chicken cooked in a spiced tomato and cream sauce, perfect with naan or rice.",
      "recipe_steps": [
        "Step 1: Marinate 500g chicken (cut into bite-sized pieces) with 1/2 cup yogurt, 1 tablespoon ginger-garlic paste, 1 teaspoon turmeric, 1 teaspoon cumin, 1 teaspoon paprika, and 1/2 teaspoon chili powder. Let it rest for 30 Mins or overnight.",
        "Step 2: Heat 2 tablespoons oil in a skillet and cook the marinated chicken until browned and cooked through. Remove from skillet and set aside.",
        "Step 3: In the same skillet, sauté 1 chopped onion until golden. Add 2 minced garlic cloves, 1 tablespoon grated ginger, and cook for 1 minute.",
        "Step 4: Stir in 1 teaspoon garam masala, 1 teaspoon cumin, and 1 teaspoon paprika. Cook for 30 seconds.",
        "Step 5: Add 1 can (400g) crushed tomatoes and simmer for 10 Mins. Stir in 1/2 cup heavy cream or coconut milk.",
        "Step 6: Return the chicken to the skillet and simmer for another 5 Mins. Adjust salt and spice levels to taste.",
        "Step 7: Garnish with fresh cilantro and serve with naan or basmati rice."
      ],
      "recipe_ingredients": [
        "500g chicken breast or thighs, cut into pieces",
        "1/2 cup yogurt",
        "1 tablespoon ginger-garlic paste",
        "1 teaspoon turmeric",
        "1 teaspoon cumin",
        "1 teaspoon paprika",
        "1/2 teaspoon chili powder",
        "2 tablespoons oil",
        "1 onion, chopped",
        "2 garlic cloves, minced",
        "1 tablespoon grated ginger",
        "1 teaspoon garam masala",
        "1 can (400g) crushed tomatoes",
        "1/2 cup heavy cream or coconut milk",
        "Fresh cilantro (for garnish)",
        "Salt to taste"
      ],
      "recipe_facts": {
        "Calories": 400,
        "Carbs": 15,
        "Fat": 22,
        "Protein": 35,
        "Fiber": 3,
        "Net Carbs": 12,
        "Sodium": 600,
        "Cholesterol": 100
      },
      "recipe_time": "40 Mins"
    },
    {
      "recipe_name": "Sushi Platter",
      "recipe_image": "https://img.freepik.com/free-photo/japanese-food-sushi-sashimi_2829-14374.jpg?t=st=1733061685~exp=1733065285~hmac=73edcb468873e902f54726d2a981d9afec8d4071a5cabc4ec70725e76dbddf82&w=740",
      "recipe_category": "Full Meal",
      "recipe_description": "A delightful assortment of sushi rolls and sashimi featuring fresh fish, seasoned rice, and vibrant vegetables. Perfect for gatherings or special occasions.",
      "recipe_steps": [
        "Step 1: Rinse 2 cups of sushi rice under cold water until the water runs clear. Cook according to package instructions.",
        "Step 2: Mix 4 tablespoons rice vinegar, 2 tablespoons sugar, and 1 teaspoon salt, then fold into the cooked rice while it's warm. Let it cool to room temperature.",
        "Step 3: Prepare fillings by slicing fresh fish (like salmon, tuna, and shrimp), and vegetables (such as cucumber, avocado, and carrots) into thin strips.",
        "Step 4: Place a sheet of nori (seaweed) shiny side down on a bamboo sushi mat. Spread a thin layer of rice evenly over the nori, leaving a 1-inch border at the top.",
        "Step 5: Arrange fillings in a straight line near the bottom of the rice. Roll tightly using the bamboo mat.",
        "Step 6: Slice the roll into bite-sized pieces using a sharp, wet knife. Repeat with various fillings for variety.",
        "Step 7: Arrange sushi rolls and sashimi on a platter, garnished with pickled ginger, wasabi, and small bowls of soy sauce for dipping."
      ],
      "recipe_ingredients": [
        "2 cups sushi rice",
        "4 tablespoons rice vinegar",
        "2 tablespoons sugar",
        "1 teaspoon salt",
        "Nori sheets (seaweed)",
        "Fresh fish (e.g., salmon, tuna, shrimp)",
        "Vegetables (e.g., cucumber, avocado, carrots)",
        "Pickled ginger (for garnish)",
        "Wasabi (for garnish)",
        "Soy sauce (for dipping)"
      ],
      "recipe_facts": {
        "Calories": 320,
        "Carbs": 54,
        "Fat": 6,
        "Protein": 15,
        "Fiber": 3,
        "Net Carbs": 51,
        "Sodium": 750,
        "Cholesterol": 25
      },
      "recipe_time": "60 Mins"
    },
    {
      "recipe_name": "Lasagna Bolognese",
      "recipe_image": "https://img.freepik.com/free-photo/fresh-homemade-lasagna-leafs-plate-generative-ai_188544-8132.jpg?t=st=1733061721~exp=1733065321~hmac=a4134e36c4b1fd4b86da72f59fc2966f8d4fc61a7b3051e8596037bd55378445&w=826",
      "recipe_category": "Full Meal",
      "recipe_description": "A rich and comforting Italian classic layered with hearty Bolognese sauce, creamy béchamel, and lasagna sheets, baked to perfection.",
      "recipe_steps": [
        "Step 1: Heat 2 tablespoons olive oil in a large skillet. Sauté 1 diced onion, 2 minced garlic cloves, 1 diced carrot, and 1 diced celery stalk until softened.",
        "Step 2: Add 500g ground beef and 250g ground pork. Cook until browned. Stir in 1 can (400g) crushed tomatoes, 2 tablespoons tomato paste, 1/2 cup red wine, 1 teaspoon dried oregano, and salt and pepper to taste. Simmer for 30 Mins.",
        "Step 3: Prepare béchamel sauce by melting 4 tablespoons butter in a saucepan. Whisk in 4 tablespoons flour and cook for 1 minute. Gradually add 3 cups milk, whisking constantly, until thickened. Season with salt, pepper, and a pinch of nutmeg.",
        "Step 4: Preheat oven to 375°F (190°C). Spread a thin layer of Bolognese sauce in a baking dish. Add a layer of lasagna sheets, followed by Bolognese sauce, béchamel, and grated Parmesan cheese. Repeat layers, finishing with béchamel and Parmesan on top.",
        "Step 5: Cover with foil and bake for 25 Mins. Remove foil and bake for another 15 Mins, or until golden and bubbly. Let rest for 10 Mins before serving."
      ],
      "recipe_ingredients": [
        "2 tablespoons olive oil",
        "1 onion, diced",
        "2 garlic cloves, minced",
        "1 carrot, diced",
        "1 celery stalk, diced",
        "500g ground beef",
        "250g ground pork",
        "1 can (400g) crushed tomatoes",
        "2 tablespoons tomato paste",
        "1/2 cup red wine (optional)",
        "1 teaspoon dried oregano",
        "Salt and pepper to taste",
        "4 tablespoons butter",
        "4 tablespoons flour",
        "3 cups milk",
        "Pinch of nutmeg",
        "Lasagna sheets",
        "Grated Parmesan cheese"
      ],
      "recipe_facts": {
        "Calories": 550,
        "Carbs": 45,
        "Fat": 30,
        "Protein": 30,
        "Fiber": 4,
        "Net Carbs": 41,
        "Sodium": 800,
        "Cholesterol": 90
      },
      "recipe_time": "90 Mins"
    },
    {
      "recipe_name": "Fish and Chips",
      "recipe_image": "https://img.freepik.com/premium-photo/fish-chips-with-french-fries_1339-77060.jpg?w=826",
      "recipe_category": "Full Meal",
      "recipe_description": "A classic British dish featuring crispy battered fish and golden fries, served with tartar sauce and a wedge of lemon.",
      "recipe_steps": [
        "Step 1: Peel and cut 4 large potatoes into thick slices. Soak them in cold water for 30 Mins, then drain and pat dry.",
        "Step 2: Heat oil in a deep fryer or large pot to 325°F (160°C). Fry the potatoes in batches for 3-4 Mins until pale and soft. Remove and set aside.",
        "Step 3: In a bowl, mix 1 cup flour, 1 teaspoon baking powder, 1/2 teaspoon salt, and 1/2 teaspoon pepper. Gradually whisk in 1 cup cold sparkling water to form a smooth batter.",
        "Step 4: Season 4 pieces of firm white fish (like cod or haddock) with salt and pepper. Dredge each piece in flour, then dip into the batter, coating evenly.",
        "Step 5: Increase the oil temperature to 375°F (190°C). Fry the battered fish in batches for 4-5 Mins until golden and crispy. Remove and drain on paper towels.",
        "Step 6: Return the pre-cooked fries to the oil and fry for 2-3 Mins until golden and crispy. Remove and drain on paper towels.",
        "Step 7: Serve the fish and chips hot with tartar sauce, a wedge of lemon, and optional mushy peas."
      ],
      "recipe_ingredients": [
        "4 large potatoes",
        "Oil for frying",
        "1 cup flour (plus extra for dredging)",
        "1 teaspoon baking powder",
        "1/2 teaspoon salt",
        "1/2 teaspoon pepper",
        "1 cup cold sparkling water",
        "4 pieces firm white fish (e.g., cod, haddock)",
        "Salt and pepper to taste",
        "Tartar sauce and lemon wedges (for serving)"
      ],
      "recipe_facts": {
        "Calories": 600,
        "Carbs": 65,
        "Fat": 30,
        "Protein": 25,
        "Fiber": 5,
        "Net Carbs": 60,
        "Sodium": 800,
        "Cholesterol": 75
      },
      "recipe_time": "60 Mins"
    },
    {
      "recipe_name": "Fajitas",
      "recipe_image": "https://img.freepik.com/premium-photo/fajitas-tortilla-wraps-with-beef-meat-steak-stripes-sweet-pepper-onions_89816-20217.jpg?w=826",
      "recipe_category": "Full Meal",
      "recipe_description": "A vibrant and flavorful Mexican dish made with marinated grilled meat, sautéed peppers, onions, and served with warm tortillas and various toppings.",
      "recipe_steps": [
        "Step 1: In a bowl, combine 2 tablespoons olive oil, 1 tablespoon lime juice, 1 teaspoon cumin, 1 teaspoon chili powder, 1 teaspoon paprika, 1/2 teaspoon garlic powder, salt, and pepper. Add 500g chicken breast (sliced) or beef (sliced) and marinate for at least 30 Mins.",
        "Step 2: Heat a grill or skillet over medium-high heat. Cook the marinated chicken or beef for 6-8 Mins per side or until fully cooked. Remove and set aside.",
        "Step 3: In the same pan, add 1 tablespoon olive oil and sauté 1 sliced onion and 1 sliced bell pepper until soft and slightly caramelized, about 5 Mins.",
        "Step 4: Warm 8 small flour tortillas in a dry pan or microwave until soft.",
        "Step 5: Slice the cooked chicken or beef into thin strips. Serve on the warm tortillas with sautéed peppers and onions.",
        "Step 6: Optional toppings: Sour cream, guacamole, salsa, shredded cheese, and fresh cilantro."
      ],
      "recipe_ingredients": [
        "2 tablespoons olive oil (for marinade and cooking)",
        "1 tablespoon lime juice",
        "1 teaspoon cumin",
        "1 teaspoon chili powder",
        "1 teaspoon paprika",
        "1/2 teaspoon garlic powder",
        "Salt and pepper to taste",
        "500g chicken breast or beef (sliced)",
        "1 onion (sliced)",
        "1 bell pepper (sliced)",
        "8 small flour tortillas",
        "Optional toppings: Sour cream, guacamole, salsa, shredded cheese, fresh cilantro"
      ],
      "recipe_facts": {
        "Calories": 350,
        "Carbs": 35,
        "Fat": 15,
        "Protein": 25,
        "Fiber": 4,
        "Net Carbs": 31,
        "Sodium": 600,
        "Cholesterol": 60
      },
      "recipe_time": "40 Mins"
    },
    {
      "recipe_name": "Butter Chicken",
      "recipe_image": "https://img.freepik.com/free-photo/curry-with-chicken-onions-indian-food-asian-cuisine_2829-4415.jpg?t=st=1733061859~exp=1733065459~hmac=bfe646c6a8c1be2ac55e442269af41cf46b8e6b18c841d96cb9117c1cea36ecf&w=740",
      "recipe_category": "Full Meal",
      "recipe_description": "A rich and creamy Indian dish featuring tender chicken in a flavorful tomato-based gravy with butter and spices.",
      "recipe_steps": [
        "Step 1: In a bowl, combine 500g boneless chicken (cut into cubes) with 1/2 cup yogurt, 1 tablespoon lemon juice, 1 teaspoon garam masala, 1 teaspoon turmeric, 1 teaspoon chili powder, 1 teaspoon cumin, and salt. Let it marinate for at least 30 Mins.",
        "Step 2: Heat 2 tablespoons butter in a large skillet over medium heat. Add 1 finely chopped onion and sauté until golden brown, about 5 Mins.",
        "Step 3: Add 3 minced garlic cloves and 1 tablespoon grated ginger to the skillet, cooking for another minute.",
        "Step 4: Add 1 can (400g) crushed tomatoes, 1 tablespoon tomato paste, 1 teaspoon sugar, and 1 teaspoon garam masala. Stir and cook for 10 Mins until the sauce thickens.",
        "Step 5: Add the marinated chicken to the sauce and cook for 10-12 Mins until the chicken is fully cooked.",
        "Step 6: Stir in 1/2 cup heavy cream and 2 tablespoons butter. Simmer for another 5 Mins, adjusting salt and sugar as needed.",
        "Step 7: Garnish with fresh cilantro and serve hot with naan or rice."
      ],
      "recipe_ingredients": [
        "500g boneless chicken (cut into cubes)",
        "1/2 cup yogurt",
        "1 tablespoon lemon juice",
        "1 teaspoon garam masala",
        "1 teaspoon turmeric",
        "1 teaspoon chili powder",
        "1 teaspoon cumin",
        "Salt to taste",
        "2 tablespoons butter",
        "1 onion (finely chopped)",
        "3 garlic cloves (minced)",
        "1 tablespoon grated ginger",
        "1 can (400g) crushed tomatoes",
        "1 tablespoon tomato paste",
        "1 teaspoon sugar",
        "1 teaspoon garam masala",
        "1/2 cup heavy cream",
        "Fresh cilantro (for garnish)"
      ],
      "recipe_facts": {
        "Calories": 550,
        "Carbs": 20,
        "Fat": 35,
        "Protein": 45,
        "Fiber": 3,
        "Net Carbs": 17,
        "Sodium": 800,
        "Cholesterol": 120
      },
      "recipe_time": "60 Mins"
    },
    {
      "recipe_name": "Ratatouille",
      "recipe_image": "https://img.freepik.com/premium-photo/ratatouille-baking-dish-wooden-table-traditional-french-provencal-vegetable-dish-dieting-vegan-food-ratatouille-casserole-menu-banner_286393-1977.jpg?w=826",
      "recipe_category": "Full Meal",
      "recipe_description": "A classic French vegetable dish made with a mix of eggplant, zucchini, bell peppers, tomatoes, and herbs, often served as a side or a main dish.",
      "recipe_steps": [
        "Step 1: Preheat the oven to 375°F (190°C). Slice 1 eggplant, 2 zucchinis, and 1 bell pepper into thin rounds.",
        "Step 2: In a large skillet, heat 2 tablespoons olive oil over medium heat. Add 1 finely chopped onion and 3 minced garlic cloves. Sauté for 5-7 Mins until softened.",
        "Step 3: Add 2 cups diced tomatoes (or 1 can of crushed tomatoes) to the skillet. Stir in 1 teaspoon dried thyme, 1 teaspoon dried basil, 1/2 teaspoon salt, and 1/4 teaspoon black pepper. Simmer for 10 Mins, stirring occasionally.",
        "Step 4: Spread the tomato mixture evenly at the bottom of a baking dish.",
        "Step 5: Arrange the sliced vegetables (eggplant, zucchini, bell pepper) in a spiral pattern over the tomato mixture, layering them in alternating colors.",
        "Step 6: Drizzle 2 tablespoons olive oil over the top of the arranged vegetables. Cover the dish with foil.",
        "Step 7: Bake in the preheated oven for 45 Mins. Remove the foil and bake for an additional 10-15 Mins until the vegetables are tender.",
        "Step 8: Garnish with fresh basil and serve warm."
      ],
      "recipe_ingredients": [
        "1 eggplant (sliced)",
        "2 zucchinis (sliced)",
        "1 bell pepper (sliced)",
        "2 cups diced tomatoes (or 1 can crushed tomatoes)",
        "1 onion (finely chopped)",
        "3 garlic cloves (minced)",
        "2 tablespoons olive oil (for cooking and drizzling)",
        "1 teaspoon dried thyme",
        "1 teaspoon dried basil",
        "1/2 teaspoon salt",
        "1/4 teaspoon black pepper",
        "Fresh basil leaves (for garnish)"
      ],
      "recipe_facts": {
        "Calories": 250,
        "Carbs": 35,
        "Fat": 14,
        "Protein": 4,
        "Fiber": 10,
        "Net Carbs": 25,
        "Sodium": 400,
        "Cholesterol": 0
      },
      "recipe_time": "1 Hr"
    }
  ],
  "breakfast": [
    {
      "recipe_name": "Pancakes with Syrup",
      "recipe_image": "https://img.freepik.com/premium-photo/homemade-pancakes-with-honey_80295-2118.jpg?w=826",
      "recipe_category": "breakfast",
      "recipe_description": "Fluffy and delicious pancakes served with sweet maple syrup, perfect for a hearty BreakFast or brunch.",
      "recipe_steps": [
        "Step 1: In a large bowl, whisk together 1 1/2 cups all-purpose flour, 2 tablespoons sugar, 2 teaspoons baking powder, and a pinch of salt.",
        "Step 2: In another bowl, beat 1 large egg, then add 1 1/4 cups milk, and 2 tablespoons melted butter. Stir until combined.",
        "Step 3: Pour the wet ingredients into the dry ingredients and stir until just combined. Be careful not to over-mix; a few lumps are fine.",
        "Step 4: Heat a non-stick skillet or griddle over medium heat and lightly grease with butter or cooking spray.",
        "Step 5: Pour 1/4 cup of batter onto the skillet for each pancake. Cook until bubbles form on the surface, about 2-3 Mins. Flip and cook for another 1-2 Mins until golden brown on both sides.",
        "Step 6: Remove the pancakes from the skillet and keep warm. Repeat with the remaining batter.",
        "Step 7: Serve the pancakes stacked, topped with warm maple syrup and a dusting of powdered sugar if desired."
      ],
      "recipe_ingredients": [
        "1 1/2 cups all-purpose flour",
        "2 tablespoons sugar",
        "2 teaspoons baking powder",
        "Pinch of salt",
        "1 large egg",
        "1 1/4 cups milk",
        "2 tablespoons melted butter",
        "Butter or cooking spray (for greasing)",
        "Maple syrup (for serving)",
        "Powdered sugar (optional, for serving)"
      ],
      "recipe_facts": {
        "Calories": 350,
        "Carbs": 50,
        "Fat": 12,
        "Protein": 7,
        "Fiber": 2,
        "Net Carbs": 48,
        "Sodium": 350,
        "Cholesterol": 45
      },
      "recipe_time": "20 Mins"
    },
    {
      "recipe_name": "Bacon and Eggs",
      "recipe_image": "https://img.freepik.com/free-photo/english-breakfast_144627-43677.jpg?t=st=1733062144~exp=1733065744~hmac=b3f526432fed9a2cb0bfb7f5b20c2bd018b2e1eb01da13db4c1a71d7b52b497c&w=826",
      "recipe_category": "BreakFast",
      "recipe_description": "A classic and hearty breakfast consisting of crispy bacon paired with scrambled, fried, or poached eggs.",
      "recipe_steps": [
        "Step 1: Heat a skillet or frying pan over medium heat. Add 4 slices of bacon and cook until crispy, turning occasionally, about 5-7 Mins.",
        "Step 2: While the bacon is cooking, crack 2 eggs into a separate bowl. Whisk them lightly with a pinch of salt and pepper for scrambled eggs or prepare them as per your preferred method (fried, poached, etc.).",
        "Step 3: Remove the cooked bacon from the skillet and drain on paper towels. In the same skillet, cook the eggs to your desired consistency (for scrambled, cook on low heat, stirring frequently for about 2-3 Mins).",
        "Step 4: Serve the crispy bacon alongside the eggs. Optionally, toast some bread and serve with butter or jam."
      ],
      "recipe_ingredients": [
        "4 slices of bacon",
        "2 eggs",
        "Salt and pepper to taste",
        "Optional: Bread for toasting"
      ],
      "recipe_facts": {
        "Calories": 400,
        "Carbs": 2,
        "Fat": 35,
        "Protein": 22,
        "Fiber": 0,
        "Net Carbs": 2,
        "Sodium": 800,
        "Cholesterol": 200
      },
      "recipe_time": "10 Mins"
    },
    {
      "recipe_name": "Dosa with Sambar",
      "recipe_image": "https://img.freepik.com/free-photo/delicious-indian-dosa-composition_23-2149086051.jpg?t=st=1733062174~exp=1733065774~hmac=c7ac8efdf6c47ec23a0a377ef761834c5dd876d5fcefb478978dbe1573d0645a&w=826",
      "recipe_category": "BreakFast",
      "recipe_description": "A classic South Indian breakfast or snack consisting of crispy dosas served with a flavorful and spicy lentil soup called sambar.",
      "recipe_steps": [
        "Step 1: Prepare the dosa batter by soaking 1 cup rice and 1/4 cup urad dal (split black lentils) in water for 4-6 Hrs or overnight. Drain and grind the mixture into a smooth batter, adding water as needed. Let the batter ferment for 8-12 Hrs.",
        "Step 2: To make sambar, heat 1 tablespoon oil in a pot. Add 1/2 teaspoon mustard seeds and let them pop. Add 1 chopped onion, 2 chopped tomatoes, and sauté for 5 Mins.",
        "Step 3: Add 1/2 cup cooked toor dal (yellow lentils), 1 teaspoon tamarind paste, 1 tablespoon sambar powder, and 2 cups water. Bring to a boil, then simmer for 10-15 Mins. Add salt to taste and garnish with fresh coriander leaves.",
        "Step 4: Heat a non-stick skillet or griddle over medium heat and grease with oil. Pour a ladle of dosa batter onto the skillet and spread it into a thin, round shape. Cook until golden and crisp on both sides.",
        "Step 5: Serve the crispy dosas with the hot, flavorful sambar on the side."
      ],
      "recipe_ingredients": [
        "1 cup rice",
        "1/4 cup urad dal (split black lentils)",
        "1 tablespoon oil (for cooking)",
        "1/2 teaspoon mustard seeds",
        "1 onion (chopped)",
        "2 tomatoes (chopped)",
        "1/2 cup cooked toor dal (yellow lentils)",
        "1 teaspoon tamarind paste",
        "1 tablespoon sambar powder",
        "2 cups water",
        "Salt to taste",
        "Fresh coriander leaves (for garnish)",
        "Oil or ghee (for making dosa)"
      ],
      "recipe_facts": {
        "Calories": 350,
        "Carbs": 45,
        "Fat": 12,
        "Protein": 12,
        "Fiber": 8,
        "Net Carbs": 37,
        "Sodium": 600,
        "Cholesterol": 0
      },
      "recipe_time": "1 Hr 30 Mins"
    },
    {
      "recipe_name": "Smoothie Bowl",
      "recipe_image": "https://img.freepik.com/free-photo/bowls-with-breakfast-desserts-blueberries_23-2148417433.jpg?t=st=1733062325~exp=1733065925~hmac=0cf5bde93d011d7709cdeb598429a01fbe5da4e48115131a15779c30aaf35af3&w=826",
      "recipe_category": "BreakFast",
      "recipe_description": "A thick and creamy smoothie served in a bowl, topped with a variety of fruits, nuts, seeds, and granola for a nutritious and customizable BreakFast.",
      "recipe_steps": [
        "Step 1: In a blender, combine 1 frozen banana, 1/2 cup frozen berries (such as strawberries or blueberries), 1/2 cup Greek yogurt, and 1/4 cup almond milk. Blend until smooth and thick.",
        "Step 2: Pour the smoothie mixture into a bowl.",
        "Step 3: Add your favorite toppings such as sliced fruits (banana, kiwi, or berries), granola, chia seeds, coconut flakes, and nuts (almonds or walnuts).",
        "Step 4: Drizzle with honey or maple syrup if desired for extra sweetness.",
        "Step 5: Serve immediately and enjoy your refreshing smoothie bowl."
      ],
      "recipe_ingredients": [
        "1 frozen banana",
        "1/2 cup frozen berries (strawberries, blueberries, etc.)",
        "1/2 cup Greek yogurt",
        "1/4 cup almond milk (or any milk of choice)",
        "Toppings: Sliced banana, kiwi, berries, granola, chia seeds, coconut flakes, nuts (almonds, walnuts)",
        "Optional: Honey or maple syrup for sweetness"
      ],
      "recipe_facts": {
        "Calories": 300,
        "Carbs": 40,
        "Fat": 8,
        "Protein": 10,
        "Fiber": 6,
        "Net Carbs": 34,
        "Sodium": 50,
        "Cholesterol": 10
      },
      "recipe_time": "10 Mins"
    },
    {
      "recipe_name": "Chole Bhature",
      "recipe_image": "https://img.freepik.com/premium-photo/chole-bhature-chick-pea-curry-fried-puri-served-terracotta-crockery-white-background-selective-focus_466689-24954.jpg?w=826",
      "recipe_category": "BreakFast",
      "recipe_description": "A popular North Indian dish consisting of spicy chickpeas (chole) served with deep-fried fluffy bread (bhature). It’s a hearty and delicious combination, perfect for a special meal.",
      "recipe_steps": [
        "Step 1: Soak 1 cup dried chickpeas in water overnight. Drain and cook them in a pressure cooker with 4 cups of water, 1 bay leaf, 2-3 cloves, and salt. Cook until the chickpeas are soft (about 3-4 whistles).",
        "Step 2: Heat 2 tablespoons oil in a pan. Add 1 finely chopped onion and sauté until golden brown. Add 1 tablespoon ginger-garlic paste and sauté for 1-2 Mins.",
        "Step 3: Add 2 chopped tomatoes, 1 teaspoon red chili powder, 1 teaspoon turmeric powder, 1 teaspoon coriander powder, 1 teaspoon garam masala, and salt to taste. Cook until the tomatoes are soft and the oil starts to separate.",
        "Step 4: Add the cooked chickpeas to the pan, along with 1 cup of the chickpea cooking liquid. Simmer for 10-15 Mins to allow the flavors to combine.",
        "Step 5: In a separate pan, heat oil for frying. To make bhature, mix 2 cups all-purpose flour, 1/4 teaspoon baking soda, 1/2 teaspoon salt, and 1 tablespoon yogurt in a bowl. Gradually add water to form a smooth dough. Let the dough rest for 30 Mins.",
        "Step 6: Divide the dough into small balls and roll them into thick discs. Fry them in hot oil until golden brown and puffed.",
        "Step 7: Serve the spicy chole with the warm bhature. Garnish with fresh coriander and sliced onions."
      ],
      "recipe_ingredients": [
        "1 cup dried chickpeas",
        "2 tablespoons oil",
        "1 large onion, finely chopped",
        "1 tablespoon ginger-garlic paste",
        "2 tomatoes, chopped",
        "1 teaspoon red chili powder",
        "1 teaspoon turmeric powder",
        "1 teaspoon coriander powder",
        "1 teaspoon garam masala",
        "Salt to taste",
        "1/4 teaspoon baking soda",
        "1/2 teaspoon salt (for bhature)",
        "2 cups all-purpose flour",
        "1 tablespoon yogurt",
        "Oil for frying",
        "Fresh coriander (for garnish)",
        "Sliced onions (for garnish)"
      ],
      "recipe_facts": {
        "Calories": 600,
        "Carbs": 90,
        "Fat": 18,
        "Protein": 15,
        "Fiber": 10,
        "Net Carbs": 80,
        "Sodium": 700,
        "Cholesterol": 0
      },
      "recipe_time": "1 Hr 30 Mins"
    },
    {
      "recipe_name": "Aloo Keema",
      "recipe_image": "https://img.freepik.com/premium-photo/authentic-keema-aloo-ground-beef-potatoes_762785-308845.jpg?w=826",
      "recipe_category": "BreakFast",
      "recipe_description": "A flavorful and hearty dish made with minced meat (usually mutton or chicken) and potatoes (aloo), cooked together with aromatic spices to create a comforting meal.",
      "recipe_steps": [
        "Step 1: Heat 2 tablespoons oil in a large pan. Add 1 finely chopped onion and sauté until golden brown.",
        "Step 2: Add 1 tablespoon ginger-garlic paste and cook for 1-2 Mins until fragrant.",
        "Step 3: Add 500g minced meat (chicken or mutton) and sauté until the meat is browned and cooked through.",
        "Step 4: Add 2 chopped tomatoes, 1 teaspoon red chili powder, 1 teaspoon turmeric powder, 1 teaspoon garam masala, 1 teaspoon coriander powder, and salt to taste. Cook until the tomatoes soften and the oil separates from the masala.",
        "Step 5: Add 3 medium-sized potatoes, peeled and cubed. Stir well to coat the potatoes in the spices.",
        "Step 6: Add 1 cup of water and cover the pan. Let it cook on medium heat until the potatoes are tender and the oil rises to the top (about 20-25 Mins).",
        "Step 7: Once the potatoes are cooked, check the seasoning and adjust salt and spices if necessary.",
        "Step 8: Garnish with fresh coriander leaves and serve hot with roti, naan, or rice."
      ],
      "recipe_ingredients": [
        "500g minced meat (chicken or mutton)",
        "2 tablespoons oil",
        "1 large onion, finely chopped",
        "1 tablespoon ginger-garlic paste",
        "2 tomatoes, chopped",
        "1 teaspoon red chili powder",
        "1 teaspoon turmeric powder",
        "1 teaspoon garam masala",
        "1 teaspoon coriander powder",
        "Salt to taste",
        "3 medium-sized potatoes, peeled and cubed",
        "1 cup water",
        "Fresh coriander (for garnish)"
      ],
      "recipe_facts": {
        "Calories": 450,
        "Carbs": 40,
        "Fat": 25,
        "Protein": 25,
        "Fiber": 5,
        "Net Carbs": 35,
        "Sodium": 600,
        "Cholesterol": 75
      },
      "recipe_time": "45 Mins"
    },
    {
      "recipe_name": "French Toast",
      "recipe_image": "https://img.freepik.com/premium-photo/homemade-french-toast-with-fresh-strawberry-whipping-cream_1339-153039.jpg?w=826",
      "recipe_category": "BreakFast",
      "recipe_description": "A delicious and easy BreakFast made by dipping bread slices in a rich mixture of eggs, milk, and spices, then pan-frying them until golden brown. It’s often served with syrup, fruits, or powdered sugar.",
      "recipe_steps": [
        "Step 1: In a shallow bowl, whisk together 2 eggs, 1/2 cup milk, 1/2 teaspoon cinnamon, 1/4 teaspoon vanilla extract, and a pinch of salt.",
        "Step 2: Heat a non-stick skillet or griddle over medium heat and add a small amount of butter to grease the surface.",
        "Step 3: Dip each slice of bread (preferably thick slices of white or whole wheat bread) into the egg mixture, making sure both sides are well-coated.",
        "Step 4: Place the coated bread slices onto the heated skillet and cook for 2-3 Mins on each side until golden brown and crispy.",
        "Step 5: Remove the cooked French toast from the pan and serve immediately, topped with syrup, powdered sugar, or fresh fruits like berries or banana slices."
      ],
      "recipe_ingredients": [
        "2 eggs",
        "1/2 cup milk",
        "1/2 teaspoon cinnamon",
        "1/4 teaspoon vanilla extract",
        "Pinch of salt",
        "4 slices of bread",
        "Butter (for cooking)",
        "Maple syrup (optional, for serving)",
        "Powdered sugar (optional, for serving)",
        "Fresh fruits (optional, for serving)"
      ],
      "recipe_facts": {
        "Calories": 200,
        "Carbs": 25,
        "Fat": 10,
        "Protein": 8,
        "Fiber": 2,
        "Net Carbs": 23,
        "Sodium": 300,
        "Cholesterol": 180
      },
      "recipe_time": "10 Mins"
    },
    {
      "recipe_name": "French Omelette",
      "recipe_image": "https://img.freepik.com/premium-photo/delicious-omlette-breakfast-plate-table_550617-46846.jpg?w=826",
      "recipe_category": "BreakFast",
      "recipe_description": "A classic French omelette is smooth, tender, and slightly runny on the inside. It’s made with just eggs, butter, and seasoning, and can be filled with a variety of herbs or cheese if desired.",
      "recipe_steps": [
        "Step 1: Crack 2-3 eggs into a bowl and whisk them gently with a pinch of salt and pepper until the yolks and whites are fully blended.",
        "Step 2: Heat a non-stick pan over medium-low heat and add 1 tablespoon of unsalted butter. Allow the butter to melt, swirling the pan to coat the bottom.",
        "Step 3: Pour the eggs into the pan. Allow them to cook undisturbed for about 10-15 seconds, until the edges start to set.",
        "Step 4: Using a fork or spatula, gently stir the eggs in the center while tilting the pan to allow the uncooked eggs to flow to the edges. Continue this process until most of the eggs are set but still slightly runny in the center.",
        "Step 5: Once the omelette is cooked to your liking (still soft and slightly runny inside), fold it into thirds and slide it onto a plate.",
        "Step 6: Optionally, sprinkle with fresh herbs like chives, parsley, or tarragon, or add a small amount of grated cheese before folding."
      ],
      "recipe_ingredients": [
        "2-3 eggs",
        "1 tablespoon unsalted butter",
        "Salt and pepper to taste",
        "Fresh herbs or cheese (optional)"
      ],
      "recipe_facts": {
        "Calories": 180,
        "Carbs": 2,
        "Fat": 15,
        "Protein": 12,
        "Fiber": 0,
        "Net Carbs": 2,
        "Sodium": 200,
        "Cholesterol": 370
      },
      "recipe_time": "5-7 Mins"
    },
    {
      "recipe_name": "Oats",
      "recipe_image": "https://img.freepik.com/premium-photo/oatmeal-with-berries-milk-bowl-brown-wooden-table-breakfast-healthy-food_262193-3079.jpg?w=826",
      "recipe_category": "BreakFast",
      "recipe_description": "A simple, Healthy BreakFast option made with oats, cooked with milk or water. It’s versatile and can be customized with various toppings like fruits, nuts, and sweeteners.",
      "recipe_steps": [
        "Step 1: In a saucepan, add 1 cup of rolled oats and 2 cups of water or milk. Bring to a simmer over medium heat.",
        "Step 2: Stir occasionally and cook for about 5-7 Mins, or until the oats are soft and have absorbed the liquid.",
        "Step 3: Once the oats are cooked, remove from heat and let them sit for a couple of Mins to thicken.",
        "Step 4: Serve the oats in a bowl. Add your choice of toppings such as sliced fruits, nuts, honey, cinnamon, or a dollop of yogurt for extra flavor and texture."
      ],
      "recipe_ingredients": [
        "1 cup rolled oats",
        "2 cups water or milk",
        "Toppings (optional): fruits, nuts, honey, cinnamon, yogurt"
      ],
      "recipe_facts": {
        "Calories": 150,
        "Carbs": 27,
        "Fat": 3,
        "Protein": 5,
        "Fiber": 4,
        "Net Carbs": 23,
        "Sodium": 0,
        "Cholesterol": 0
      },
      "recipe_time": "10 Mins"
    },
    {
      "recipe_name": "Pancakes",
      "recipe_image": "https://img.freepik.com/free-photo/pancakes-with-strawberries-chocolate-decorated-with-mint-leaf_2829-14003.jpg?t=st=1733062679~exp=1733066279~hmac=8814f88f8e8d17db0a688b4db4d09ccbb498079ad23e3acd5ad64361734e0051&w=826",
      "recipe_category": "BreakFast",
      "recipe_description": "Fluffy and golden, these pancakes are perfect for BreakFast. Made from a simple batter, they’re easy to customize with toppings like syrup, berries, or whipped cream.",
      "recipe_steps": [
        "Step 1: In a large bowl, whisk together 1 cup all-purpose flour, 2 tablespoons sugar, 1 tablespoon baking powder, and a pinch of salt.",
        "Step 2: In a separate bowl, beat together 1 egg, 1 cup milk, and 2 tablespoons melted butter or oil.",
        "Step 3: Pour the wet ingredients into the dry ingredients and stir until just combined. Be careful not to overmix; it’s okay if the batter is slightly lumpy.",
        "Step 4: Heat a non-stick skillet or griddle over medium heat and lightly grease with butter or oil.",
        "Step 5: Pour about 1/4 cup of batter onto the skillet for each pancake. Cook for 2-3 Mins, or until bubbles form on the surface. Flip the pancakes and cook for another 1-2 Mins, until golden brown on both sides.",
        "Step 6: Remove the pancakes from the skillet and serve hot with your favorite toppings such as maple syrup, fresh fruit, or whipped cream."
      ],
      "recipe_ingredients": [
        "1 cup all-purpose flour",
        "2 tablespoons sugar",
        "1 tablespoon baking powder",
        "Pinch of salt",
        "1 egg",
        "1 cup milk",
        "2 tablespoons melted butter or oil",
        "Butter or oil for cooking",
        "Toppings (optional): syrup, fresh fruit, whipped cream"
      ],
      "recipe_facts": {
        "Calories": 200,
        "Carbs": 30,
        "Fat": 8,
        "Protein": 5,
        "Fiber": 1,
        "Net Carbs": 29,
        "Sodium": 400,
        "Cholesterol": 55
      },
      "recipe_time": "15 Mins"
    }
  ],
  "vegetarian": [
    {
      "recipe_name": "Ramen",
      "recipe_image": "https://img.freepik.com/free-photo/freshly-cooked-ramen-noodles-with-pork-vegetables-generative-ai_188544-12759.jpg?t=st=1733064842~exp=1733068442~hmac=a6c9a246b263f2e1aa33d08ae1c106213fc16d88c3361ecde0e572fc4532b764&w=900",
      "recipe_category": "Vegetarian",
      "recipe_description": "A comforting bowl of Vegetarian ramen, featuring soft noodles in a savory broth, topped with fresh vegetables, tofu, and a boiled egg for extra protein.",
      "recipe_steps": [
        "Step 1: In a large pot, bring 4 cups of vegetable broth to a boil. Add 2 tablespoons of soy sauce, 1 tablespoon of miso paste, and a pinch of sesame oil.",
        "Step 2: While the broth is heating, cook the ramen noodles according to the package instructions (usually 3-4 Mins). Drain and set aside.",
        "Step 3: In the same pot, add sliced mushrooms, shredded carrots, and spinach. Let them simmer in the broth for 5 Mins until tender.",
        "Step 4: Add 1/2 cup of cubed tofu to the pot and cook for another 2 Mins.",
        "Step 5: Divide the cooked ramen noodles into bowls. Pour the vegetable broth and vegetables over the noodles.",
        "Step 6: Top with a soft-boiled egg, sliced green onions, and a sprinkle of sesame seeds or chili flakes for an extra kick."
      ],
      "recipe_ingredients": [
        "4 cups vegetable broth",
        "2 tablespoons soy sauce",
        "1 tablespoon miso paste",
        "1 tablespoon sesame oil",
        "2 servings ramen noodles",
        "1/2 cup sliced mushrooms",
        "1/2 cup shredded carrots",
        "1 cup spinach",
        "1/2 cup cubed tofu",
        "1 soft-boiled egg",
        "Sliced green onions (optional)",
        "Sesame seeds or chili flakes (optional)"
      ],
      "recipe_facts": {
        "Calories": 350,
        "Carbs": 45,
        "Fat": 12,
        "Protein": 18,
        "Fiber": 6,
        "Net Carbs": 39,
        "Sodium": 1000,
        "Cholesterol": 70
      },
      "recipe_time": "20 Mins"
    },
    {
      "recipe_name": "Aloo Paratha",
      "recipe_image": "https://img.freepik.com/premium-photo/thalipeeth-is-type-savoury-multi-grain-pancake-popular-maharashtra-india-served-with-curd-butter-ghee_466689-40584.jpg?w=826",
      "recipe_category": "Vegetarian",
      "recipe_description": "Aloo Paratha is a delicious Indian flatbread stuffed with spiced mashed potatoes, often served with yogurt, pickle, or chutney. It’s a popular BreakFast or lunch option.",
      "recipe_steps": [
        "Step 1: For the dough, mix 2 cups of whole wheat flour with a pinch of salt. Gradually add water and knead until smooth. Cover and set aside for 30 Mins.",
        "Step 2: For the filling, boil 2 large potatoes until soft. Mash them well and add 1/2 teaspoon cumin seeds, 1/2 teaspoon garam masala, 1/4 teaspoon turmeric, 1 teaspoon chili powder, 1 tablespoon chopped cilantro, and salt to taste. Mix well.",
        "Step 3: Divide the dough into small balls. Roll each ball into a small circle, then place a tablespoon of the potato filling in the center.",
        "Step 4: Fold the dough over the filling to seal it. Roll it gently to flatten into a paratha.",
        "Step 5: Heat a tava (griddle) or non-stick skillet over medium heat. Cook each paratha for 2-3 Mins on each side, brushing with ghee or oil until golden brown and crisp.",
        "Step 6: Serve hot with yogurt, pickle, or a dollop of butter."
      ],
      "recipe_ingredients": [
        "2 cups whole wheat flour",
        "Pinch of salt",
        "Water (as needed)",
        "2 large potatoes",
        "1/2 teaspoon cumin seeds",
        "1/2 teaspoon garam masala",
        "1/4 teaspoon turmeric powder",
        "1 teaspoon chili powder",
        "1 tablespoon chopped cilantro",
        "Ghee or oil for cooking",
        "Yogurt, pickle, or butter (for serving)"
      ],
      "recipe_facts": {
        "Calories": 250,
        "Carbs": 35,
        "Fat": 8,
        "Protein": 6,
        "Fiber": 5,
        "Net Carbs": 30,
        "Sodium": 300,
        "Cholesterol": 10
      },
      "recipe_time": "45 Mins"
    },
    {
      "recipe_name": "Paneer Butter Masala",
      "recipe_image": "https://img.freepik.com/free-photo/pakistani-dish-arrangement-high-angle_23-2148825115.jpg?t=st=1733064952~exp=1733068552~hmac=b0268f16aa1f815c326bf185b05f3c364cdcad6da0f0f2c4639072ef3e0ef774&w=826",
      "recipe_category": "Vegetarian",
      "recipe_description": "Paneer Butter Masala is a rich and creamy North Indian dish made with paneer cubes in a smooth, flavorful tomato-based sauce. It's best served with naan or rice.",
      "recipe_steps": [
        "Step 1: Heat 2 tablespoons of butter in a pan. Add 1 teaspoon cumin seeds and let them splutter. Then add 1 finely chopped onion and sauté until golden brown.",
        "Step 2: Add 1 tablespoon ginger-garlic paste and cook for a minute until the raw smell disappears.",
        "Step 3: Add 2 finely chopped tomatoes, 1 teaspoon chili powder, 1 teaspoon garam masala, 1/2 teaspoon turmeric, and salt to taste. Cook the mixture until the tomatoes soften and the oil separates.",
        "Step 4: Add 1/2 cup water or vegetable broth and blend the sauce using an immersion blender until smooth. Let it simmer for 5-7 Mins.",
        "Step 5: Add 200 grams of paneer cubes and stir gently to coat them with the sauce. Cook for 5 Mins until the paneer is heated through.",
        "Step 6: Stir in 1/4 cup fresh cream and 1 tablespoon butter. Adjust seasoning and cook for 2 more Mins.",
        "Step 7: Garnish with chopped cilantro and serve hot with naan or rice."
      ],
      "recipe_ingredients": [
        "2 tablespoons butter",
        "1 teaspoon cumin seeds",
        "1 onion, finely chopped",
        "1 tablespoon ginger-garlic paste",
        "2 tomatoes, finely chopped",
        "1 teaspoon chili powder",
        "1 teaspoon garam masala",
        "1/2 teaspoon turmeric powder",
        "Salt to taste",
        "1/2 cup water or vegetable broth",
        "200 grams paneer cubes",
        "1/4 cup fresh cream",
        "1 tablespoon butter",
        "Chopped cilantro for garnish"
      ],
      "recipe_facts": {
        "Calories": 400,
        "Carbs": 10,
        "Fat": 30,
        "Protein": 15,
        "Fiber": 3,
        "Net Carbs": 7,
        "Sodium": 600,
        "Cholesterol": 50
      },
      "recipe_time": "30 Mins"
    },
    {
      "recipe_name": "Vegetable Lasagna",
      "recipe_image": "https://img.freepik.com/free-photo/fresh-homemade-lasagna-leafs-plate-generative-ai_188544-8132.jpg?t=st=1733065025~exp=1733068625~hmac=1fada1d6b80130d9640aa57708113267073b2151ccbe5e3c82505d191ac4a460&w=826",
      "recipe_category": "Vegetarian",
      "recipe_description": "A wholesome and flavorful vegetable lasagna made with layers of pasta, a rich tomato sauce, ricotta, mozzarella, and a mix of fresh vegetables. It's a comforting meal that's perfect for family dinners.",
      "recipe_steps": [
        "Step 1: Preheat your oven to 375°F (190°C). Cook 9-12 lasagna noodles according to the package instructions, drain, and set aside.",
        "Step 2: In a large skillet, heat 2 tablespoons of olive oil. Add 1 chopped onion, 2 minced garlic cloves, and sauté until softened.",
        "Step 3: Add 1 cup sliced mushrooms, 1 zucchini (chopped), 1 cup spinach, and 1 cup chopped bell peppers. Cook for 5-7 Mins until the vegetables are tender.",
        "Step 4: Add 2 cups marinara sauce, 1 teaspoon dried basil, 1/2 teaspoon oregano, and salt to taste. Let the sauce simmer for 10 Mins.",
        "Step 5: In a bowl, mix 15 ounces ricotta cheese, 1 egg, 1 cup grated mozzarella cheese, and 1/4 cup grated Parmesan cheese. Add a pinch of salt and pepper.",
        "Step 6: In a baking dish, layer the lasagna starting with a thin layer of tomato sauce. Then add a layer of lasagna noodles, followed by a layer of the ricotta mixture, a layer of vegetables, and a sprinkle of mozzarella. Repeat the layers.",
        "Step 7: Finish with a top layer of noodles, sauce, and mozzarella cheese. Cover the baking dish with foil and bake for 25 Mins.",
        "Step 8: Remove the foil and bake for an additional 10 Mins or until the cheese is bubbly and golden brown.",
        "Step 9: Let the lasagna rest for 10 Mins before slicing. Serve hot!"
      ],
      "recipe_ingredients": [
        "9-12 lasagna noodles",
        "2 tablespoons olive oil",
        "1 onion, chopped",
        "2 cloves garlic, minced",
        "1 cup sliced mushrooms",
        "1 zucchini, chopped",
        "1 cup spinach",
        "1 cup chopped bell peppers",
        "2 cups marinara sauce",
        "1 teaspoon dried basil",
        "1/2 teaspoon oregano",
        "Salt and pepper to taste",
        "15 ounces ricotta cheese",
        "1 egg",
        "1 cup grated mozzarella cheese",
        "1/4 cup grated Parmesan cheese",
        "Extra mozzarella for topping"
      ],
      "recipe_facts": {
        "Calories": 350,
        "Carbs": 40,
        "Fat": 15,
        "Protein": 18,
        "Fiber": 6,
        "Net Carbs": 34,
        "Sodium": 700,
        "Cholesterol": 50
      },
      "recipe_time": "1 Hr"
    },
    {
      "recipe_name": "Chickpea Salad",
      "recipe_image": "https://img.freepik.com/premium-photo/plate-food-with-bowl-salad-it_975681-40072.jpg?w=740",
      "recipe_category": "Vegetarian",
      "recipe_description": "A refreshing and protein-packed chickpea Salad made with fresh vegetables and a tangy lemon dressing. Perfect as a light meal or a side dish.",
      "recipe_steps": [
        "Step 1: In a large bowl, combine 1 can (15 oz) of drained and rinsed chickpeas, 1 cup diced cucumber, 1 cup cherry tomatoes (halved), 1/2 red onion (finely chopped), and 1/4 cup chopped parsley.",
        "Step 2: In a separate small bowl, whisk together 3 tablespoons olive oil, 1 tablespoon lemon juice, 1 teaspoon honey, 1/2 teaspoon ground cumin, 1/2 teaspoon paprika, salt, and pepper to taste.",
        "Step 3: Pour the dressing over the chickpea mixture and toss gently to coat all ingredients evenly.",
        "Step 4: Let the Salad sit for 10-15 Mins to allow the flavors to meld together.",
        "Step 5: Serve immediately or refrigerate for up to 2 Hrs before serving. Garnish with extra parsley if desired."
      ],
      "recipe_ingredients": [
        "1 can (15 oz) chickpeas, drained and rinsed",
        "1 cup diced cucumber",
        "1 cup cherry tomatoes, halved",
        "1/2 red onion, finely chopped",
        "1/4 cup chopped parsley",
        "3 tablespoons olive oil",
        "1 tablespoon lemon juice",
        "1 teaspoon honey",
        "1/2 teaspoon ground cumin",
        "1/2 teaspoon paprika",
        "Salt and pepper to taste"
      ],
      "recipe_facts": {
        "Calories": 250,
        "Carbs": 30,
        "Fat": 12,
        "Protein": 8,
        "Fiber": 8,
        "Net Carbs": 22,
        "Sodium": 400,
        "Cholesterol": 0
      },
      "recipe_time": "20 Mins"
    },
    {
      "recipe_name": "Grilled Vegetable Tacos",
      "recipe_image": "https://img.freepik.com/free-photo/mexican-tacos-with-beef-tomato-sauce-salsa_2829-14194.jpg?t=st=1733065205~exp=1733068805~hmac=7853a5c273c4728c0d14d79a7b15d7515eefb82e360a3bbd272de403005cb3fb&w=826",
      "recipe_category": "Vegetarian",
      "recipe_description": "These Grilled Vegetable Tacos are filled with a colorful mix of seasoned vegetables, grilled to perfection and served in soft tortillas. They're a light, flavorful, and Healthy option for any meal.",
      "recipe_steps": [
        "Step 1: Preheat your grill or grill pan to medium-high heat.",
        "Step 2: Cut 1 zucchini, 1 bell pepper (red or yellow), 1 small onion, and 1/2 eggplant into bite-sized pieces.",
        "Step 3: In a bowl, toss the chopped vegetables with 2 tablespoons olive oil, 1 teaspoon ground cumin, 1 teaspoon smoked paprika, 1/2 teaspoon chili powder, salt, and pepper.",
        "Step 4: Grill the vegetables for about 5-7 Mins, turning occasionally, until they are tender and have nice grill marks.",
        "Step 5: Warm 6 soft corn or flour tortillas on the grill for 1-2 Mins.",
        "Step 6: To assemble, spoon the grilled vegetables into the warm tortillas. Top with your favorite toppings such as salsa, avocado slices, chopped cilantro, a squeeze of lime, and a dollop of sour cream or Greek yogurt.",
        "Step 7: Serve immediately and enjoy!"
      ],
      "recipe_ingredients": [
        "1 zucchini, chopped",
        "1 bell pepper (red or yellow), chopped",
        "1 small onion, chopped",
        "1/2 eggplant, chopped",
        "2 tablespoons olive oil",
        "1 teaspoon ground cumin",
        "1 teaspoon smoked paprika",
        "1/2 teaspoon chili powder",
        "Salt and pepper to taste",
        "6 soft corn or flour tortillas",
        "Salsa (optional)",
        "Avocado slices (optional)",
        "Chopped cilantro (optional)",
        "Lime (optional)",
        "Sour cream or Greek yogurt (optional)"
      ],
      "recipe_facts": {
        "Calories": 180,
        "Carbs": 25,
        "Fat": 8,
        "Protein": 3,
        "Fiber": 6,
        "Net Carbs": 19,
        "Sodium": 250,
        "Cholesterol": 0
      },
      "recipe_time": "25 Mins"
    },
    {
      "recipe_name": "Vegan Burritos",
      "recipe_image": "https://img.freepik.com/free-photo/delicious-food-table_23-2151902488.jpg?t=st=1733065379~exp=1733068979~hmac=46f34681e79fee4faef73570b56c632a2e74faa1278e8f97a5b0e310b1521d5d&w=740",
      "recipe_category": "Vegetarian",
      "recipe_description": "These Vegan Burritos are packed with seasoned black beans, rice, vegetables, and avocado, all wrapped in a soft tortilla for a hearty, Healthy, and satisfying meal.",
      "recipe_steps": [
        "Step 1: Cook 1 cup of rice according to package instructions and set aside.",
        "Step 2: In a pan, heat 1 tablespoon olive oil and sauté 1/2 chopped onion and 1 clove garlic until soft and fragrant.",
        "Step 3: Add 1 can (15 oz) black beans (drained and rinsed), 1 teaspoon cumin, 1/2 teaspoon chili powder, 1/4 teaspoon paprika, salt, and pepper to the pan. Cook for 5-7 Mins, stirring occasionally.",
        "Step 4: Heat 4 large flour tortillas on a skillet for 30 seconds on each side.",
        "Step 5: To assemble, place a spoonful of cooked rice in the center of each tortilla, followed by a generous amount of the black bean mixture.",
        "Step 6: Add fresh toppings such as sliced avocado, salsa, chopped cilantro, and a squeeze of lime juice.",
        "Step 7: Roll up the tortillas tightly, folding in the sides as you go, and serve immediately or wrap in foil for later."
      ],
      "recipe_ingredients": [
        "1 cup rice",
        "1 tablespoon olive oil",
        "1/2 onion, chopped",
        "1 clove garlic, minced",
        "1 can (15 oz) black beans, drained and rinsed",
        "1 teaspoon cumin",
        "1/2 teaspoon chili powder",
        "1/4 teaspoon paprika",
        "Salt and pepper to taste",
        "4 large flour tortillas",
        "1 avocado, sliced",
        "Salsa (optional)",
        "Chopped cilantro (optional)",
        "Lime (optional)"
      ],
      "recipe_facts": {
        "Calories": 320,
        "Carbs": 55,
        "Fat": 12,
        "Protein": 10,
        "Fiber": 12,
        "Net Carbs": 43,
        "Sodium": 450,
        "Cholesterol": 0
      },
      "recipe_time": "30 Mins"
    },
    {
      "recipe_name": "Chana Pulao",
      "recipe_image": "https://img.freepik.com/free-photo/top-view-tasty-pilaf-with-oil-dried-raisins-inside-plate-with-raw-rice-dark-surface_140725-19828.jpg?t=st=1733065457~exp=1733069057~hmac=a65934ad35170554c5dca72da0cc7b2ef10b61f20584ffd61b0ba41d4446e73f&w=826",
      "recipe_category": "Vegetarian",
      "recipe_description": "Chana Pulao is a flavorful one-pot dish made with basmati rice, chickpeas (chana), and aromatic spices. It's a Healthy, hearty, and satisfying meal that's both nutritious and delicious.",
      "recipe_steps": [
        "Step 1: Soak 1 cup basmati rice in water for 20-30 Mins, then drain.",
        "Step 2: In a pot, heat 2 tablespoons oil or ghee. Add 1 bay leaf, 2-3 green cardamom pods, 1 cinnamon stick, and 1/2 teaspoon cumin seeds. Let them sizzle for a few seconds.",
        "Step 3: Add 1 finely chopped onion and sauté until golden brown.",
        "Step 4: Add 1 teaspoon ginger-garlic paste and cook for another 1-2 Mins.",
        "Step 5: Add 1 can (15 oz) of cooked chickpeas (drained and rinsed), 1/2 teaspoon turmeric powder, 1 teaspoon cumin powder, 1 teaspoon garam masala, 1/2 teaspoon red chili powder, and salt to taste. Mix well and cook for 2-3 Mins.",
        "Step 6: Add the drained rice and 2 cups of water. Bring to a boil, then reduce the heat to low, cover, and cook for 15-20 Mins or until the rice is cooked and all the water is absorbed.",
        "Step 7: Garnish with fresh cilantro leaves and serve with raita or pickle."
      ],
      "recipe_ingredients": [
        "1 cup basmati rice",
        "2 tablespoons oil or ghee",
        "1 bay leaf",
        "2-3 green cardamom pods",
        "1 cinnamon stick",
        "1/2 teaspoon cumin seeds",
        "1 onion, finely chopped",
        "1 teaspoon ginger-garlic paste",
        "1 can (15 oz) chickpeas, drained and rinsed",
        "1/2 teaspoon turmeric powder",
        "1 teaspoon cumin powder",
        "1 teaspoon garam masala",
        "1/2 teaspoon red chili powder",
        "Salt to taste",
        "Fresh cilantro for garnish",
        "Raita or pickle for serving (optional)"
      ],
      "recipe_facts": {
        "Calories": 280,
        "Carbs": 50,
        "Fat": 8,
        "Protein": 9,
        "Fiber": 8,
        "Net Carbs": 42,
        "Sodium": 320,
        "Cholesterol": 0
      },
      "recipe_time": "40 Mins"
    },
    {
      "recipe_name": "Mac and Cheese",
      "recipe_image": "https://img.freepik.com/free-photo/delicious-creamy-melted-cheese_23-2149332820.jpg?t=st=1733065539~exp=1733069139~hmac=4136b44544122f1a7c100c65c4f7991795bc2611ccf3a9bd87fbe1320a5e3b0b&w=826",
      "recipe_category": "Vegetarian",
      "recipe_description": "Mac and Cheese is a comforting and creamy dish made with elbow macaroni and a rich cheese sauce. It's the ultimate comfort food, perfect for any meal or occasion.",
      "recipe_steps": [
        "Step 1: Cook 1 pound elbow macaroni according to package instructions, then drain and set aside.",
        "Step 2: In a large saucepan, melt 2 tablespoons butter over medium heat.",
        "Step 3: Add 2 tablespoons all-purpose flour to the butter and cook for 1-2 Mins, stirring constantly, until it forms a smooth roux.",
        "Step 4: Slowly whisk in 2 cups milk, ensuring there are no lumps. Cook for 3-5 Mins, stirring occasionally, until the mixture thickens.",
        "Step 5: Reduce the heat to low and stir in 2 cups shredded sharp cheddar cheese, 1/2 cup grated Parmesan cheese, and salt and pepper to taste.",
        "Step 6: Once the cheese is melted and the sauce is smooth, add the cooked macaroni to the sauce. Stir to combine until the pasta is fully coated.",
        "Step 7: Serve hot, optionally topped with extra cheese, breadcrumbs, or herbs."
      ],
      "recipe_ingredients": [
        "1 pound elbow macaroni",
        "2 tablespoons butter",
        "2 tablespoons all-purpose flour",
        "2 cups milk",
        "2 cups shredded sharp cheddar cheese",
        "1/2 cup grated Parmesan cheese",
        "Salt to taste",
        "Pepper to taste",
        "Breadcrumbs or extra cheese for topping (optional)"
      ],
      "recipe_facts": {
        "Calories": 350,
        "Carbs": 35,
        "Fat": 20,
        "Protein": 14,
        "Fiber": 2,
        "Net Carbs": 33,
        "Sodium": 600,
        "Cholesterol": 40
      },
      "recipe_time": "30 Mins"
    },
    {
      "recipe_name": "Veg Hakka Noodles",
      "recipe_image": "https://img.freepik.com/premium-photo/asian-noodles-with-cheese-tofu_1220-5218.jpg?w=826",
      "recipe_category": "vegetarian",
      "recipe_description": "Veg Hakka Noodles are a popular Indo-Chinese dish made with stir-fried noodles, vegetables, and savory sauces. It’s flavorful, colorful, and perfect for a quick meal.",
      "recipe_steps": [
        "Step 1: Cook 200g of Hakka noodles according to package instructions. Drain and set aside after tossing them in 1 teaspoon of oil to prevent sticking.",
        "Step 2: Heat 2 tablespoons of vegetable oil in a large wok or skillet over high heat.",
        "Step 3: Add 1 tablespoon minced garlic, 1 teaspoon minced ginger, and 2 finely chopped green chilies. Stir-fry for 30 seconds.",
        "Step 4: Add 1 cup shredded cabbage, 1/2 cup julienned carrots, 1/2 cup sliced bell peppers, and 1/2 cup sliced spring onions. Stir-fry the vegetables on high heat for 2-3 minutes until slightly tender but still crisp.",
        "Step 5: Add the cooked noodles to the wok and toss well with the vegetables.",
        "Step 6: Pour in 2 tablespoons soy sauce, 1 tablespoon chili sauce, 1 tablespoon vinegar, and 1/2 teaspoon black pepper. Mix everything well.",
        "Step 7: Adjust salt as needed, toss thoroughly, and stir-fry for another 2 minutes.",
        "Step 8: Garnish with spring onion greens and serve hot."
      ],
      "recipe_ingredients": [
        "200g Hakka noodles",
        "2 tablespoons vegetable oil",
        "1 tablespoon minced garlic",
        "1 teaspoon minced ginger",
        "2 green chilies, finely chopped",
        "1 cup shredded cabbage",
        "1/2 cup julienned carrots",
        "1/2 cup sliced bell peppers",
        "1/2 cup sliced spring onions",
        "2 tablespoons soy sauce",
        "1 tablespoon chili sauce",
        "1 tablespoon vinegar",
        "1/2 teaspoon black pepper",
        "Salt to taste",
        "Spring onion greens for garnish"
      ],
      "recipe_facts": {
        "Calories": 250,
        "Carbs": 35,
        "Fat": 8,
        "Protein": 6,
        "Fiber": 4,
        "Net Carbs": 31,
        "Sodium": 400,
        "Cholesterol": 0
      },
      "recipe_time": "30 Mins"
    }
    
  ],
  "nonVegetarian": [
    {
      "recipe_name": "BBQ Ribs",
      "recipe_image": "https://img.freepik.com/premium-photo/grilled-barbecue-pork-ribs_1339-95515.jpg?w=826",
      "recipe_category": "Non Vegetarian",
      "recipe_description": "BBQ Ribs are tender, juicy, and packed with smoky flavors, slathered in a tangy barbecue sauce. Perfect for grilling or baking, these ribs are a true crowd-pleaser.",
      "recipe_steps": [
        "Step 1: Preheat the oven to 300°F (150°C).",
        "Step 2: Remove the silver skin from the back of the ribs. Rub the ribs with a generous amount of BBQ rub, ensuring all sides are coated.",
        "Step 3: Wrap the ribs tightly in aluminum foil and place on a baking sheet.",
        "Step 4: Bake the ribs in the preheated oven for 2.5 to 3 Hrs, until tender.",
        "Step 5: Preheat a grill to medium-high heat.",
        "Step 6: Remove the ribs from the foil and brush with your favorite BBQ sauce.",
        "Step 7: Grill the ribs for 5-10 Mins, turning occasionally and brushing with more sauce, until the ribs are caramelized and slightly charred.",
        "Step 8: Let the ribs rest for a few Mins before cutting and serving."
      ],
      "recipe_ingredients": [
        "2 racks of baby back ribs",
        "1/4 cup BBQ rub (store-bought or homemade)",
        "1 cup BBQ sauce (your choice of flavor)"
      ],
      "recipe_facts": {
        "Calories": 450,
        "Carbs": 25,
        "Fat": 25,
        "Protein": 35,
        "Fiber": 2,
        "Net Carbs": 23,
        "Sodium": 800,
        "Cholesterol": 120
      },
      "recipe_time": "3 Hrs"
    },
    {
      "recipe_name": "Shawarma",
      "recipe_image": "https://img.freepik.com/free-photo/side-view-doner-with-grilled-chicken-greens-lettuce-tomato-french-fries-table_141793-4881.jpg?t=st=1733088692~exp=1733092292~hmac=039aaf3b38f8e7d2c1995c2ff808360657e759184faea9e0dd731f4664444faf&w=826",
      "recipe_category": "Non Vegetarian",
      "recipe_description": "Shawarma is a flavorful Middle Eastern dish made with marinated meat (usually chicken, beef, or lamb), grilled on a vertical rotisserie and served with warm pita bread, garlic sauce, and fresh vegetables.",
      "recipe_steps": [
        "Step 1: In a bowl, mix 2 cups of plain yogurt, 1 tablespoon ground cumin, 1 tablespoon paprika, 1 teaspoon turmeric, 1 teaspoon cinnamon, 4 cloves garlic (minced), the juice of 1 lemon, 1/4 cup olive oil, and salt and pepper to taste.",
        "Step 2: Add 1.5 pounds of boneless, skinless chicken thighs (or beef/lamb if preferred) to the marinade. Coat the meat thoroughly, cover, and let it marinate in the fridge for at least 2 Hrs, preferably overnight.",
        "Step 3: Preheat a grill or a grill pan over medium-high heat. Cook the marinated chicken for 5-7 Mins on each side, or until fully cooked through and charred.",
        "Step 4: While the chicken cooks, prepare the toppings: thinly slice some fresh cucumber, tomatoes, onions, and lettuce.",
        "Step 5: Warm up pita bread or flatbreads on the grill for 1-2 Mins.",
        "Step 6: Once the chicken is cooked, slice it into thin strips.",
        "Step 7: To assemble, place a few slices of the cooked chicken on the warm pita, add the fresh vegetables, and drizzle with tahini sauce or garlic sauce.",
        "Step 8: Wrap the pita around the fillings and serve immediately."
      ],
      "recipe_ingredients": [
        "2 cups plain yogurt",
        "1 tablespoon ground cumin",
        "1 tablespoon paprika",
        "1 teaspoon turmeric",
        "1 teaspoon cinnamon",
        "4 cloves garlic, minced",
        "Juice of 1 lemon",
        "1/4 cup olive oil",
        "Salt and pepper to taste",
        "1.5 pounds boneless, skinless chicken thighs (or beef/lamb)",
        "Pita bread or flatbreads",
        "Fresh cucumber, tomatoes, onions, and lettuce for toppings",
        "Tahini sauce or garlic sauce for drizzling"
      ],
      "recipe_facts": {
        "Calories": 400,
        "Carbs": 35,
        "Fat": 18,
        "Protein": 35,
        "Fiber": 5,
        "Net Carbs": 30,
        "Sodium": 700,
        "Cholesterol": 95
      },
      "recipe_time": "30 Mins"
    },
    {
      "recipe_name": "Chicken Korma",
      "recipe_image": "https://img.freepik.com/free-photo/delicious-food-table_23-2151902516.jpg?t=st=1733088784~exp=1733092384~hmac=beee03f317098dddcfec5efb27e171abab93c5e5fa0855ac8dd8fe7cb90b01a3&w=740",
      "recipe_category": "Non Vegetarian",
      "recipe_description": "Chicken Korma is a rich and creamy North Indian curry made with tender chicken pieces, yogurt, cream, and a blend of aromatic spices. It's a comforting dish perfect for pairing with naan or rice.",
      "recipe_steps": [
        "Step 1: Heat 2 tablespoons of ghee or oil in a large pan over medium heat. Add 1 large onion (finely sliced) and sauté until golden brown.",
        "Step 2: Add 1 tablespoon ginger-garlic paste and sauté for 1-2 Mins until fragrant.",
        "Step 3: Add 1 teaspoon ground turmeric, 1 teaspoon ground coriander, 1 teaspoon ground cumin, 1/2 teaspoon ground cinnamon, 1/2 teaspoon red chili powder, and salt to taste. Stir and cook for 1 minute.",
        "Step 4: Add 1.5 pounds of chicken (cut into pieces) and cook until the chicken is browned on all sides.",
        "Step 5: Add 1/2 cup of plain yogurt and 1/4 cup of cream, stirring to combine. Cook for 5-7 Mins until the chicken is cooked through and the sauce thickens.",
        "Step 6: Add 1/4 cup of water or chicken broth and cook for another 5 Mins. Adjust the consistency by adding more water if necessary.",
        "Step 7: Garnish with chopped cilantro and serve with naan or basmati rice."
      ],
      "recipe_ingredients": [
        "2 tablespoons ghee or oil",
        "1 large onion, finely sliced",
        "1 tablespoon ginger-garlic paste",
        "1 teaspoon ground turmeric",
        "1 teaspoon ground coriander",
        "1 teaspoon ground cumin",
        "1/2 teaspoon ground cinnamon",
        "1/2 teaspoon red chili powder",
        "Salt to taste",
        "1.5 pounds chicken, cut into pieces",
        "1/2 cup plain yogurt",
        "1/4 cup cream",
        "1/4 cup water or chicken broth",
        "Fresh cilantro for garnish",
        "Naan or basmati rice for serving"
      ],
      "recipe_facts": {
        "Calories": 450,
        "Carbs": 8,
        "Fat": 28,
        "Protein": 45,
        "Fiber": 1,
        "Net Carbs": 7,
        "Sodium": 500,
        "Cholesterol": 120
      },
      "recipe_time": "40 Mins"
    },
    {
      "recipe_name": "Seekh Kebabs",
      "recipe_image": "https://img.freepik.com/free-photo/minced-lula-kebab-grilled-turkey-chicken-plate_2829-6709.jpg?t=st=1733088817~exp=1733092417~hmac=0a28259fbd745b883bee7d8c38c56ec11fad2b07ca91a7f3c8a45b22249aabd2&w=826",
      "recipe_category": "Non Vegetarian",
      "recipe_description": "Seekh Kebabs are flavorful minced meat skewers, mixed with aromatic spices and herbs, then grilled to perfection. These kebabs are a popular dish in Indian, Middle Eastern, and Pakistani cuisine.",
      "recipe_steps": [
        "Step 1: In a large bowl, combine 1.5 pounds ground beef or chicken with 1 large onion (finely chopped), 2 tablespoons ginger-garlic paste, 1-2 green chilies (chopped), and a handful of fresh cilantro (chopped).",
        "Step 2: Add 1 teaspoon ground cumin, 1 teaspoon ground coriander, 1 teaspoon garam masala, 1/2 teaspoon ground turmeric, 1/2 teaspoon chili powder, and salt to taste. Mix everything well.",
        "Step 3: Add 1/4 cup breadcrumbs or chickpea flour, 1 egg (optional), and 2 tablespoons of yogurt to bind the mixture. Mix until the ingredients are well combined and hold together.",
        "Step 4: Divide the mixture into equal portions and mold them onto skewers, shaping the meat around each skewer.",
        "Step 5: Preheat the grill or oven to medium-high heat. If grilling, cook the kebabs for 8-10 Mins, turning occasionally to ensure even cooking. If baking, place the skewers on a baking sheet and bake at 400°F (200°C) for 15-20 Mins, flipping halfway through.",
        "Step 6: Once cooked, remove the kebabs from the grill or oven and let them rest for a few Mins.",
        "Step 7: Serve hot with naan, rice, or a side of raita and fresh Salad."
      ],
      "recipe_ingredients": [
        "1.5 pounds ground beef or chicken",
        "1 large onion, finely chopped",
        "2 tablespoons ginger-garlic paste",
        "1-2 green chilies, chopped",
        "A handful of fresh cilantro, chopped",
        "1 teaspoon ground cumin",
        "1 teaspoon ground coriander",
        "1 teaspoon garam masala",
        "1/2 teaspoon ground turmeric",
        "1/2 teaspoon chili powder",
        "Salt to taste",
        "1/4 cup breadcrumbs or chickpea flour",
        "1 egg (optional)",
        "2 tablespoons yogurt"
      ],
      "recipe_facts": {
        "Calories": 350,
        "Carbs": 10,
        "Fat": 22,
        "Protein": 30,
        "Fiber": 2,
        "Net Carbs": 8,
        "Sodium": 450,
        "Cholesterol": 75
      },
      "recipe_time": "30 Mins"
    },
    {
      "recipe_name": "Nihari",
      "recipe_image": "https://img.freepik.com/premium-photo/bowl-soup-with-bowl-food-table_662214-540185.jpg?w=826",
      "recipe_category": "Non Vegetarian",
      "recipe_description": "Nihari is a slow-cooked beef stew, simmered with a rich blend of spices and served with naan or rice. It’s a flavorful, hearty dish that’s popular in Pakistani and North Indian cuisine.",
      "recipe_steps": [
        "Step 1: Heat 3 tablespoons of ghee or oil in a large pot over medium heat. Add 2 large onions (thinly sliced) and sauté until golden brown.",
        "Step 2: Add 2 tablespoons ginger-garlic paste and cook for another 1-2 Mins until fragrant.",
        "Step 3: Add 1.5 pounds beef (with bone, such as shank or stew cuts) and brown the meat on all sides.",
        "Step 4: Add 1 tablespoon ground coriander, 1 teaspoon ground cumin, 1 teaspoon ground turmeric, 1 teaspoon garam masala, 1/2 teaspoon red chili powder, 1/2 teaspoon ground cinnamon, and salt to taste. Stir to coat the meat in the spices.",
        "Step 5: Add 4 cups of water and bring the mixture to a boil. Reduce the heat to low, cover, and simmer for 2-3 Hrs, stirring occasionally. The meat should be tender and the broth rich.",
        "Step 6: In a small bowl, mix 2 tablespoons of wheat flour with a little water to make a smooth paste. Slowly add this paste to the pot, stirring to thicken the gravy.",
        "Step 7: Cook for another 30 Mins to allow the gravy to thicken and the flavors to meld together.",
        "Step 8: Once cooked, remove from heat and garnish with fresh cilantro, green chilies, and a squeeze of lemon juice.",
        "Step 9: Serve hot with naan or basmati rice."
      ],
      "recipe_ingredients": [
        "3 tablespoons ghee or oil",
        "2 large onions, thinly sliced",
        "2 tablespoons ginger-garlic paste",
        "1.5 pounds beef (with bone, such as shank or stew cuts)",
        "1 tablespoon ground coriander",
        "1 teaspoon ground cumin",
        "1 teaspoon ground turmeric",
        "1 teaspoon garam masala",
        "1/2 teaspoon red chili powder",
        "1/2 teaspoon ground cinnamon",
        "Salt to taste",
        "4 cups water",
        "2 tablespoons wheat flour",
        "Fresh cilantro for garnish",
        "Green chilies for garnish",
        "Lemon juice for garnish",
        "Naan or basmati rice for serving"
      ],
      "recipe_facts": {
        "Calories": 500,
        "Carbs": 10,
        "Fat": 35,
        "Protein": 45,
        "Fiber": 2,
        "Net Carbs": 8,
        "Sodium": 700,
        "Cholesterol": 120
      },
      "recipe_time": "3-4 Hrs"
    },
    {
      "recipe_name": "Haleem",
      "recipe_image": "https://img.freepik.com/free-photo/indian-dhal-spicy-curry-bowl-spices-herbs-rustic-black-wooden-table_2829-18712.jpg?t=st=1733088855~exp=1733092455~hmac=5fe4452bd483002e7c60ca12725c23e187b45ce7513f63525f301d36873bf740&w=740",
      "recipe_category": "Non Vegetarian",
      "recipe_description": "Haleem is a traditional stew made from meat (usually beef or chicken), wheat, barley, and lentils, slow-cooked to a thick, hearty consistency. This popular dish is often enjoyed during special occasions and festive seasons.",
      "recipe_steps": [
        "Step 1: Heat 3 tablespoons of ghee or oil in a large pot. Add 2 large onions (thinly sliced) and sauté until golden brown. Remove half of the onions for garnishing later.",
        "Step 2: Add 2 tablespoons ginger-garlic paste and cook for 1-2 Mins until fragrant.",
        "Step 3: Add 1.5 pounds beef or chicken (bone-in pieces) and cook until browned on all sides.",
        "Step 4: Add 1 tablespoon ground coriander, 1 tablespoon ground cumin, 1 teaspoon garam masala, 1 teaspoon red chili powder, 1/2 teaspoon turmeric, 1/2 teaspoon ground cinnamon, and salt to taste. Stir well to coat the meat in the spices.",
        "Step 5: Add 1/2 cup split yellow lentils (moong dal), 1/2 cup wheat grains, 1/2 cup barley, and 4 cups water. Bring to a boil, then reduce the heat to low, cover, and cook for 2-3 Hrs, stirring occasionally, until the meat is tender and the grains are fully cooked.",
        "Step 6: Once the meat is tender, remove it from the pot and shred it into small pieces. Return the shredded meat to the pot.",
        "Step 7: Using a hand blender or a traditional grinder, blend the entire mixture to a smooth, thick consistency. Add water if necessary to adjust the texture.",
        "Step 8: Cook the mixture for another 15-20 Mins on low heat, stirring frequently, until it reaches a porridge-like consistency.",
        "Step 9: Serve hot, garnished with the fried onions, fresh cilantro, chopped green chilies, a squeeze of lemon, and a drizzle of ghee or fried onions."
      ],
      "recipe_ingredients": [
        "3 tablespoons ghee or oil",
        "2 large onions, thinly sliced",
        "2 tablespoons ginger-garlic paste",
        "1.5 pounds beef or chicken (bone-in pieces)",
        "1 tablespoon ground coriander",
        "1 tablespoon ground cumin",
        "1 teaspoon garam masala",
        "1 teaspoon red chili powder",
        "1/2 teaspoon turmeric",
        "1/2 teaspoon ground cinnamon",
        "Salt to taste",
        "1/2 cup split yellow lentils (moong dal)",
        "1/2 cup wheat grains",
        "1/2 cup barley",
        "4 cups water",
        "Fresh cilantro for garnish",
        "Chopped green chilies for garnish",
        "Lemon wedges for garnish",
        "Fried onions for garnish",
        "Ghee for garnish"
      ],
      "recipe_facts": {
        "Calories": 550,
        "Carbs": 50,
        "Fat": 28,
        "Protein": 30,
        "Fiber": 8,
        "Net Carbs": 42,
        "Sodium": 650,
        "Cholesterol": 120
      },
      "recipe_time": "3-4 Hrs"
    },
    {
      "recipe_name": "Karahi Gosht",
      "recipe_image": "https://img.freepik.com/premium-photo/spanish-meatballs-with-flatbread_875825-161064.jpg?w=826",
      "recipe_category": "Non Vegetarian",
      "recipe_description": "Karahi Gosht is a traditional Pakistani and Indian dish made with tender meat (usually goat or mutton), cooked in a wok-like pan called 'karahi' with a spicy tomato-based gravy, ginger, garlic, and fresh herbs.",
      "recipe_steps": [
        "Step 1: Heat 3 tablespoons of ghee or oil in a karahi or large skillet over medium heat. Add 2 large onions (finely chopped) and sauté until golden brown.",
        "Step 2: Add 2 tablespoons ginger-garlic paste and cook for another 1-2 Mins until fragrant.",
        "Step 3: Add 1.5 pounds mutton or goat meat (bone-in pieces) and cook until browned on all sides.",
        "Step 4: Add 1 tablespoon ground coriander, 1 teaspoon ground cumin, 1 teaspoon garam masala, 1 teaspoon red chili powder, 1/2 teaspoon turmeric, and salt to taste. Stir well to coat the meat with the spices.",
        "Step 5: Add 3 medium tomatoes (chopped) and cook until the tomatoes break down and become soft, about 5-7 Mins.",
        "Step 6: Add 1/2 cup water and cover the karahi. Let it simmer on low heat for 1-1.5 Hrs until the meat becomes tender and the flavors are well absorbed.",
        "Step 7: Once the meat is cooked and tender, add fresh coriander leaves, green chilies (slit), and a squeeze of lemon juice. Stir well.",
        "Step 8: Garnish with more fresh coriander leaves and serve hot with naan, paratha, or basmati rice."
      ],
      "recipe_ingredients": [
        "3 tablespoons ghee or oil",
        "2 large onions, finely chopped",
        "2 tablespoons ginger-garlic paste",
        "1.5 pounds mutton or goat meat (bone-in pieces)",
        "1 tablespoon ground coriander",
        "1 teaspoon ground cumin",
        "1 teaspoon garam masala",
        "1 teaspoon red chili powder",
        "1/2 teaspoon turmeric",
        "Salt to taste",
        "3 medium tomatoes, chopped",
        "1/2 cup water",
        "Fresh coriander leaves for garnish",
        "2-3 green chilies, slit for garnish",
        "Lemon juice for garnish"
      ],
      "recipe_facts": {
        "Calories": 600,
        "Carbs": 12,
        "Fat": 45,
        "Protein": 40,
        "Fiber": 2,
        "Net Carbs": 10,
        "Sodium": 800,
        "Cholesterol": 130
      },
      "recipe_time": "2 Hrs"
    },
    {
      "recipe_name": "Chapli Kebab",
      "recipe_image": "https://img.freepik.com/free-photo/steak-with-fried-potatoes-vegetables-wooden-board_140725-382.jpg?t=st=1733088985~exp=1733092585~hmac=1358ab88ec4e9d66cd18994c8a77015213319e701244c12df63de63ebb2f5ebc&w=740",
      "recipe_category": "Non Vegetarian",
      "recipe_description": "Chapli Kebab is a flavorful minced meat kebab made with ground beef or mutton, mixed with spices, herbs, and tomatoes, then fried to a crispy perfection. It's a popular dish in Pakistan and Afghanistan, often enjoyed with naan or yogurt.",
      "recipe_steps": [
        "Step 1: In a large bowl, mix 1.5 pounds ground beef or mutton, 1 finely chopped onion, 1 tablespoon ginger-garlic paste, 1 teaspoon ground coriander, 1 teaspoon ground cumin, 1/2 teaspoon red chili powder, 1 teaspoon garam masala, 1/2 teaspoon turmeric, and salt to taste.",
        "Step 2: Add 1 finely chopped tomato, 1/4 cup chopped fresh cilantro, 2-3 chopped green chilies, and 1/4 cup pomegranate seeds (optional) to the mixture.",
        "Step 3: Add 1 beaten egg, 2 tablespoons rice flour or chickpea flour (besan), and 1 tablespoon crushed dried fenugreek leaves (methi) to bind the mixture. Mix well until the ingredients are fully combined.",
        "Step 4: Shape the mixture into round or oval patties, pressing gently to flatten them.",
        "Step 5: Heat ghee or oil in a frying pan over medium heat. Fry the kebabs in batches for 4-5 Mins on each side, or until golden brown and crispy.",
        "Step 6: Once cooked, remove the kebabs from the pan and drain on paper towels to remove excess oil.",
        "Step 7: Serve the Chapli Kebabs hot with naan, raita, or a side of Salad."
      ],
      "recipe_ingredients": [
        "1.5 pounds ground beef or mutton",
        "1 large onion, finely chopped",
        "1 tablespoon ginger-garlic paste",
        "1 teaspoon ground coriander",
        "1 teaspoon ground cumin",
        "1/2 teaspoon red chili powder",
        "1 teaspoon garam masala",
        "1/2 teaspoon turmeric",
        "Salt to taste",
        "1 tomato, finely chopped",
        "1/4 cup fresh cilantro, chopped",
        "2-3 green chilies, chopped",
        "1/4 cup pomegranate seeds (optional)",
        "1 beaten egg",
        "2 tablespoons rice flour or chickpea flour (besan)",
        "1 tablespoon crushed dried fenugreek leaves (methi)",
        "Ghee or oil for frying"
      ],
      "recipe_facts": {
        "Calories": 450,
        "Carbs": 15,
        "Fat": 35,
        "Protein": 25,
        "Fiber": 2,
        "Net Carbs": 13,
        "Sodium": 600,
        "Cholesterol": 95
      },
      "recipe_time": "45 Mins"
    },
    {
      "recipe_name": "Fried Rice",
      "recipe_image": "https://img.freepik.com/free-photo/fried-rice-served-with-hot-syrup_157027-4061.jpg?t=st=1733089042~exp=1733092642~hmac=c8960432ab4d2f98edd33fc1eb1cc5adc8ae923c4760bd65469447014f88d990&w=900",
      "recipe_category": "Non Vegetarian",
      "recipe_description": "Fried rice is a popular dish made with cooked rice, vegetables, and choice of protein (chicken, shrimp, or beef), stir-fried together in a wok or large pan. It's a quick and flavorful meal often served as a side or main dish.",
      "recipe_steps": [
        "Step 1: Heat 2 tablespoons of oil or butter in a wok or large skillet over medium heat.",
        "Step 2: Add 1/2 cup diced chicken, shrimp, or beef (your choice of protein) and cook until browned and cooked through, about 5-7 Mins.",
        "Step 3: Add 1 finely chopped onion, 1/2 cup chopped carrots, and 1/2 cup peas. Stir-fry for 3-4 Mins until the vegetables are softened.",
        "Step 4: Push the vegetables and meat to one side of the pan and crack 2 eggs into the other side. Scramble the eggs until cooked through.",
        "Step 5: Add 4 cups of cooked and cooled rice (preferably day-old rice), breaking up any clumps. Stir well to combine.",
        "Step 6: Add 2 tablespoons soy sauce, 1 teaspoon sesame oil, and a pinch of black pepper. Stir everything together until evenly mixed and heated through.",
        "Step 7: Garnish with chopped green onions and serve hot."
      ],
      "recipe_ingredients": [
        "2 tablespoons oil or butter",
        "1/2 cup diced chicken, shrimp, or beef (your choice of protein)",
        "1/2 cup diced onion",
        "1/2 cup chopped carrots",
        "1/2 cup peas",
        "2 eggs",
        "4 cups cooked and cooled rice",
        "2 tablespoons soy sauce",
        "1 teaspoon sesame oil",
        "Black pepper to taste",
        "Chopped green onions for garnish"
      ],
      "recipe_facts": {
        "Calories": 450,
        "Carbs": 55,
        "Fat": 18,
        "Protein": 20,
        "Fiber": 3,
        "Net Carbs": 52,
        "Sodium": 800,
        "Cholesterol": 140
      },
      "recipe_time": "25 Mins"
    },
    {
      "recipe_name": "Wagyu Steak",
      "recipe_image": "https://img.freepik.com/free-photo/grilled-beef-steak-with-fries-grilled-tomato-pepper-sauces_140725-10545.jpg?t=st=1733089101~exp=1733092701~hmac=dcfc9865b95eabcffd1ec761723ae389766e95b80cb3c239fcdcdcafb1279039&w=826",
      "recipe_category": "Non Vegetarian",
      "recipe_description": "Wagyu steak is a luxurious, tender cut of beef known for its intense marbling and rich flavor. This steak is often cooked simply to preserve its natural flavor and texture, making it a true delicacy.",
      "recipe_steps": [
        "Step 1: Remove the Wagyu steak from the refrigerator and let it rest at room temperature for 30 Mins before cooking.",
        "Step 2: Preheat a cast-iron skillet or grill pan over medium-high heat. Add a small amount of oil with a high smoke point, such as vegetable or canola oil.",
        "Step 3: Season the Wagyu steak generously with salt and pepper on both sides. Optionally, you can also rub a little garlic powder or fresh garlic.",
        "Step 4: Once the pan is hot, place the steak in the skillet and cook for 2-3 Mins per side for medium-rare. Adjust cooking time based on your preferred doneness (less time for rare, more for well-done).",
        "Step 5: After cooking, remove the steak from the pan and let it rest for 5-10 Mins to allow the juices to redistribute.",
        "Step 6: Slice the Wagyu steak against the grain and serve with your choice of sides like mashed potatoes, steamed vegetables, or a light Salad."
      ],
      "recipe_ingredients": [
        "1 Wagyu steak (around 8-10 oz)",
        "Salt to taste",
        "Freshly ground black pepper to taste",
        "1-2 teaspoons vegetable or canola oil",
        "Optional: garlic powder or fresh garlic"
      ],
      "recipe_facts": {
        "Calories": 650,
        "Carbs": 0,
        "Fat": 50,
        "Protein": 45,
        "Fiber": 0,
        "Net Carbs": 0,
        "Sodium": 100,
        "Cholesterol": 120
      },
      "recipe_time": "15-20 Mins"
    }
  ],
  "kids": [
    {
      "recipe_name": "Chicken Nuggets",
      "recipe_image": "https://img.freepik.com/free-photo/bottom-view-fried-cheese-balls-lettuce-spice-bowls-chopping-board-table_140725-112105.jpg?t=st=1733065639~exp=1733069239~hmac=ca944dc71704b036e954eab66843c6322d95e49bd10d034e3e9f2f3bd1f80d21&w=826",
      "recipe_category": "Kids",
      "recipe_description": "Chicken nuggets are a popular snack or appetizer made from seasoned ground chicken, shaped into small pieces, breaded, and deep-fried until crispy. These nuggets are often served with a dipping sauce like ketchup, barbecue sauce, or honey mustard.",
      "recipe_steps": [
        "Step 1: In a bowl, mix 1 pound ground chicken, 1/4 cup breadcrumbs, 1/4 cup grated Parmesan cheese, 1 teaspoon garlic powder, 1 teaspoon onion powder, salt, and pepper to taste.",
        "Step 2: Add 1 beaten egg and 1 tablespoon of milk to the mixture, and mix until everything is well combined.",
        "Step 3: Shape the chicken mixture into small nugget-sized pieces, about 1 to 1.5 inches in diameter.",
        "Step 4: In a shallow bowl, add 1/2 cup flour and in another shallow bowl, add 1/2 cup breadcrumbs for coating.",
        "Step 5: Dip each nugget into the flour first, then coat it with the breadcrumbs, pressing lightly to ensure the breadcrumbs stick.",
        "Step 6: Heat 2 cups of oil in a deep fryer or large skillet to 350°F (175°C). Fry the nuggets in batches for 4-5 Mins, or until they are golden brown and crispy.",
        "Step 7: Remove the nuggets from the oil and drain on paper towels. Serve with your favorite dipping sauces."
      ],
      "recipe_ingredients": [
        "1 pound ground chicken",
        "1/4 cup breadcrumbs",
        "1/4 cup grated Parmesan cheese",
        "1 teaspoon garlic powder",
        "1 teaspoon onion powder",
        "Salt to taste",
        "Freshly ground black pepper to taste",
        "1 egg, beaten",
        "1 tablespoon milk",
        "1/2 cup flour for coating",
        "1/2 cup breadcrumbs for coating",
        "2 cups oil for frying"
      ],
      "recipe_facts": {
        "Calories": 250,
        "Carbs": 15,
        "Fat": 15,
        "Protein": 15,
        "Fiber": 1,
        "Net Carbs": 14,
        "Sodium": 350,
        "Cholesterol": 40
      },
      "recipe_time": "30 Mins"
    },
    {
      "recipe_name": "Chicken Drumsticks",
      "recipe_image": "https://img.freepik.com/premium-photo/board-with-roast-chicken-drumsticks-wooden-background_185193-36655.jpg?w=826",
      "recipe_category": "Kids",
      "recipe_description": "Chicken drumsticks are tender, juicy pieces of chicken that are seasoned and baked, grilled, or fried to perfection. They make a great main dish for any meal, served with a variety of sides.",
      "recipe_steps": [
        "Step 1: Preheat your oven to 425°F (220°C). Line a baking sheet with parchment paper or lightly grease it with cooking spray.",
        "Step 2: In a bowl, mix 2 tablespoons olive oil, 1 teaspoon garlic powder, 1 teaspoon paprika, 1/2 teaspoon onion powder, 1/2 teaspoon dried thyme, salt, and pepper to taste.",
        "Step 3: Pat dry 6 chicken drumsticks with paper towels. Rub the seasoning mixture evenly over the drumsticks, ensuring they are well coated.",
        "Step 4: Arrange the drumsticks on the prepared baking sheet, making sure they are not touching each other.",
        "Step 5: Bake the drumsticks in the preheated oven for 35-40 Mins, or until the internal temperature reaches 165°F (74°C) and the skin is crispy.",
        "Step 6: Remove the drumsticks from the oven and let them rest for 5 Mins before serving."
      ],
      "recipe_ingredients": [
        "6 chicken drumsticks",
        "2 tablespoons olive oil",
        "1 teaspoon garlic powder",
        "1 teaspoon paprika",
        "1/2 teaspoon onion powder",
        "1/2 teaspoon dried thyme",
        "Salt to taste",
        "Freshly ground black pepper to taste"
      ],
      "recipe_facts": {
        "Calories": 250,
        "Carbs": 2,
        "Fat": 18,
        "Protein": 20,
        "Fiber": 1,
        "Net Carbs": 1,
        "Sodium": 200,
        "Cholesterol": 70
      },
      "recipe_time": "45 Mins"
    },
    {
      "recipe_name": "Fruit Skewers",
      "recipe_image": "https://img.freepik.com/free-photo/fresh-fruit-skewers-colorful-gourmet-indulgence-generative-ai_188544-46402.jpg?t=st=1733065810~exp=1733069410~hmac=e791d49bf792e87a51e12ba1dbcdfa9e7eec3e497ed53b31f7fcf6263dbdb656&w=900",
      "recipe_category": "Kids",
      "recipe_description": "Fruit skewers are a refreshing and colorful treat made with a variety of fresh fruits, perfect for a light snack or a party appetizer. The fruits can be mixed and matched based on your preferences, offering a burst of natural sweetness.",
      "recipe_steps": [
        "Step 1: Prepare your fruits by washing and peeling them as needed. Choose a variety of fruits such as strawberries, grapes, pineapple, mango, and melon.",
        "Step 2: Cut larger fruits into bite-sized chunks. For example, slice the pineapple, melon, and mango into cubes, while keeping berries like grapes and strawberries whole.",
        "Step 3: Thread the fruit pieces onto wooden or metal skewers, alternating the types of fruit to create a colorful arrangement.",
        "Step 4: Arrange the skewers on a platter, and optionally drizzle with a bit of honey or lime juice for extra flavor.",
        "Step 5: Serve chilled, or refrigerate until ready to serve."
      ],
      "recipe_ingredients": [
        "1 cup strawberries, hulled",
        "1 cup grapes",
        "1/2 pineapple, cut into cubes",
        "1 mango, peeled and cut into cubes",
        "1 cup melon, cut into cubes",
        "Optional: honey or lime juice for drizzling"
      ],
      "recipe_facts": {
        "Calories": 100,
        "Carbs": 25,
        "Fat": 0,
        "Protein": 1,
        "Fiber": 3,
        "Net Carbs": 22,
        "Sodium": 5,
        "Cholesterol": 0
      },
      "recipe_time": "10 Mins"
    },
    {
      "recipe_name": "Chocolate Chip Cookies",
      "recipe_image": "https://img.freepik.com/free-photo/side-view-cookies-chocolate-cutting-board-sackcloth-blue-background_141793-11379.jpg?t=st=1733065844~exp=1733069444~hmac=b81e9b9017d11bd92a4b9f234e5ad52a0723c9676c59721915fc7764e3237903&w=826",
      "recipe_category": "Kids",
      "recipe_description": "Chocolate chip cookies are a classic, soft and chewy treat loved by Kids and adults alike. These cookies are made with a buttery dough, packed with sweet chocolate chips, and baked to golden perfection.",
      "recipe_steps": [
        "Step 1: Preheat the oven to 350°F (175°C). Line a baking sheet with parchment paper.",
        "Step 2: In a bowl, whisk together 1 1/2 cups all-purpose flour, 1/2 teaspoon baking soda, and a pinch of salt.",
        "Step 3: In another bowl, beat 1/2 cup softened butter, 1/2 cup sugar, and 1/2 cup brown sugar together until smooth and creamy.",
        "Step 4: Add 1 teaspoon vanilla extract and 1 large egg to the butter mixture. Beat until well combined.",
        "Step 5: Gradually add the dry ingredients to the wet ingredients and mix until combined.",
        "Step 6: Stir in 1 cup chocolate chips and mix until evenly distributed.",
        "Step 7: Drop spoonfuls of dough (about 1 tablespoon each) onto the prepared baking sheet, spacing them about 2 inches apart.",
        "Step 8: Bake in the preheated oven for 10-12 Mins or until the edges are golden brown. Remove from the oven and let them cool on the baking sheet for 5 Mins before transferring to a wire rack."
      ],
      "recipe_ingredients": [
        "1 1/2 cups all-purpose flour",
        "1/2 teaspoon baking soda",
        "Pinch of salt",
        "1/2 cup butter, softened",
        "1/2 cup sugar",
        "1/2 cup brown sugar",
        "1 teaspoon vanilla extract",
        "1 large egg",
        "1 cup chocolate chips"
      ],
      "recipe_facts": {
        "Calories": 200,
        "Carbs": 28,
        "Fat": 10,
        "Protein": 2,
        "Fiber": 1,
        "Net Carbs": 27,
        "Sodium": 100,
        "Cholesterol": 25
      },
      "recipe_time": "20-25 Mins"
    },
    {
      "recipe_name": "Cupcakes",
      "recipe_image": "https://img.freepik.com/free-photo/fancy-chocolate-cupcakes-with-toppings-decoration_23-2147840272.jpg?t=st=1733065922~exp=1733069522~hmac=49a8548d916594ddabf7e248fd371faa46e2febb74fb7e10f599af68e7c99a7d&w=826",
      "recipe_category": "Kids",
      "recipe_description": "Cupcakes are a fun, individual-sized treat that are perfect for Kids' parties or a sweet snack. These cupcakes are soft, fluffy, and can be decorated with colorful frosting and sprinkles to make them even more exciting.",
      "recipe_steps": [
        "Step 1: Preheat the oven to 350°F (175°C). Line a 12-cup muffin tin with paper cupcake liners.",
        "Step 2: In a bowl, whisk together 1 1/2 cups all-purpose flour, 1 1/2 teaspoons baking powder, and a pinch of salt.",
        "Step 3: In another bowl, cream together 1/2 cup butter and 1 cup sugar until light and fluffy.",
        "Step 4: Add 2 large eggs, one at a time, beating well after each addition. Stir in 1 teaspoon vanilla extract.",
        "Step 5: Gradually add the dry ingredients to the wet ingredients, alternating with 1/2 cup milk, beginning and ending with the dry ingredients. Mix until just combined.",
        "Step 6: Spoon the batter into the cupcake liners, filling each about 2/3 full.",
        "Step 7: Bake for 18-20 Mins or until a toothpick inserted into the center comes out clean.",
        "Step 8: Let the cupcakes cool in the tin for 5 Mins, then transfer to a wire rack to cool completely before frosting."
      ],
      "recipe_ingredients": [
        "1 1/2 cups all-purpose flour",
        "1 1/2 teaspoons baking powder",
        "Pinch of salt",
        "1/2 cup butter, softened",
        "1 cup sugar",
        "2 large eggs",
        "1 teaspoon vanilla extract",
        "1/2 cup milk"
      ],
      "recipe_facts": {
        "Calories": 180,
        "Carbs": 28,
        "Fat": 8,
        "Protein": 2,
        "Fiber": 1,
        "Net Carbs": 27,
        "Sodium": 150,
        "Cholesterol": 40
      },
      "recipe_time": "25-30 Mins"
    },
    {
      "recipe_name": "Jelly Cups",
      "recipe_image": "https://img.freepik.com/premium-photo/fruit-gelatin-glass-bowl_434193-7267.jpg?w=826",
      "recipe_category": "Kids",
      "recipe_description": "Jelly cups are a fun and colorful dessert, perfect for Kids. These cups are made from flavored gelatin, set in individual portions for an easy, grab-and-go treat. They can be topped with whipped cream or fruit for extra fun!",
      "recipe_steps": [
        "Step 1: In a saucepan, bring 1 1/2 cups water to a boil. Remove from heat.",
        "Step 2: Stir in one 3 oz packet of flavored gelatin (like strawberry, raspberry, or orange) until completely dissolved.",
        "Step 3: Add 1 1/2 cups cold water to the mixture and stir well.",
        "Step 4: Pour the gelatin mixture into small plastic or glass cups, filling each about 2/3 full.",
        "Step 5: Refrigerate the cups for 3-4 Hrs, or until the jelly is fully set and firm.",
        "Step 6: Serve the jelly cups as is, or top with whipped cream, fruit, or sprinkles for an extra treat."
      ],
      "recipe_ingredients": [
        "1 packet (3 oz) flavored gelatin",
        "1 1/2 cups boiling water",
        "1 1/2 cups cold water",
        "Optional toppings: whipped cream, fruit, sprinkles"
      ],
      "recipe_facts": {
        "Calories": 80,
        "Carbs": 20,
        "Fat": 0,
        "Protein": 1,
        "Fiber": 0,
        "Net Carbs": 20,
        "Sodium": 50,
        "Cholesterol": 0
      },
      "recipe_time": "5 Mins (plus 3-4 Hrs to set)"
    },
    {
      "recipe_name": "Mini Waffles",
      "recipe_image": "https://img.freepik.com/premium-photo/belgian-waffles-delicious-sweet-dish-dessert_88242-1539.jpg?w=826",
      "recipe_category": "Kids",
      "recipe_description": "Mini waffles are a delightful BreakFast or snack that Kids love. These waffles are crispy on the outside and soft on the inside, perfect for topping with syrup, fruit, or whipped cream.",
      "recipe_steps": [
        "Step 1: Preheat the waffle maker according to the manufacturer’s instructions.",
        "Step 2: In a bowl, whisk together 1 1/2 cups all-purpose flour, 1 tablespoon sugar, 1 teaspoon baking powder, and a pinch of salt.",
        "Step 3: In another bowl, whisk together 1 cup milk, 2 large eggs, 1/4 cup melted butter, and 1 teaspoon vanilla extract.",
        "Step 4: Gradually add the wet ingredients to the dry ingredients, stirring until just combined. The batter should be smooth and slightly thick.",
        "Step 5: Lightly grease the waffle maker with cooking spray or a little melted butter.",
        "Step 6: Pour a small amount of batter (about 1/4 cup) into the preheated waffle maker. Close the lid and cook according to the manufacturer’s instructions, usually about 3-4 Mins or until golden brown.",
        "Step 7: Carefully remove the waffles and serve warm with toppings like syrup, fruit, whipped cream, or powdered sugar."
      ],
      "recipe_ingredients": [
        "1 1/2 cups all-purpose flour",
        "1 tablespoon sugar",
        "1 teaspoon baking powder",
        "Pinch of salt",
        "1 cup milk",
        "2 large eggs",
        "1/4 cup melted butter",
        "1 teaspoon vanilla extract"
      ],
      "recipe_facts": {
        "Calories": 120,
        "Carbs": 18,
        "Fat": 5,
        "Protein": 3,
        "Fiber": 1,
        "Net Carbs": 17,
        "Sodium": 120,
        "Cholesterol": 30
      },
      "recipe_time": "10-15 Mins"
    },
    {
      "recipe_name": "Fruity Popsicles",
      "recipe_image": "https://img.freepik.com/premium-photo/fruit-ice-cream-stick-bright-color-summer-mood_756748-36353.jpg?w=826",
      "recipe_category": "Kids",
      "recipe_description": "Fruity popsicles are a refreshing and Healthy treat for Kids, made with fresh fruit and a bit of honey or juice. These popsicles are colorful, fun, and perfect for hot summer days.",
      "recipe_steps": [
        "Step 1: In a blender, combine 1 cup of fresh or frozen fruit (such as strawberries, mangoes, or berries) with 1/2 cup of fruit juice (orange juice or apple juice works well).",
        "Step 2: Blend until smooth. Taste and add a little honey or sweetener if you prefer a sweeter popsicle.",
        "Step 3: Pour the fruit mixture into popsicle molds, leaving a little space at the top.",
        "Step 4: Insert sticks into the molds and place them in the freezer.",
        "Step 5: Freeze for 4-6 Hrs or until completely frozen.",
        "Step 6: To release the popsicles from the molds, run warm water over the outside of the molds for a few seconds and gently pull the sticks."
      ],
      "recipe_ingredients": [
        "1 cup fresh or frozen fruit (e.g., strawberries, mango, berries)",
        "1/2 cup fruit juice (orange juice, apple juice)",
        "Optional: 1-2 tablespoons honey or sweetener"
      ],
      "recipe_facts": {
        "Calories": 50,
        "Carbs": 13,
        "Fat": 0,
        "Protein": 0,
        "Fiber": 2,
        "Net Carbs": 11,
        "Sodium": 0,
        "Cholesterol": 0
      },
      "recipe_time": "10 Mins (plus 4-6 Hrs to freeze)"
    },
    {
      "recipe_name": "Marshmallow Pops",
      "recipe_image": "https://img.freepik.com/premium-photo/color-marshmallow-pink-mini-buckets-sweet-compliment_290431-6495.jpg?w=826",
      "recipe_category": "Kids",
      "recipe_description": "Marshmallow pops are a fun, easy-to-make treat that Kids will love. These pops feature marshmallows coated in chocolate and colorful sprinkles, perfect for parties or as an after-school snack.",
      "recipe_steps": [
        "Step 1: Melt 1 cup of chocolate chips (milk, dark, or white chocolate) in a microwave-safe bowl, stirring every 30 seconds until smooth.",
        "Step 2: Insert a lollipop stick or skewer into each marshmallow.",
        "Step 3: Dip each marshmallow into the melted chocolate, covering it completely. Gently tap the stick to remove any excess chocolate.",
        "Step 4: Roll the chocolate-covered marshmallow in colorful sprinkles, crushed nuts, or mini chocolate chips.",
        "Step 5: Place the marshmallow pops on a parchment-lined tray and refrigerate for 15-20 Mins to set the chocolate.",
        "Step 6: Serve the marshmallow pops as a fun and colorful treat!"
      ],
      "recipe_ingredients": [
        "1 cup chocolate chips (milk, dark, or white)",
        "1 bag large marshmallows",
        "Lollipop sticks or skewers",
        "Optional toppings: colorful sprinkles, mini chocolate chips, crushed nuts"
      ],
      "recipe_facts": {
        "Calories": 120,
        "Carbs": 25,
        "Fat": 6,
        "Protein": 1,
        "Fiber": 1,
        "Net Carbs": 24,
        "Sodium": 5,
        "Cholesterol": 5
      },
      "recipe_time": "15-20 Mins"
    },
    {
      "recipe_name": "Banana Ice Cream",
      "recipe_image": "https://img.freepik.com/free-photo/view-delicious-frozen-ice-cream-dessert-with-bananas_23-2150822941.jpg?t=st=1733066254~exp=1733069854~hmac=1d5f7148ed00ece5b3ea50fe57f66e9ef911b0ae66a6a0bf1ce0112378e8b649&w=826",
      "recipe_category": "Kids",
      "recipe_description": "Banana ice cream is a creamy, Healthy alternative to traditional ice cream, made with frozen bananas. It's naturally sweet, dairy-free, and can be customized with various toppings or mix-ins like chocolate chips or peanut butter.",
      "recipe_steps": [
        "Step 1: Peel 2 ripe bananas and slice them into small pieces.",
        "Step 2: Place the banana slices in a single layer on a baking sheet and freeze for 2-3 Hrs or until solid.",
        "Step 3: Once frozen, place the banana pieces in a blender or food processor and blend until smooth. You may need to scrape down the sides of the blender occasionally.",
        "Step 4: Add 1/2 teaspoon of vanilla extract for flavor, and continue blending until the mixture is creamy and smooth.",
        "Step 5: Serve immediately for a soft-serve texture or transfer to a container and freeze for an additional 1-2 Hrs for a firmer texture.",
        "Step 6: Optionally, serve with toppings like chocolate chips, nuts, or berries."
      ],
      "recipe_ingredients": [
        "2 ripe bananas",
        "1/2 teaspoon vanilla extract (optional)",
        "Optional toppings: chocolate chips, nuts, berries"
      ],
      "recipe_facts": {
        "Calories": 90,
        "Carbs": 24,
        "Fat": 0,
        "Protein": 1,
        "Fiber": 3,
        "Net Carbs": 21,
        "Sodium": 0,
        "Cholesterol": 0
      },
      "recipe_time": "10 Mins"
    }
  ],
  "smoothies": [
    {
      "recipe_name": "Lassi",
      "recipe_image": "https://img.freepik.com/free-photo/ayran-drink-with-mint-cucumber-glass-wooden-table_123827-21428.jpg?t=st=1733066388~exp=1733069988~hmac=195110e92acf4077fb3228bf53182541efc3f45df79bc660a36aaf978ef88bdd&w=826",
      "recipe_category": "Smoothies",
      "recipe_description": "Lassi is a popular, refreshing yogurt-based drink from South Asia. It's smooth, creamy, and can be enjoyed sweet or salty. This sweet version is perfect for Kids, with a light flavor and a cooling effect, especially on hot days.",
      "recipe_steps": [
        "Step 1: In a blender, combine 1 cup plain yogurt, 1/2 cup milk, and 2 tablespoons sugar or honey.",
        "Step 2: Add a pinch of cardamom or a few drops of rose water (optional) for flavor.",
        "Step 3: Blend the mixture until smooth and creamy.",
        "Step 4: Add ice cubes to the blender for a chilled drink or serve the lassi over ice in glasses.",
        "Step 5: Optionally, garnish with a sprinkle of ground cardamom or a few fresh mint leaves for a refreshing touch.",
        "Step 6: Serve and enjoy your homemade lassi!"
      ],
      "recipe_ingredients": [
        "1 cup plain yogurt",
        "1/2 cup milk",
        "2 tablespoons sugar or honey",
        "Pinch of cardamom or a few drops of rose water (optional)",
        "Ice cubes (optional)",
        "Optional garnish: ground cardamom or fresh mint leaves"
      ],
      "recipe_facts": {
        "Calories": 120,
        "Carbs": 20,
        "Fat": 4,
        "Protein": 4,
        "Fiber": 0,
        "Net Carbs": 18,
        "Sodium": 40,
        "Cholesterol": 20
      },
      "recipe_time": "5 Mins"
    },
    {
      "recipe_name": "Strawberry Banana Shake",
      "recipe_image": "https://img.freepik.com/premium-photo/glass-strawberry-banana-smoothie_1169880-308184.jpg?w=826",
      "recipe_category": "Smoothies",
      "recipe_description": "A creamy and delicious shake made with fresh strawberries and bananas, perfect for a quick snack or BreakFast.",
      "recipe_steps": [
        "Step 1: Place 1 cup of fresh strawberries, 1 ripe banana, and 1/2 cup of milk in a blender.",
        "Step 2: Blend until smooth. Add honey or sweetener to taste if desired."
      ],
      "recipe_ingredients": [
        "1 cup fresh strawberries",
        "1 ripe banana",
        "1/2 cup milk",
        "Honey or sweetener (optional)"
      ],
      "recipe_facts": {
        "Calories": 180,
        "Carbs": 45,
        "Fat": 3,
        "Protein": 4,
        "Fiber": 5,
        "Net Carbs": 40,
        "Sodium": 40,
        "Cholesterol": 10
      },
      "recipe_time": "5 Mins"
    },
    {
      "recipe_name": "Green Detox Smoothie",
      "recipe_image": "https://img.freepik.com/premium-photo/green-spinach-smoothie-with-spirulina_214995-3938.jpg?w=826",
      "recipe_category": "Smoothies",
      "recipe_description": "A Healthy and energizing smoothie packed with green veggies, perfect for detoxifying and boosting your metabolism.",
      "recipe_steps": [
        "Step 1: Add 1 cup spinach, 1/2 cucumber, 1/2 green apple, and 1/2 lemon juice to a blender.",
        "Step 2: Pour in 1 cup coconut water or water and blend until smooth.",
        "Step 3: Add ice cubes for a chilled smoothie."
      ],
      "recipe_ingredients": [
        "1 cup spinach",
        "1/2 cucumber",
        "1/2 green apple",
        "1/2 lemon juice",
        "1 cup coconut water or water",
        "Ice cubes (optional)"
      ],
      "recipe_facts": {
        "Calories": 80,
        "Carbs": 20,
        "Fat": 1,
        "Protein": 2,
        "Fiber": 5,
        "Net Carbs": 15,
        "Sodium": 30,
        "Cholesterol": 0
      },
      "recipe_time": "10 Mins"
    },
    {
      "recipe_name": "Blueberry Almond Smoothie",
      "recipe_image": "https://img.freepik.com/premium-photo/close-up-ice-cream-table_1048944-21056257.jpg?w=740",
      "recipe_category": "Smoothies",
      "recipe_description": "A deliciously smooth and nutritious drink packed with antioxidants from blueberries and Healthy fats from almonds.",
      "recipe_steps": [
        "Step 1: Add 1 cup frozen blueberries, 1/4 cup almonds, and 1/2 cup Greek yogurt to a blender.",
        "Step 2: Pour in 1 cup almond milk and blend until smooth and creamy.",
        "Step 3: Add honey or a sweetener of choice for extra sweetness if desired."
      ],
      "recipe_ingredients": [
        "1 cup frozen blueberries",
        "1/4 cup almonds",
        "1/2 cup Greek yogurt",
        "1 cup almond milk",
        "Honey or sweetener (optional)"
      ],
      "recipe_facts": {
        "Calories": 200,
        "Carbs": 24,
        "Fat": 12,
        "Protein": 7,
        "Fiber": 6,
        "Net Carbs": 18,
        "Sodium": 50,
        "Cholesterol": 0
      },
      "recipe_time": "5 Mins"
    },
    {
      "recipe_name": "Kiwi Banana Smoothie",
      "recipe_image": "https://img.freepik.com/premium-photo/two-healthy-detox-smoothie-kiwi-banana-spinach-glasses-light-blue-background-with-fresh-ingredients_130716-1846.jpg?w=826",
      "recipe_category": "Smoothies",
      "recipe_description": "A refreshing and tangy smoothie with the perfect balance of sweet banana and zesty kiwi, great for a Healthy start to your day.",
      "recipe_steps": [
        "Step 1: Add 2 ripe kiwis (peeled), 1 ripe banana, and 1/2 cup Greek yogurt to a blender.",
        "Step 2: Pour in 1 cup coconut water or almond milk and blend until smooth.",
        "Step 3: Add ice cubes for a thicker consistency, if desired."
      ],
      "recipe_ingredients": [
        "2 ripe kiwis (peeled)",
        "1 ripe banana",
        "1/2 cup Greek yogurt",
        "1 cup coconut water or almond milk",
        "Ice cubes (optional)"
      ],
      "recipe_facts": {
        "Calories": 180,
        "Carbs": 45,
        "Fat": 2,
        "Protein": 6,
        "Fiber": 7,
        "Net Carbs": 38,
        "Sodium": 30,
        "Cholesterol": 5
      },
      "recipe_time": "5 Mins"
    },
    {
      "recipe_name": "Chocolate Banana Smoothie",
      "recipe_image": "https://img.freepik.com/free-photo/bananas-milkshake-arrangement-table_23-2150764388.jpg?t=st=1733067682~exp=1733071282~hmac=38ffbd74db62b421ed8cbbccb9d5d1682de29a013ff2b3ced4bfa38d236ce17b&w=826",
      "recipe_category": "Smoothies",
      "recipe_description": "A creamy and indulgent smoothie with the rich taste of chocolate and the sweetness of banana, perfect for satisfying your sweet cravings.",
      "recipe_steps": [
        "Step 1: Add 1 ripe banana, 1 tablespoon cocoa powder, and 1/2 cup Greek yogurt to a blender.",
        "Step 2: Pour in 1 cup almond milk or regular milk and blend until smooth.",
        "Step 3: Add ice cubes for a thicker consistency, if desired."
      ],
      "recipe_ingredients": [
        "1 ripe banana",
        "1 tablespoon cocoa powder",
        "1/2 cup Greek yogurt",
        "1 cup almond milk or regular milk",
        "Ice cubes (optional)"
      ],
      "recipe_facts": {
        "Calories": 220,
        "Carbs": 35,
        "Fat": 5,
        "Protein": 6,
        "Fiber": 5,
        "Net Carbs": 30,
        "Sodium": 60,
        "Cholesterol": 5
      },
      "recipe_time": "5 Mins"
    },
    {
      "recipe_name": "Pina Colada Smoothie",
      "recipe_image": "https://img.freepik.com/premium-photo/pina-colada-cocktail-with-pineapple-cherries-blue-background-generative-ai_634053-5886.jpg?w=826",
      "recipe_category": "Smoothies",
      "recipe_description": "A tropical and creamy smoothie with the sweet combination of pineapple and coconut, perfect for a refreshing summer drink.",
      "recipe_steps": [
        "Step 1: Add 1 cup frozen pineapple chunks, 1/2 cup coconut milk, and 1/2 cup Greek yogurt to a blender.",
        "Step 2: Pour in 1/2 cup coconut water and blend until smooth.",
        "Step 3: Add ice cubes for a thicker, slushier consistency, if desired."
      ],
      "recipe_ingredients": [
        "1 cup frozen pineapple chunks",
        "1/2 cup coconut milk",
        "1/2 cup Greek yogurt",
        "1/2 cup coconut water",
        "Ice cubes (optional)"
      ],
      "recipe_facts": {
        "Calories": 180,
        "Carbs": 40,
        "Fat": 7,
        "Protein": 4,
        "Fiber": 5,
        "Net Carbs": 35,
        "Sodium": 45,
        "Cholesterol": 10
      },
      "recipe_time": "5 Mins"
    },
    {
      "recipe_name": "Watermelon Mint Shake",
      "recipe_image": "https://img.freepik.com/premium-photo/ice-cream-wirh-watermelon-mint_221774-6425.jpg?w=826",
      "recipe_category": "Smoothies",
      "recipe_description": "A refreshing and hydrating shake with sweet watermelon and a hint of mint, perfect for a cooling summer treat.",
      "recipe_steps": [
        "Step 1: Add 2 cups watermelon chunks and 1/4 cup fresh mint leaves to a blender.",
        "Step 2: Pour in 1/2 cup coconut water or regular water and blend until smooth.",
        "Step 3: Add ice cubes for a colder and thicker consistency, if desired."
      ],
      "recipe_ingredients": [
        "2 cups watermelon chunks",
        "1/4 cup fresh mint leaves",
        "1/2 cup coconut water or regular water",
        "Ice cubes (optional)"
      ],
      "recipe_facts": {
        "Calories": 100,
        "Carbs": 25,
        "Fat": 0,
        "Protein": 2,
        "Fiber": 2,
        "Net Carbs": 23,
        "Sodium": 10,
        "Cholesterol": 0
      },
      "recipe_time": "5 Mins"
    },
    {
      "recipe_name": "Matcha Green Tea Smoothie",
      "recipe_image": "https://img.freepik.com/free-photo/iced-matcha-latte-plastic-cup-hands-woman_169016-43898.jpg?t=st=1733071975~exp=1733075575~hmac=dacac38be7eeb23c89d1a353b3b038320276c6517793e990467cc1d81dbfa428&w=826",
      "recipe_category": "Smoothies",
      "recipe_description": "A vibrant and energizing smoothie with the rich, earthy flavor of matcha green tea, perfect for boosting your day with antioxidants and a natural energy lift.",
      "recipe_steps": [
        "Step 1: Add 1 teaspoon matcha green tea powder, 1/2 cup Greek yogurt, and 1/2 banana to a blender.",
        "Step 2: Pour in 1 cup almond milk or coconut milk and blend until smooth.",
        "Step 3: Add honey or maple syrup to taste if you prefer a sweeter smoothie."
      ],
      "recipe_ingredients": [
        "1 teaspoon matcha green tea powder",
        "1/2 cup Greek yogurt",
        "1/2 banana",
        "1 cup almond milk or coconut milk",
        "Honey or maple syrup (optional)"
      ],
      "recipe_facts": {
        "Calories": 150,
        "Carbs": 20,
        "Fat": 4,
        "Protein": 8,
        "Fiber": 5,
        "Net Carbs": 15,
        "Sodium": 50,
        "Cholesterol": 10
      },
      "recipe_time": "5 Mins"
    },
    {
      "recipe_name": "Tropical Green Smoothie",
      "recipe_image": "https://img.freepik.com/free-photo/green-apple-smoothie-wooden-table_53876-139861.jpg?t=st=1733066771~exp=1733070371~hmac=976fb46c59883d0f29d99f2cafce51e269670a072998a479db74492149aebc7c&w=740",
      "recipe_category": "Smoothies",
      "recipe_description": "A vibrant and nutrient-packed smoothie with a mix of tropical fruits and leafy greens, perfect for a Healthy and refreshing boost.",
      "recipe_steps": [
        "Step 1: Add 1/2 cup frozen mango, 1/2 cup frozen pineapple, and 1/2 cup spinach to a blender.",
        "Step 2: Pour in 1 cup coconut water or almond milk and blend until smooth.",
        "Step 3: Add 1/2 banana for added creaminess and sweetness, and blend again."
      ],
      "recipe_ingredients": [
        "1/2 cup frozen mango",
        "1/2 cup frozen pineapple",
        "1/2 cup spinach",
        "1 cup coconut water or almond milk",
        "1/2 banana"
      ],
      "recipe_facts": {
        "Calories": 180,
        "Carbs": 45,
        "Fat": 3,
        "Protein": 4,
        "Fiber": 7,
        "Net Carbs": 38,
        "Sodium": 40,
        "Cholesterol": 0
      },
      "recipe_time": "5 Mins"
    },
    {
      "recipe_name": "Coffee Protein Shake",
      "recipe_image": "https://img.freepik.com/premium-photo/shaker-bottle-with-whey-protein-powder-mixing-isolated-white-background-concept-shaker-bottle-whey-protein-powder-mixing-isolated-background-fitness-essentials_864588-152749.jpg?w=996",
      "recipe_category": "Smoothies",
      "recipe_description": "A rich and energizing shake that combines the bold taste of coffee with protein, perfect for a morning boost or post-workout recovery.",
      "recipe_steps": [
        "Step 1: Add 1 scoop vanilla or chocolate protein powder, 1/2 cup brewed coffee (cooled), and 1/2 banana to a blender.",
        "Step 2: Pour in 1/2 cup almond milk or regular milk and blend until smooth.",
        "Step 3: Add ice cubes for a thicker consistency or extra chill, and blend again."
      ],
      "recipe_ingredients": [
        "1 scoop vanilla or chocolate protein powder",
        "1/2 cup brewed coffee (cooled)",
        "1/2 banana",
        "1/2 cup almond milk or regular milk",
        "Ice cubes (optional)"
      ],
      "recipe_facts": {
        "Calories": 220,
        "Carbs": 20,
        "Fat": 6,
        "Protein": 20,
        "Fiber": 4,
        "Net Carbs": 16,
        "Sodium": 90,
        "Cholesterol": 15
      },
      "recipe_time": "5 Mins"
    }
  ],
  "easyonstomach": [
    {
      "recipe_name": "Oatmeal",
      "recipe_image": "https://img.freepik.com/free-photo/oatmeal-porridge-with-berries-white-bowl_2829-16741.jpg?t=st=1733072503~exp=1733076103~hmac=4aab72c4f06613168b734fecd29abb18dca9f17e8d3be994f763e39ca2a60aa7&w=826",
      "recipe_category": "Easy on Stomach",
      "recipe_description": "Oatmeal is a gentle, nutritious, and easy-to-digest BreakFast that's perfect for sensitive stomachs. It's rich in fiber and can be customized with toppings like fruits, nuts, or honey for added flavor.",
      "recipe_steps": [
        "Step 1: In a saucepan, combine 1/2 cup rolled oats and 1 cup water or milk.",
        "Step 2: Bring the mixture to a simmer over medium heat, stirring occasionally.",
        "Step 3: Cook for about 5-7 Mins, or until the oats have absorbed most of the liquid and have a creamy texture.",
        "Step 4: Remove from heat and let the oatmeal sit for a minute or two to thicken.",
        "Step 5: Add a sweetener of choice, such as honey or maple syrup, and stir to combine.",
        "Step 6: Serve with your favorite toppings like fresh fruit, nuts, or a sprinkle of cinnamon."
      ],
      "recipe_ingredients": [
        "1/2 cup rolled oats",
        "1 cup water or milk",
        "Optional sweetener: honey or maple syrup",
        "Optional toppings: fresh fruit, nuts, cinnamon"
      ],
      "recipe_facts": {
        "Calories": 150,
        "Carbs": 27,
        "Fat": 3,
        "Protein": 5,
        "Fiber": 4,
        "Net Carbs": 23,
        "Sodium": 0,
        "Cholesterol": 0
      },
      "recipe_time": "10 Mins"
    },
    {
      "recipe_name": "Steamed Fish",
      "recipe_image": "https://img.freepik.com/free-photo/tom-yum-crab-with-lemon-chili-tomato-garlic-lemongrass-kaffir-lime-leaves-plate_1150-25816.jpg?t=st=1733072544~exp=1733076144~hmac=02f5b8b083678709f06b91aa374fe09dd7b9975a79d102d2300b3472d108f0c1&w=826",
      "recipe_category": "Easy on Stomach",
      "recipe_description": "Steamed fish is a light, Healthy, and easy-to-digest meal. Steaming helps retain the nutrients and natural flavors of the fish, making it a perfect choice for those with sensitive stomachs. It’s also a great source of protein and omega-3 fatty acids.",
      "recipe_steps": [
        "Step 1: Season the fish fillets (like cod or tilapia) with salt, pepper, and a squeeze of lemon juice.",
        "Step 2: Place the seasoned fish on a heatproof plate, and add a few slices of ginger and garlic on top for extra flavor.",
        "Step 3: Prepare a steamer by bringing water to a boil in the bottom compartment. Place the plate with fish into the steamer and cover.",
        "Step 4: Steam the fish for about 8-10 Mins, or until it is opaque and easily flakes with a fork.",
        "Step 5: Garnish with fresh herbs like cilantro or parsley, and serve with a side of steamed vegetables or rice."
      ],
      "recipe_ingredients": [
        "2 fish fillets (cod, tilapia, or any mild white fish)",
        "Salt and pepper to taste",
        "1 lemon (for squeezing)",
        "2 slices of ginger",
        "2 cloves garlic, sliced",
        "Fresh herbs for garnish (optional)"
      ],
      "recipe_facts": {
        "Calories": 180,
        "Carbs": 2,
        "Fat": 6,
        "Protein": 30,
        "Fiber": 0,
        "Net Carbs": 2,
        "Sodium": 60,
        "Cholesterol": 50
      },
      "recipe_time": "15 Mins"
    },
    {
      "recipe_name": "Avocado Toast",
      "recipe_image": "https://img.freepik.com/premium-photo/healthy-avocado-sandwich-toast-bread-mushed-avocado-paste-wooden-background-guacamole_4740-430.jpg?w=826",
      "recipe_category": "Easy on Stomach",
      "recipe_description": "Avocado toast is a simple, creamy, and nutritious dish that's gentle on the stomach. The Healthy fats in avocado make it a great option for easy digestion, and it can be easily customized with toppings like eggs or tomatoes.",
      "recipe_steps": [
        "Step 1: Toast 1-2 slices of whole-grain or gluten-free bread to your desired crispiness.",
        "Step 2: While the bread is toasting, cut 1 ripe avocado in half, remove the pit, and scoop the flesh into a bowl.",
        "Step 3: Mash the avocado with a fork until smooth. Add a pinch of salt, pepper, and a squeeze of lemon juice for extra flavor.",
        "Step 4: Spread the mashed avocado evenly on the toasted bread.",
        "Step 5: Optional: Top with a poached egg, cherry tomatoes, or a sprinkle of chili flakes for added flavor."
      ],
      "recipe_ingredients": [
        "1 ripe avocado",
        "1-2 slices of whole-grain or gluten-free bread",
        "Salt and pepper to taste",
        "1 teaspoon lemon juice",
        "Optional toppings: poached egg, cherry tomatoes, chili flakes"
      ],
      "recipe_facts": {
        "Calories": 220,
        "Carbs": 20,
        "Fat": 15,
        "Protein": 4,
        "Fiber": 9,
        "Net Carbs": 11,
        "Sodium": 150,
        "Cholesterol": 0
      },
      "recipe_time": "5 Mins"
    },
    {
      "recipe_name": "Rice Pudding",
      "recipe_image": "https://img.freepik.com/premium-photo/dessert-rice-pudding_103357-39.jpg?w=826",
      "recipe_category": "Easy on Stomach",
      "recipe_description": "Rice pudding is a comforting, creamy dessert made with rice, milk, and a touch of sweetness. It's easy to digest and soothing for the stomach, making it a great option for those with sensitive digestive systems.",
      "recipe_steps": [
        "Step 1: In a saucepan, combine 1/2 cup of rice, 2 cups of milk (or a dairy-free alternative), and 1/4 cup of sugar.",
        "Step 2: Bring the mixture to a simmer over medium heat, stirring occasionally to prevent the rice from sticking to the bottom.",
        "Step 3: Reduce the heat to low and cook for about 20-25 Mins, or until the rice is soft and the mixture has thickened.",
        "Step 4: Add 1/2 teaspoon of vanilla extract and a pinch of cinnamon (optional) for flavor.",
        "Step 5: Allow the rice pudding to cool for a few Mins before serving. Serve warm or chilled, topped with a sprinkle of cinnamon or a few raisins."
      ],
      "recipe_ingredients": [
        "1/2 cup rice",
        "2 cups milk (or dairy-free alternative)",
        "1/4 cup sugar",
        "1/2 teaspoon vanilla extract",
        "Pinch of cinnamon (optional)",
        "Raisins for garnish (optional)"
      ],
      "recipe_facts": {
        "Calories": 180,
        "Carbs": 35,
        "Fat": 5,
        "Protein": 5,
        "Fiber": 1,
        "Net Carbs": 30,
        "Sodium": 50,
        "Cholesterol": 10
      },
      "recipe_time": "30 Mins"
    },
    {
      "recipe_name": "Miso Soup",
      "recipe_image": "https://img.freepik.com/premium-photo/ramen-traditional-fast-food-meal-japanese-cuisine_201836-8563.jpg?w=826",
      "recipe_category": "Easy on Stomach",
      "recipe_description": "Miso soup is a light, savory soup made from miso paste and broth. It's easy on the stomach and provides probiotics from the fermented miso, making it a great option for digestion. It's gentle yet flavorful, ideal for a soothing meal.",
      "recipe_steps": [
        "Step 1: In a small pot, heat 2 cups of water or vegetable broth over medium heat.",
        "Step 2: Add 1 tablespoon of miso paste to the pot and stir until it dissolves completely into the broth.",
        "Step 3: Add 1/4 cup of diced tofu and 1 tablespoon of dried seaweed (optional) to the pot.",
        "Step 4: Let the soup simmer for 5 Mins, ensuring the tofu is heated through.",
        "Step 5: Taste and adjust the seasoning, adding more miso paste if needed.",
        "Step 6: Serve hot, optionally garnishing with chopped green onions or a sprinkle of sesame seeds."
      ],
      "recipe_ingredients": [
        "2 cups water or vegetable broth",
        "1 tablespoon miso paste",
        "1/4 cup diced tofu",
        "1 tablespoon dried seaweed (optional)",
        "Green onions or sesame seeds for garnish (optional)"
      ],
      "recipe_facts": {
        "Calories": 70,
        "Carbs": 7,
        "Fat": 3,
        "Protein": 5,
        "Fiber": 1,
        "Net Carbs": 6,
        "Sodium": 700,
        "Cholesterol": 0
      },
      "recipe_time": "10 Mins"
    },
    {
      "recipe_name": "Toast with Butter",
      "recipe_image": "https://img.freepik.com/free-photo/vegetarian-sandwich-toast-bread-mashed-potato-greens-wooden-board-side-view_141793-4170.jpg?t=st=1733073008~exp=1733076608~hmac=7f58cd7822fded9ae58ea3781776e8a993482a8e2e248e2cffc2dae10855b028&w=826",
      "recipe_category": "Easy on Stomach",
      "recipe_description": "Toast with butter is a simple, light meal that is gentle on the stomach. It's a quick and comforting option for BreakFast or a snack, with the warmth of the toasted bread and the richness of butter.",
      "recipe_steps": [
        "Step 1: Place a slice of your preferred bread (whole wheat, white, or gluten-free) into a toaster or on a pan.",
        "Step 2: Toast the bread to your desired level of crispiness.",
        "Step 3: While the bread is still warm, spread 1-2 tablespoons of butter evenly on top.",
        "Step 4: Optionally, sprinkle a little salt or a drizzle of honey for added flavor.",
        "Step 5: Serve immediately and enjoy with a hot beverage like tea or coffee."
      ],
      "recipe_ingredients": [
        "1 slice of bread (whole wheat, white, or gluten-free)",
        "1-2 tablespoons butter",
        "Salt or honey (optional)"
      ],
      "recipe_facts": {
        "Calories": 150,
        "Carbs": 15,
        "Fat": 9,
        "Protein": 2,
        "Fiber": 1,
        "Net Carbs": 14,
        "Sodium": 150,
        "Cholesterol": 30
      },
      "recipe_time": "5 Mins"
    },
    {
      "recipe_name": "Chicken Broth Soup",
      "recipe_image": "https://img.freepik.com/free-photo/front-view-tasty-vermicelli-soup-inside-plate-light-grey-background-dough-sauce-food-dish-photo-pasta_140725-139494.jpg?t=st=1733073046~exp=1733076646~hmac=cd73f66d5bcfad4d96010739dcb41f388a056ade0ca8eec88dd8bac6eeab5455&w=826",
      "recipe_category": "Easy on Stomach",
      "recipe_description": "Chicken broth soup is a light and nourishing soup that is gentle on the stomach. It is made with simple ingredients like chicken, vegetables, and herbs, providing warmth and comfort while aiding digestion.",
      "recipe_steps": [
        "Step 1: In a large pot, add 4 cups of water and 1-2 chicken breasts (or bone-in chicken for more flavor). Bring it to a boil.",
        "Step 2: Lower the heat and simmer the chicken for 30-40 Mins, or until fully cooked and tender.",
        "Step 3: Remove the chicken from the pot and shred it into small pieces.",
        "Step 4: Add 1/2 cup of diced carrots, 1/2 cup of celery, and 1/2 cup of onion to the pot, and cook for another 10-15 Mins.",
        "Step 5: Add the shredded chicken back into the pot and season with salt, pepper, and optional herbs like thyme or parsley.",
        "Step 6: Let the soup simmer for an additional 10 Mins to allow the flavors to combine.",
        "Step 7: Serve hot, optionally garnishing with fresh parsley."
      ],
      "recipe_ingredients": [
        "4 cups water",
        "1-2 chicken breasts (or bone-in chicken)",
        "1/2 cup diced carrots",
        "1/2 cup diced celery",
        "1/2 cup diced onion",
        "Salt and pepper to taste",
        "Optional herbs: thyme, parsley"
      ],
      "recipe_facts": {
        "Calories": 120,
        "Carbs": 8,
        "Fat": 5,
        "Protein": 15,
        "Fiber": 2,
        "Net Carbs": 6,
        "Sodium": 600,
        "Cholesterol": 40
      },
      "recipe_time": "1 Hr"
    },
    {
      "recipe_name": "Plain Rice with Vegetables",
      "recipe_image": "https://img.freepik.com/premium-photo/indian-veg-biryani-veg-pulav-with-cheese-green-peas_44562-134.jpg?w=826",
      "recipe_category": "Easy on Stomach",
      "recipe_description": "Plain rice with steamed vegetables is a light, easy-to-digest meal that is gentle on the stomach. It’s a simple yet nutritious dish that provides fiber, vitamins, and energy without overwhelming the digestive system.",
      "recipe_steps": [
        "Step 1: Rinse 1 cup of rice under cold water until the water runs clear.",
        "Step 2: Cook the rice by bringing 2 cups of water to a boil in a pot, then adding the rice. Cover, reduce the heat, and simmer for about 15-20 Mins or until the rice is tender and the water is absorbed.",
        "Step 3: While the rice is cooking, prepare the vegetables. You can use a mix of vegetables like carrots, broccoli, zucchini, or green beans.",
        "Step 4: Steam the vegetables for about 5-7 Mins until they are tender but still vibrant and crisp.",
        "Step 5: Once the rice is ready, fluff it with a fork and serve with the steamed vegetables on the side.",
        "Step 6: Optionally, drizzle with a small amount of olive oil or sprinkle with salt for extra flavor."
      ],
      "recipe_ingredients": [
        "1 cup rice",
        "2 cups water",
        "1-2 cups mixed vegetables (carrots, broccoli, zucchini, green beans)",
        "Olive oil or salt (optional)"
      ],
      "recipe_facts": {
        "Calories": 250,
        "Carbs": 50,
        "Fat": 4,
        "Protein": 6,
        "Fiber": 5,
        "Net Carbs": 45,
        "Sodium": 20,
        "Cholesterol": 0
      },
      "recipe_time": "30 Mins"
    },
    {
      "recipe_name": "Coconut Rice",
      "recipe_image": "https://img.freepik.com/free-photo/front-view-cooked-rice-with-dough-slices-dark-floor-dish-meal-dark-food-photo_140725-81866.jpg?t=st=1733073176~exp=1733076776~hmac=b68239c499591a733bea27f52d603ddcc507c97530dfaaa2cb13398c14d29bd8&w=826",
      "recipe_category": "Easy on Stomach",
      "recipe_description": "Coconut rice is a fragrant, lightly flavored dish made with coconut milk and rice. It’s soothing and gentle on the stomach while offering a mild sweetness and aroma from the coconut, making it a perfect side dish for any meal.",
      "recipe_steps": [
        "Step 1: Rinse 1 cup of rice under cold water until the water runs clear.",
        "Step 2: In a medium saucepan, combine the rice with 1 cup of coconut milk and 1 cup of water. Add a pinch of salt.",
        "Step 3: Bring the mixture to a boil, then cover the pot and reduce the heat to low. Let it simmer for 15-20 Mins, or until the rice is fully cooked and the liquid is absorbed.",
        "Step 4: Once the rice is cooked, fluff it with a fork to separate the grains.",
        "Step 5: Optionally, garnish with toasted coconut flakes or fresh cilantro for added flavor and texture."
      ],
      "recipe_ingredients": [
        "1 cup rice",
        "1 cup coconut milk",
        "1 cup water",
        "Pinch of salt",
        "Optional garnish: toasted coconut flakes or fresh cilantro"
      ],
      "recipe_facts": {
        "Calories": 230,
        "Carbs": 45,
        "Fat": 9,
        "Protein": 3,
        "Fiber": 2,
        "Net Carbs": 43,
        "Sodium": 200,
        "Cholesterol": 0
      },
      "recipe_time": "30 Mins"
    },
    {
      "recipe_name": "Boiled Chicken with Rice",
      "recipe_image": "https://img.freepik.com/premium-photo/hainanese-boiled-chicken-rice-wooden-table_45583-309.jpg?w=826",
      "recipe_category": "Easy on Stomach",
      "recipe_description": "Boiled chicken with rice is a simple, nutritious, and easy-to-digest meal. It’s a comforting combination of tender chicken and soft rice, making it gentle on the stomach, ideal for recovery or light meals.",
      "recipe_steps": [
        "Step 1: In a large pot, add 2 cups of water and 1-2 chicken breasts or thighs. Bring to a boil.",
        "Step 2: Once boiling, lower the heat and simmer for 20-25 Mins or until the chicken is fully cooked and tender.",
        "Step 3: While the chicken is cooking, rinse 1 cup of rice under cold water until the water runs clear.",
        "Step 4: In another pot, add 2 cups of water and bring to a boil. Add the rice and a pinch of salt, then cover and reduce the heat. Let it simmer for about 15-20 Mins, or until the rice is tender and the water is absorbed.",
        "Step 5: Once both the chicken and rice are ready, remove the chicken from the pot and shred or slice it.",
        "Step 6: Serve the boiled chicken on top of the rice. Optionally, drizzle with a little olive oil or sprinkle with salt and pepper for added flavor."
      ],
      "recipe_ingredients": [
        "1-2 chicken breasts or thighs",
        "2 cups water (for boiling chicken)",
        "1 cup rice",
        "2 cups water (for cooking rice)",
        "Pinch of salt",
        "Olive oil or pepper (optional)"
      ],
      "recipe_facts": {
        "Calories": 300,
        "Carbs": 35,
        "Fat": 7,
        "Protein": 25,
        "Fiber": 1,
        "Net Carbs": 34,
        "Sodium": 100,
        "Cholesterol": 70
      },
      "recipe_time": "45 Mins"
    }
  ],
  "salad": [
    {
      "recipe_name": "Caesar Salad",
      "recipe_image": "https://img.freepik.com/premium-photo/caesar-salad-with-grilled-chicken-croutons-parmesan-cheese_128650-2215.jpg?w=826",
      "recipe_category": "Salad",
      "recipe_description": "Caesar Salad is a classic Salad made with crisp romaine lettuce, crunchy croutons, creamy Caesar dressing, and a sprinkle of parmesan cheese. It’s a perfect side dish or light meal.",
      "recipe_steps": [
        "Step 1: In a large Salad bowl, add 6 cups of washed and torn romaine lettuce.",
        "Step 2: Add 1 cup of homemade or store-bought croutons to the lettuce.",
        "Step 3: In a small bowl, whisk together 1/4 cup of Caesar dressing, 2 tablespoons of freshly squeezed lemon juice, 1 teaspoon of Dijon mustard, and 1 minced garlic clove.",
        "Step 4: Drizzle the dressing over the Salad and toss gently to combine, ensuring the lettuce and croutons are evenly coated.",
        "Step 5: Sprinkle 1/4 cup of grated parmesan cheese over the top of the Salad.",
        "Step 6: Optional: Add grilled chicken or bacon bits for a non-Vegetarian version.",
        "Step 7: Serve immediately for the freshest crunch."
      ],
      "recipe_ingredients": [
        "6 cups romaine lettuce, washed and torn",
        "1 cup croutons",
        "1/4 cup Caesar dressing",
        "2 tablespoons freshly squeezed lemon juice",
        "1 teaspoon Dijon mustard",
        "1 garlic clove, minced",
        "1/4 cup grated parmesan cheese",
        "Optional: Grilled chicken or bacon bits"
      ],
      "recipe_facts": {
        "Calories": 200,
        "Carbs": 15,
        "Fat": 15,
        "Protein": 6,
        "Fiber": 2,
        "Net Carbs": 13,
        "Sodium": 450,
        "Cholesterol": 20
      },
      "recipe_time": "15 Mins"
    },
    {
      "recipe_name": "Caprese Salad",
      "recipe_image": "https://img.freepik.com/premium-photo/italian-salad-caprese_167689-514.jpg?w=826",
      "recipe_category": "Salad",
      "recipe_description": "Caprese Salad is a simple, fresh Italian Salad made with ripe tomatoes, creamy mozzarella cheese, fragrant basil, and a drizzle of balsamic glaze or olive oil. It’s perfect as an appetizer or a side dish.",
      "recipe_steps": [
        "Step 1: Slice 2 large ripe tomatoes into thick slices and arrange them on a serving platter.",
        "Step 2: Slice 1 ball of fresh mozzarella cheese into thick slices and arrange them alternately with the tomato slices.",
        "Step 3: Tear fresh basil leaves and sprinkle them over the tomatoes and mozzarella.",
        "Step 4: Drizzle with 2 tablespoons of extra virgin olive oil and 1 tablespoon of balsamic vinegar or balsamic glaze.",
        "Step 5: Season with salt and freshly cracked black pepper to taste.",
        "Step 6: Serve immediately or refrigerate for up to 30 Mins for the flavors to meld."
      ],
      "recipe_ingredients": [
        "2 large ripe tomatoes, sliced",
        "1 ball fresh mozzarella cheese, sliced",
        "1/4 cup fresh basil leaves, torn",
        "2 tablespoons extra virgin olive oil",
        "1 tablespoon balsamic vinegar or balsamic glaze",
        "Salt and freshly cracked black pepper to taste"
      ],
      "recipe_facts": {
        "Calories": 200,
        "Carbs": 10,
        "Fat": 17,
        "Protein": 12,
        "Fiber": 3,
        "Net Carbs": 7,
        "Sodium": 500,
        "Cholesterol": 40
      },
      "recipe_time": "10 Mins"
    },
    {
      "recipe_name": "Greek Salad",
      "recipe_image": "https://img.freepik.com/free-photo/front-view-vegetable-salad-with-mayyonaise-olives-dark-blue-surface-meal-color-holiday-health-dish-photo-dinner_179666-19645.jpg?t=st=1733074004~exp=1733077604~hmac=7bdcd47f40e3c68f1bbc1529079613f5adc7c465e7b6effac82dae9144a0f724&w=826",
      "recipe_category": "Salad",
      "recipe_description": "Greek Salad is a vibrant, fresh dish made with crisp cucumbers, juicy tomatoes, red onions, Kalamata olives, and feta cheese, all dressed in a light olive oil and lemon dressing. It's a refreshing and Healthy option.",
      "recipe_steps": [
        "Step 1: In a large bowl, combine 2 cups of chopped cucumbers, 1 cup of chopped tomatoes, 1/2 cup of sliced red onions, and 1/4 cup of Kalamata olives.",
        "Step 2: Add 1/2 cup of cubed feta cheese to the Salad mixture.",
        "Step 3: In a small bowl, whisk together 3 tablespoons of extra virgin olive oil, 1 tablespoon of freshly squeezed lemon juice, 1/2 teaspoon of dried oregano, and salt and pepper to taste.",
        "Step 4: Pour the dressing over the Salad and toss gently to combine.",
        "Step 5: Garnish with additional oregano or fresh parsley, if desired.",
        "Step 6: Serve immediately or refrigerate for 15-20 Mins to let the flavors marinate."
      ],
      "recipe_ingredients": [
        "2 cups cucumbers, chopped",
        "1 cup tomatoes, chopped",
        "1/2 cup red onion, sliced",
        "1/4 cup Kalamata olives",
        "1/2 cup feta cheese, cubed",
        "3 tablespoons extra virgin olive oil",
        "1 tablespoon freshly squeezed lemon juice",
        "1/2 teaspoon dried oregano",
        "Salt and pepper to taste",
        "Fresh oregano or parsley for garnish (optional)"
      ],
      "recipe_facts": {
        "Calories": 180,
        "Carbs": 10,
        "Fat": 15,
        "Protein": 5,
        "Fiber": 3,
        "Net Carbs": 7,
        "Sodium": 350,
        "Cholesterol": 15
      },
      "recipe_time": "15 Mins"
    },
    {
      "recipe_name": "Quinoa Salad",
      "recipe_image": "https://img.freepik.com/free-photo/side-view-quinoa-salad-with-tomato-cucumber-basil-salt-pepper-table_141793-3676.jpg?t=st=1733074046~exp=1733077646~hmac=5d2f4380f3dec94681a7b56c65677121c8e46c49fb0ce494fdb39ca310f6c8c8&w=826",
      "recipe_category": "Salad",
      "recipe_description": "Quinoa Salad is a nutritious and colorful Salad made with protein-packed quinoa, fresh vegetables, and a light lemon vinaigrette dressing. It's a Healthy, filling dish perfect for a light meal or as a side dish.",
      "recipe_steps": [
        "Step 1: Cook 1 cup of quinoa according to package instructions, then let it cool.",
        "Step 2: In a large bowl, combine the cooled quinoa with 1 cup of diced cucumber, 1/2 cup of diced bell peppers, and 1/2 cup of cherry tomatoes, halved.",
        "Step 3: Add 1/4 cup of finely chopped red onion, 1/4 cup of chopped fresh parsley, and 1/4 cup of crumbled feta cheese.",
        "Step 4: In a small bowl, whisk together 3 tablespoons of olive oil, 1 tablespoon of freshly squeezed lemon juice, 1 teaspoon of honey or maple syrup, 1/2 teaspoon of cumin, and salt and pepper to taste.",
        "Step 5: Pour the dressing over the Salad and toss to combine, ensuring everything is well coated.",
        "Step 6: Chill for 15-20 Mins before serving, or serve immediately for the freshest taste."
      ],
      "recipe_ingredients": [
        "1 cup quinoa, cooked and cooled",
        "1 cup cucumber, diced",
        "1/2 cup bell peppers, diced",
        "1/2 cup cherry tomatoes, halved",
        "1/4 cup red onion, finely chopped",
        "1/4 cup fresh parsley, chopped",
        "1/4 cup feta cheese, crumbled",
        "3 tablespoons olive oil",
        "1 tablespoon freshly squeezed lemon juice",
        "1 teaspoon honey or maple syrup",
        "1/2 teaspoon cumin",
        "Salt and pepper to taste"
      ],
      "recipe_facts": {
        "Calories": 220,
        "Carbs": 28,
        "Fat": 12,
        "Protein": 6,
        "Fiber": 5,
        "Net Carbs": 23,
        "Sodium": 300,
        "Cholesterol": 15
      },
      "recipe_time": "25 Mins"
    },
    {
      "recipe_name": "Tabbouleh",
      "recipe_image": "https://img.freepik.com/free-photo/tabbouleh-salad-with-couscous-raisins-cranberries-mint_1142-50653.jpg?t=st=1733081563~exp=1733085163~hmac=627bdcf35c2b5dacda630d25c1ce0711db8c86526675e6d965f29b884803cd64&w=740",
      "recipe_category": "Salad",
      "recipe_description": "Tabbouleh is a refreshing Middle Eastern Salad made with bulgur, parsley, mint, tomatoes, and onions, dressed in a lemon and olive oil vinaigrette. It’s a light, Healthy dish packed with fresh flavors.",
      "recipe_steps": [
        "Step 1: Soak 1/2 cup of fine bulgur wheat in 1/2 cup of hot water for about 10-15 Mins until soft, then drain and set aside.",
        "Step 2: Finely chop 1 cup of fresh parsley, 1/4 cup of fresh mint leaves, and 1/2 cup of tomatoes, and add them to a large bowl.",
        "Step 3: Finely chop 1/4 cup of red onion and add it to the bowl.",
        "Step 4: Add the soaked and drained bulgur wheat to the bowl and mix well.",
        "Step 5: In a small bowl, whisk together 3 tablespoons of olive oil, 2 tablespoons of freshly squeezed lemon juice, salt, and pepper to taste.",
        "Step 6: Pour the dressing over the Salad and toss gently to combine.",
        "Step 7: Chill for at least 15 Mins before serving to allow the flavors to meld."
      ],
      "recipe_ingredients": [
        "1/2 cup fine bulgur wheat",
        "1 cup fresh parsley, finely chopped",
        "1/4 cup fresh mint leaves, finely chopped",
        "1/2 cup tomatoes, diced",
        "1/4 cup red onion, finely chopped",
        "3 tablespoons olive oil",
        "2 tablespoons freshly squeezed lemon juice",
        "Salt and pepper to taste"
      ],
      "recipe_facts": {
        "Calories": 120,
        "Carbs": 20,
        "Fat": 7,
        "Protein": 3,
        "Fiber": 4,
        "Net Carbs": 16,
        "Sodium": 150,
        "Cholesterol": 0
      },
      "recipe_time": "30 Mins"
    },
    {
      "recipe_name": "Spinach & Strawberry Salad",
      "recipe_image": "https://img.freepik.com/free-photo/tomato-mozzarella-salad-with-pesto-sauce-parsley_141793-2283.jpg?t=st=1733081657~exp=1733085257~hmac=c014810d6848b540736b09c533a9a0ab553e88c0ead98a526e7ca49ab000128b&w=826",
      "recipe_category": "Salad",
      "recipe_description": "A fresh and vibrant Salad made with tender spinach leaves, sweet strawberries, and a light vinaigrette. It’s a perfect balance of sweetness and savory flavors, ideal for a Healthy and refreshing dish.",
      "recipe_steps": [
        "Step 1: In a large bowl, combine 4 cups of fresh spinach leaves and 1 cup of sliced strawberries.",
        "Step 2: Add 1/4 cup of red onion, thinly sliced, and 1/4 cup of crumbled feta cheese.",
        "Step 3: In a small bowl, whisk together 2 tablespoons of olive oil, 1 tablespoon of balsamic vinegar, 1 teaspoon of honey or maple syrup, salt, and freshly cracked black pepper to taste.",
        "Step 4: Drizzle the dressing over the Salad and toss gently to combine.",
        "Step 5: Serve immediately or chill for 10-15 Mins for a cool, refreshing experience."
      ],
      "recipe_ingredients": [
        "4 cups fresh spinach leaves",
        "1 cup strawberries, sliced",
        "1/4 cup red onion, thinly sliced",
        "1/4 cup feta cheese, crumbled",
        "2 tablespoons olive oil",
        "1 tablespoon balsamic vinegar",
        "1 teaspoon honey or maple syrup",
        "Salt and freshly cracked black pepper to taste"
      ],
      "recipe_facts": {
        "Calories": 150,
        "Carbs": 12,
        "Fat": 11,
        "Protein": 3,
        "Fiber": 4,
        "Net Carbs": 8,
        "Sodium": 220,
        "Cholesterol": 20
      },
      "recipe_time": "15 Mins"
    },
    {
      "recipe_name": "Fruit Salad",
      "recipe_image": "https://img.freepik.com/premium-photo/salad-with-various-fresh-fruits-white-plate_163828-284.jpg?w=826",
      "recipe_category": "Salad",
      "recipe_description": "A refreshing and colorful mix of seasonal fruits, tossed together in a light and sweet dressing. This fruit Salad is perfect for a Healthy snack, side dish, or dessert.",
      "recipe_steps": [
        "Step 1: In a large bowl, combine 1 cup of diced pineapple, 1 cup of diced watermelon, 1/2 cup of sliced strawberries, and 1/2 cup of grapes, halved.",
        "Step 2: Add 1/2 cup of diced mango, 1/2 cup of diced kiwi, and 1/4 cup of pomegranate seeds for added color and crunch.",
        "Step 3: In a small bowl, whisk together 1 tablespoon of honey or maple syrup and 1 tablespoon of freshly squeezed lime juice.",
        "Step 4: Pour the dressing over the fruit and toss gently to combine, ensuring the fruit is evenly coated.",
        "Step 5: Serve immediately or chill for 15-20 Mins for a cooler, refreshing treat."
      ],
      "recipe_ingredients": [
        "1 cup diced pineapple",
        "1 cup diced watermelon",
        "1/2 cup sliced strawberries",
        "1/2 cup grapes, halved",
        "1/2 cup diced mango",
        "1/2 cup diced kiwi",
        "1/4 cup pomegranate seeds",
        "1 tablespoon honey or maple syrup",
        "1 tablespoon freshly squeezed lime juice"
      ],
      "recipe_facts": {
        "Calories": 120,
        "Carbs": 31,
        "Fat": 1,
        "Protein": 2,
        "Fiber": 5,
        "Net Carbs": 26,
        "Sodium": 10,
        "Cholesterol": 0
      },
      "recipe_time": "15 Mins"
    },
    {
      "recipe_name": "Grilled Vegetable Salad",
      "recipe_image": "https://img.freepik.com/premium-photo/vegetable-salad-with-lettuce-tomatoes-grilled-eggplants-kitchen-table_215990-1195.jpg?w=826",
      "recipe_category": "Salad",
      "recipe_description": "A hearty and smoky Salad featuring a mix of grilled vegetables like bell peppers, zucchini, and eggplant, topped with a tangy dressing. It's a perfect side dish for any meal or a light, Healthy fullmeal.",
      "recipe_steps": [
        "Step 1: Preheat the grill or grill pan to medium-high heat.",
        "Step 2: Slice 1 bell pepper, 1 zucchini, 1 eggplant, and 1 red onion into thick slices.",
        "Step 3: Toss the vegetables with 2 tablespoons of olive oil, salt, pepper, and your favorite herbs (e.g., thyme, rosemary).",
        "Step 4: Grill the vegetables for 4-5 Mins per side, or until tender and slightly charred.",
        "Step 5: Remove from the grill and let the vegetables cool slightly before chopping them into bite-sized pieces.",
        "Step 6: In a large bowl, combine the grilled vegetables with 1 cup of mixed greens (e.g., spinach, arugula).",
        "Step 7: In a small bowl, whisk together 2 tablespoons of olive oil, 1 tablespoon of balsamic vinegar, 1 teaspoon of Dijon mustard, salt, and pepper.",
        "Step 8: Drizzle the dressing over the Salad and toss gently to combine.",
        "Step 9: Serve immediately or chill for 10-15 Mins before serving."
      ],
      "recipe_ingredients": [
        "1 bell pepper, sliced",
        "1 zucchini, sliced",
        "1 eggplant, sliced",
        "1 red onion, sliced",
        "2 tablespoons olive oil (for grilling)",
        "Salt and pepper to taste",
        "1 cup mixed greens (e.g., spinach, arugula)",
        "2 tablespoons olive oil (for dressing)",
        "1 tablespoon balsamic vinegar",
        "1 teaspoon Dijon mustard"
      ],
      "recipe_facts": {
        "Calories": 160,
        "Carbs": 20,
        "Fat": 12,
        "Protein": 2,
        "Fiber": 7,
        "Net Carbs": 13,
        "Sodium": 220,
        "Cholesterol": 0
      },
      "recipe_time": "30 Mins"
    },
    {
      "recipe_name": "Panzanella",
      "recipe_image": "https://img.freepik.com/premium-photo/panzanella-italy-traditional-background-professional-advertising-food-photo-ai-generated_755721-60652.jpg?w=826",
      "recipe_category": "Salad",
      "recipe_description": "An Italian bread Salad made with fresh tomatoes, cucumbers, red onion, and chunks of crusty bread soaked in a simple vinaigrette. This dish is light, refreshing, and perfect for using up day-old bread.",
      "recipe_steps": [
        "Step 1: Cut 4 cups of day-old crusty bread into large cubes and toast them lightly in a pan with 2 tablespoons of olive oil until golden brown and crispy.",
        "Step 2: In a large bowl, combine 3 cups of chopped ripe tomatoes, 1 cucumber (diced), and 1/2 red onion (thinly sliced).",
        "Step 3: Add the toasted bread cubes to the bowl with the vegetables.",
        "Step 4: In a small bowl, whisk together 3 tablespoons of olive oil, 1 tablespoon of red wine vinegar, 1 teaspoon of Dijon mustard, salt, and freshly cracked black pepper to taste.",
        "Step 5: Pour the dressing over the bread and vegetable mixture and toss gently to coat the bread with the vinaigrette.",
        "Step 6: Let the Salad sit for 15-20 Mins to allow the bread to absorb the flavors of the dressing.",
        "Step 7: Garnish with fresh basil leaves and serve immediately or refrigerate for a cool, refreshing option."
      ],
      "recipe_ingredients": [
        "4 cups day-old crusty bread, cut into cubes",
        "3 cups ripe tomatoes, chopped",
        "1 cucumber, diced",
        "1/2 red onion, thinly sliced",
        "3 tablespoons olive oil (for dressing)",
        "1 tablespoon red wine vinegar",
        "1 teaspoon Dijon mustard",
        "Salt and freshly cracked black pepper to taste",
        "Fresh basil leaves for garnish"
      ],
      "recipe_facts": {
        "Calories": 210,
        "Carbs": 29,
        "Fat": 11,
        "Protein": 4,
        "Fiber": 5,
        "Net Carbs": 24,
        "Sodium": 250,
        "Cholesterol": 0
      },
      "recipe_time": "30 Mins"
    }
  ],
  "seafood": [
    {
      "recipe_name": "Prawn Masala",
      "recipe_image": "https://img.freepik.com/free-photo/close-up-delicious-asian-food_23-2150535861.jpg?t=st=1733082045~exp=1733085645~hmac=a353ea741891225ebb32abff5dffec130061af49cbb9d927d5fd2bc7dad877b2&w=826",
      "recipe_category": "Seafood",
      "recipe_description": "A rich and flavorful Indian dish made with prawns cooked in a spicy and aromatic tomato-based masala sauce. Perfect for pairing with rice or naan.",
      "recipe_steps": [
        "Step 1: Heat 2 tablespoons of oil in a large pan over medium heat. Add 1 finely chopped onion and sauté until golden brown.",
        "Step 2: Add 2 cloves of garlic (minced) and 1-inch piece of ginger (minced), and cook for another minute until fragrant.",
        "Step 3: Add 2 chopped tomatoes, 1 teaspoon of turmeric powder, 1 teaspoon of red chili powder, 1 teaspoon of garam masala, and salt to taste. Cook until the tomatoes break down and form a thick paste.",
        "Step 4: Add 500g of prawns (peeled and deveined) and cook for 5-6 Mins until the prawns turn pink and are cooked through.",
        "Step 5: Add 1/2 cup of water and stir to combine. Let it simmer for 5 Mins, allowing the flavors to meld.",
        "Step 6: Stir in 1 tablespoon of fresh cilantro (chopped) and a squeeze of lime juice for a burst of freshness.",
        "Step 7: Serve hot with steamed rice or naan."
      ],
      "recipe_ingredients": [
        "2 tablespoons oil",
        "1 onion, finely chopped",
        "2 cloves garlic, minced",
        "1-inch piece ginger, minced",
        "2 tomatoes, chopped",
        "1 teaspoon turmeric powder",
        "1 teaspoon red chili powder",
        "1 teaspoon garam masala",
        "500g prawns, peeled and deveined",
        "1/2 cup water",
        "Salt to taste",
        "1 tablespoon fresh cilantro, chopped",
        "Lime wedges"
      ],
      "recipe_facts": {
        "Calories": 280,
        "Carbs": 10,
        "Fat": 15,
        "Protein": 30,
        "Fiber": 2,
        "Net Carbs": 8,
        "Sodium": 800,
        "Cholesterol": 220
      },
      "recipe_time": "30 Mins"
    },
    {
      "recipe_name": "Tandoori Fish",
      "recipe_image": "https://img.freepik.com/premium-photo/spicy-delicious-crab-roast-wooden-table-stir-fried-crab-with-curry-powder-with-onion_191567-1443.jpg?w=826",
      "recipe_category": "Seafood",
      "recipe_description": "A flavorful and aromatic fish dish marinated in a blend of yogurt, spices, and herbs, then grilled to perfection. Tandoori Fish is a Healthy and delicious option for Seafood lovers.",
      "recipe_steps": [
        "Step 1: In a bowl, combine 1/2 cup of plain yogurt, 1 tablespoon lemon juice, 1 teaspoon ginger-garlic paste, 1 teaspoon red chili powder, 1 teaspoon garam masala, 1 teaspoon turmeric powder, and salt to taste. Mix well to form a smooth marinade.",
        "Step 2: Add 500g of fish fillets (such as tilapia or cod) to the marinade, ensuring the fish is well-coated. Cover the bowl and refrigerate for at least 30 Mins (or up to 2 Hrs) to let the flavors infuse.",
        "Step 3: Preheat the grill or oven to 400°F (200°C). If using an oven, line a baking sheet with parchment paper.",
        "Step 4: Place the marinated fish on the grill or baking sheet. Grill for 10-12 Mins, flipping halfway through, until the fish is cooked through and slightly charred on the edges.",
        "Step 5: Garnish with fresh cilantro and a squeeze of lemon juice before serving.",
        "Step 6: Serve hot with naan or steamed rice."
      ],
      "recipe_ingredients": [
        "1/2 cup plain yogurt",
        "1 tablespoon lemon juice",
        "1 teaspoon ginger-garlic paste",
        "1 teaspoon red chili powder",
        "1 teaspoon garam masala",
        "1 teaspoon turmeric powder",
        "Salt to taste",
        "500g fish fillets (tilapia, cod, or any firm fish)",
        "Fresh cilantro for garnish",
        "Lemon wedges for garnish"
      ],
      "recipe_facts": {
        "Calories": 220,
        "Carbs": 5,
        "Fat": 10,
        "Protein": 30,
        "Fiber": 1,
        "Net Carbs": 4,
        "Sodium": 700,
        "Cholesterol": 80
      },
      "recipe_time": "45 Mins"
    },
    {
      "recipe_name": "Fried Shrimp",
      "recipe_image": "https://img.freepik.com/premium-photo/shrimp-fritters-prawn-bajji-jheenga-pakodaa-a-a-a-a-a-a-a-kolambi-zinga-pakora-indian-snack-food_466689-71481.jpg?w=826",
      "recipe_category": "Seafood",
      "recipe_description": "Crispy, golden-brown shrimp coated in a flavorful seasoned batter and fried to perfection. Perfect as an appetizer or served with a dipping sauce.",
      "recipe_steps": [
        "Step 1: In a bowl, whisk together 1 cup of all-purpose flour, 1/2 teaspoon paprika, 1/2 teaspoon garlic powder, 1/2 teaspoon onion powder, 1/2 teaspoon salt, and 1/4 teaspoon black pepper.",
        "Step 2: In a separate bowl, beat 1 egg and add 1/4 cup of milk. Mix well.",
        "Step 3: Dip 500g of peeled and deveined shrimp into the egg mixture, then dredge them in the seasoned flour mixture, making sure they are fully coated.",
        "Step 4: Heat 2 cups of vegetable oil in a deep frying pan over medium-high heat. Once the oil is hot, fry the shrimp in batches for 2-3 Mins, or until golden brown and crispy.",
        "Step 5: Remove the shrimp from the oil and place them on a paper towel-lined plate to drain excess oil.",
        "Step 6: Serve the fried shrimp with your favorite dipping sauce, such as cocktail sauce or tartar sauce."
      ],
      "recipe_ingredients": [
        "1 cup all-purpose flour",
        "1/2 teaspoon paprika",
        "1/2 teaspoon garlic powder",
        "1/2 teaspoon onion powder",
        "1/2 teaspoon salt",
        "1/4 teaspoon black pepper",
        "1 egg",
        "1/4 cup milk",
        "500g shrimp, peeled and deveined",
        "2 cups vegetable oil (for frying)"
      ],
      "recipe_facts": {
        "Calories": 300,
        "Carbs": 25,
        "Fat": 15,
        "Protein": 20,
        "Fiber": 1,
        "Net Carbs": 24,
        "Sodium": 600,
        "Cholesterol": 180
      },
      "recipe_time": "25 Mins"
    },
    {
      "recipe_name": "Grilled Octopus",
      "recipe_image": "https://img.freepik.com/free-photo/side-view-roasted-chicken-with-grilled-tomato-fresh-herbs-sauce-plate-wood_141793-11158.jpg?t=st=1733082354~exp=1733085954~hmac=863cac53b76ade91870a616ed90ecdf5d63f2f0d5cb8674ceb4dbda7ebf585d4&w=740",
      "recipe_category": "Seafood",
      "recipe_description": "Grilled Octopus is a delicious and tender Seafood dish marinated in olive oil, garlic, and herbs, then grilled to perfection. It’s smoky, flavorful, and perfect for Seafood lovers.",
      "recipe_steps": [
        "Step 1: In a large bowl, combine 1/4 cup olive oil, 2 cloves garlic (minced), 1 tablespoon lemon juice, 1 teaspoon paprika, 1 teaspoon dried oregano, salt, and pepper to taste.",
        "Step 2: Add the octopus (about 1 kg) to the marinade and toss to coat evenly. Let it marinate for at least 1 Hr or up to 4 Hrs in the refrigerator.",
        "Step 3: Preheat the grill to medium-high heat.",
        "Step 4: Grill the octopus for about 3-4 Mins per side, or until it develops a nice char and is cooked through. Ensure that the octopus is tender, and the edges are crispy.",
        "Step 5: Remove the octopus from the grill and let it rest for a few Mins before slicing into pieces.",
        "Step 6: Serve with fresh lemon wedges and a drizzle of olive oil."
      ],
      "recipe_ingredients": [
        "1 kg octopus (whole or tentacles)",
        "1/4 cup olive oil",
        "2 cloves garlic, minced",
        "1 tablespoon lemon juice",
        "1 teaspoon paprika",
        "1 teaspoon dried oregano",
        "Salt and pepper to taste",
        "Lemon wedges for garnish"
      ],
      "recipe_facts": {
        "Calories": 220,
        "Carbs": 5,
        "Fat": 15,
        "Protein": 20,
        "Fiber": 1,
        "Net Carbs": 4,
        "Sodium": 300,
        "Cholesterol": 70
      },
      "recipe_time": "1 Hr 30 Mins"
    },
    {
      "recipe_name": "Lobster Thermidor",
      "recipe_image": "https://img.freepik.com/premium-photo/grilled-lobster-steak_1339-102671.jpg?w=826",
      "recipe_category": "Seafood",
      "recipe_description": "Lobster Thermidor is a classic French dish featuring a rich and creamy lobster meat sauce, topped with a golden brown crust. It’s a decadent and elegant dish perfect for special occasions.",
      "recipe_steps": [
        "Step 1: Cook the lobster: Bring a large pot of salted water to a boil. Add the live lobster and cook for 10-12 Mins, or until the shell turns bright red. Remove the lobster from the pot and let it cool.",
        "Step 2: Remove the lobster meat: Once cooled, crack the lobster shell and remove the meat from the tail and claws. Cut the meat into bite-sized pieces.",
        "Step 3: Prepare the sauce: In a saucepan, melt 2 tablespoons of butter. Add 2 tablespoons of flour and cook for 1 minute, stirring constantly. Gradually whisk in 1 cup of heavy cream, 1/2 cup of white wine, and 1/4 cup of lobster stock. Bring the sauce to a simmer and cook until thickened, stirring occasionally.",
        "Step 4: Add the lobster meat: Stir in the lobster meat to the sauce and season with salt, pepper, and a pinch of nutmeg. Remove the sauce from the heat.",
        "Step 5: Assemble the dish: Divide the lobster mixture among 4 ramekins. Top each ramekin with a generous amount of grated Gruyère cheese.",
        "Step 6: Broil the dish: Broil the ramekins under a preheated broiler for 2-3 Mins, or until the cheese is golden brown and bubbly.",
        "Step 7: Serve immediately: Serve the Lobster Thermidor hot, garnished with fresh parsley."
      ],
      "recipe_ingredients": [
        "1 live lobster (1.5-2 lbs)",
        "2 tablespoons unsalted butter",
        "2 tablespoons all-purpose flour",
        "1 cup heavy cream",
        "1/2 cup white wine",
        "1/4 cup lobster stock",
        "Salt and pepper to taste",
        "Pinch of nutmeg",
        "1/2 cup grated Gruyère cheese",
        "Fresh parsley for garnish"
      ],
      "recipe_facts": {
        "Calories": 400,
        "Carbs": 10,
        "Fat": 30,
        "Protein": 30,
        "Fiber": 0,
        "Net Carbs": 10,
        "Sodium": 400,
        "Cholesterol": 150
      },
      "recipe_time": "1 Hr 30 Mins"
    },
    {
      "recipe_name": "Grilled Oysters",
      "recipe_image": "https://img.freepik.com/free-photo/close-up-delicious-mussels-plate_23-2148375684.jpg?t=st=1733082466~exp=1733086066~hmac=6238efb7118d92b0fdde0f32ec710870cececf5ae7cfa8862a9e243da8d04220&w=826",
      "recipe_category": "Seafood",
      "recipe_description": "Grilled Oysters are a simple yet elegant appetizer. Fresh oysters are topped with a flavorful topping and grilled to perfection, creating a smoky and delicious treat.",
      "recipe_steps": [
        "Step 1: Preheat the grill to medium-high heat.",
        "Step 2: Shuck the oysters, reserving the liquid. Discard any oysters that are open or damaged.",
        "Step 3: Prepare the topping: In a small bowl, combine 1 tablespoon butter, 1 clove garlic (minced), 1/4 cup breadcrumbs, 1 tablespoon chopped parsley, and a pinch of salt and pepper.",
        "Step 4: Top the oysters: Place the oysters on a baking sheet or grill pan. Top each oyster with a spoonful of the prepared topping.",
        "Step 5: Grill the oysters: Place the oysters on the preheated grill and cook for 4-5 Mins, or until the oysters are plump and the topping is golden brown and bubbly.",
        "Step 6: Serve immediately: Serve the grilled oysters hot with lemon wedges."
      ],
      "recipe_ingredients": [
        "1 dozen fresh oysters, shucked",
        "1 tablespoon unsalted butter",
        "1 clove garlic, minced",
        "1/4 cup breadcrumbs",
        "1 tablespoon chopped parsley",
        "Salt and pepper to taste",
        "Lemon wedges for serving"
      ],
      "recipe_facts": {
        "Calories": 100,
        "Carbs": 5,
        "Fat": 5,
        "Protein": 10,
        "Fiber": 0,
        "Net Carbs": 5,
        "Sodium": 200,
        "Cholesterol": 30
      },
      "recipe_time": "20 Mins"
    },
    {
      "recipe_name": "Seared Tuna Steaks",
      "recipe_image": "https://img.freepik.com/premium-photo/grilled-tuna-steak_1472-13622.jpg?w=826",
      "recipe_category": "Seafood",
      "recipe_description": "Seared Tuna Steaks is a quick and easy dish that showcases the natural flavor of tuna. The steaks are seared to perfection and topped with sesame seeds for a nutty crunch.",
      "recipe_steps": [
        "Step 1: Prepare the tuna: Cut the tuna into 1-inch thick steaks. Season both sides with salt and pepper.",
        "Step 2: Heat the pan: Heat a cast-iron skillet or heavy-bottomed pan over high heat. Add a drizzle of olive oil to coat the pan.",
        "Step 3: Sear the tuna: Place the tuna steaks in the hot pan and sear for 1-2 Mins per side, or until desired level of doneness is reached. For medium-rare, the center should be slightly pink.",
        "Step 4: Add sesame seeds: Sprinkle sesame seeds over the seared tuna steaks.",
        "Step 5: Rest and serve: Remove the tuna steaks from the pan and let them rest for a few Mins before serving. Serve with your favorite dipping sauce, such as soy sauce, wasabi, or ponzu sauce."
      ],
      "recipe_ingredients": [
        "2 tuna steaks (1-inch thick)",
        "Salt and pepper to taste",
        "Olive oil",
        "Sesame seeds"
      ],
      "recipe_facts": {
        "Calories": 200,
        "Carbs": 0,
        "Fat": 15,
        "Protein": 30,
        "Fiber": 0,
        "Net Carbs": 0,
        "Sodium": 150,
        "Cholesterol": 50
      },
      "recipe_time": "15 Mins"
    },
    {
      "recipe_name": "Grilled Salmon",
      "recipe_image": "https://img.freepik.com/premium-photo/fish-trout-chum-salmon-humpback-piece-baked-grilled-with-slice-lemon-lettuce_159285-517.jpg?w=826",
      "recipe_category": "Seafood",
      "recipe_description": "Grilled Salmon with Lemon-Dill Sauce is a classic dish that's easy to make and packed with flavor. The salmon is grilled to perfection and topped with a tangy and herbaceous lemon-dill sauce.",
      "recipe_steps": [
        "Step 1: Prepare the salmon: Rinse the salmon fillets and pat them dry with paper towels. Season both sides with salt and pepper.",
        "Step 2: Grill the salmon: Preheat the grill to medium-high heat. Place the salmon fillets skin-side down on the grill and cook for 4-5 Mins per side, or until the fish flakes easily with a fork.",
        "Step 3: Make the lemon-dill sauce: In a small bowl, whisk together 1/4 cup fresh lemon juice, 1/4 cup olive oil, 2 tablespoons chopped fresh dill, 1 teaspoon Dijon mustard, and a pinch of salt and pepper.",
        "Step 4: Serve: Drizzle the lemon-dill sauce over the grilled salmon and serve immediately."
      ],
      "recipe_ingredients": [
        "2 salmon fillets",
        "Salt and pepper to taste",
        "1/4 cup fresh lemon juice",
        "1/4 cup olive oil",
        "2 tablespoons chopped fresh dill",
        "1 teaspoon Dijon mustard",
        "Salt and pepper to taste"
      ],
      "recipe_facts": {
        "Calories": 250,
        "Carbs": 0,
        "Fat": 15,
        "Protein": 30,
        "Fiber": 0,
        "Net Carbs": 0,
        "Sodium": 200,
        "Cholesterol": 60
      },
      "recipe_time": "20 Mins"
    },
    {
      "recipe_name": "Grilled Swordfish",
      "recipe_image": "https://img.freepik.com/free-photo/fish-salad-with-lime-chili-lemongrass-onions-red-onions-parsley-kaffir-lime-leaves-plate_1150-27122.jpg?t=st=1733082641~exp=1733086241~hmac=98df3512c55c44c46c02b66ef62de59ada689edb40b1d121bc067a22e5208dc5&w=826",
      "recipe_category": "Seafood",
      "recipe_description": "Grilled Swordfish Steaks with Chimichurri Sauce is a flavor-packed dish that's perfect for a summer meal. The swordfish is grilled to perfection and topped with a vibrant and zesty chimichurri sauce.",
      "recipe_steps": [
        "Step 1: Prepare the swordfish: Rinse the swordfish steaks and pat them dry with paper towels. Season both sides with salt and pepper.",
        "Step 2: Grill the swordfish: Preheat the grill to medium-high heat. Place the swordfish steaks on the grill and cook for 4-5 Mins per side, or until the fish flakes easily with a fork.",
        "Step 3: Make the chimichurri sauce: In a food processor or blender, combine 1/2 cup fresh parsley, 1/4 cup fresh cilantro, 2 cloves garlic, 2 tablespoons red wine vinegar, 1/4 cup olive oil, 1 teaspoon red pepper flakes, and a pinch of salt and pepper. Pulse until the sauce is finely chopped.",
        "Step 4: Serve: Drizzle the chimichurri sauce over the grilled swordfish and serve immediately."
      ],
      "recipe_ingredients": [
        "2 swordfish steaks",
        "Salt and pepper to taste",
        "1/2 cup fresh parsley",
        "1/4 cup fresh cilantro",
        "2 cloves garlic",
        "2 tablespoons red wine vinegar",
        "1/4 cup olive oil",
        "1 teaspoon red pepper flakes",
        "Salt and pepper to taste"
      ],
      "recipe_facts": {
        "Calories": 250,
        "Carbs": 5,
        "Fat": 15,
        "Protein": 30,
        "Fiber": 1,
        "Net Carbs": 4,
        "Sodium": 200,
        "Cholesterol": 60
      },
      "recipe_time": "20 Mins"
    },
    {
      "recipe_name": "Crab Cakes",
      "recipe_image": "https://img.freepik.com/premium-photo/crispy-crab-cakes-with-tartar-sauce-lemon-wedge-recipe_1326450-9429.jpg?w=900",
      "recipe_category": "Seafood",
      "recipe_description": "Crab cakes are a classic Seafood dish featuring lump crab meat mixed with a flavorful binder and then pan-fried or baked to golden perfection.",
      "recipe_steps": [
        "Step 1: Prepare the crab mixture: In a large bowl, combine 1 pound lump crab meat, 1/2 cup mayonnaise, 1/4 cup Dijon mustard, 1/4 cup finely chopped onion, 1/4 cup finely chopped celery, 1 egg, 1/4 cup breadcrumbs, 1 teaspoon Old Bay seasoning, and a pinch of salt and pepper. Mix gently until combined.",
        "Step 2: Form the crab cakes: Divide the crab mixture into 8 equal portions. Shape each portion into a patty about 1-inch thick.",
        "Step 3: Cook the crab cakes: Heat a large skillet over medium-high heat. Add enough oil to coat the pan. Place the crab cakes in the pan and cook for 3-4 Mins per side, or until golden brown and crispy.",
        "Step 4: Serve: Serve the crab cakes hot with your favorite dipping sauce, such as tartar sauce or remoulade sauce."
      ],
      "recipe_ingredients": [
        "1 pound lump crab meat",
        "1/2 cup mayonnaise",
        "1/4 cup Dijon mustard",
        "1/4 cup finely chopped onion",
        "1/4 cup finely chopped celery",
        "1 egg",
        "1/4 cup breadcrumbs",
        "1 teaspoon Old Bay seasoning",
        "Salt and pepper to taste",
        "Oil for frying"
      ],
      "recipe_facts": {
        "Calories": 200,
        "Carbs": 10,
        "Fat": 10,
        "Protein": 20,
        "Fiber": 1,
        "Net Carbs": 9,
        "Sodium": 300,
        "Cholesterol": 100
      },
      "recipe_time": "30 Mins"
    }
  ],
  "healthy": [
    {
      "recipe_name": "Chicken and Rice Soup",
      "recipe_image": "https://img.freepik.com/free-photo/barley-soup-with-carrots-tomato-celery-meat-dark-surface_2829-5607.jpg?t=st=1733082812~exp=1733086412~hmac=7faf670d5d3f36d09fa7c6b404797259a03e891bd70a6b68d224e3e64208f6b7&w=740",
      "recipe_category": "Healthy",
      "recipe_description": "Chicken and rice soup is a warm, comforting dish made with tender chicken, soft rice, and a flavorful broth. It’s easy to digest and perfect for soothing the stomach while providing nourishment.",
      "recipe_steps": [
        "Step 1: In a large pot, heat 1 tablespoon of olive oil over medium heat. Add 1 chopped onion and sauté for 3-4 Mins until softened.",
        "Step 2: Add 2 minced garlic cloves and sauté for another 30 seconds until fragrant.",
        "Step 3: Add 1-2 chicken breasts or thighs, 6 cups of chicken broth, and a pinch of salt and pepper. Bring to a boil, then reduce to a simmer.",
        "Step 4: Let the chicken cook for about 20-25 Mins, or until fully cooked.",
        "Step 5: While the chicken is cooking, rinse 1/2 cup of rice under cold water until the water runs clear.",
        "Step 6: After the chicken is cooked, remove it from the pot, shred or slice it, and return it to the pot.",
        "Step 7: Add the rice to the soup and continue to simmer for another 15-20 Mins, or until the rice is tender.",
        "Step 8: Taste the soup and adjust the seasoning with more salt, pepper, or a splash of lemon juice if desired."
      ],
      "recipe_ingredients": [
        "1-2 chicken breasts or thighs",
        "6 cups chicken broth",
        "1 tablespoon olive oil",
        "1 onion, chopped",
        "2 cloves garlic, minced",
        "1/2 cup rice",
        "Pinch of salt and pepper",
        "Optional: splash of lemon juice"
      ],
      "recipe_facts": {
        "Calories": 250,
        "Carbs": 30,
        "Fat": 7,
        "Protein": 20,
        "Fiber": 2,
        "Net Carbs": 28,
        "Sodium": 500,
        "Cholesterol": 60
      },
      "recipe_time": "45 Mins"
    },
    {
      "recipe_name": "Tomato and Basil Soup",
      "recipe_image": "https://img.freepik.com/free-photo/tomato-soup-crackers-cheese-bell-pepper-side-view_141793-12562.jpg?t=st=1733082870~exp=1733086470~hmac=16df9315a4b9aee3f35ff72afbb195e0ab46882164489d748be47930d197db8d&w=826",
      "recipe_category": "Healthy",
      "recipe_description": "Tomato and basil soup is a soothing, light soup made with ripe tomatoes and fresh basil. Its smooth texture and mild flavor make it easy on the stomach, perfect for a comforting meal.",
      "recipe_steps": [
        "Step 1: In a large pot, heat 1 tablespoon of olive oil over medium heat. Add 1 chopped onion and sauté for 3-4 Mins until softened.",
        "Step 2: Add 2 cloves of minced garlic and sauté for another 30 seconds until fragrant.",
        "Step 3: Add 4 cups of diced tomatoes (fresh or canned) and 3 cups of vegetable broth. Bring to a boil.",
        "Step 4: Reduce the heat and let it simmer for 15-20 Mins, allowing the flavors to combine.",
        "Step 5: Add 1/4 cup of fresh basil leaves and simmer for an additional 5 Mins.",
        "Step 6: Use an immersion blender to blend the soup until smooth (or blend in batches if using a regular blender).",
        "Step 7: Season with salt and pepper to taste. Optionally, drizzle with a bit of cream or garnish with extra basil leaves before serving."
      ],
      "recipe_ingredients": [
        "1 tablespoon olive oil",
        "1 onion, chopped",
        "2 cloves garlic, minced",
        "4 cups diced tomatoes (fresh or canned)",
        "3 cups vegetable broth",
        "1/4 cup fresh basil leaves",
        "Salt and pepper to taste",
        "Optional: cream or extra basil for garnish"
      ],
      "recipe_facts": {
        "Calories": 150,
        "Carbs": 30,
        "Fat": 7,
        "Protein": 3,
        "Fiber": 4,
        "Net Carbs": 26,
        "Sodium": 500,
        "Cholesterol": 0
      },
      "recipe_time": "30 Mins"
    },
    {
      "recipe_name": "Boiled Egg Salad",
      "recipe_image": "https://img.freepik.com/free-photo/front-view-tasty-egg-salad-consists-olives-green-salad-dark-blue-background_179666-17280.jpg?t=st=1733082954~exp=1733086554~hmac=e2d65b0cad104f0c67156f09210fc182c7dc97f8e6ac2f9c3ee48cda7862cc9d&w=826",
      "recipe_category": "Healthy",
      "recipe_description": "Boiled Egg Salad is a light, nutritious, and easy-to-digest dish that combines boiled eggs with fresh vegetables and a simple dressing. It’s gentle on the stomach and perfect for a quick meal.",
      "recipe_steps": [
        "Step 1: Boil 4 eggs in a pot of water for about 10 Mins until fully cooked. Once done, peel the eggs and slice them into quarters.",
        "Step 2: In a large bowl, combine 1 cup of mixed Salad greens (such as spinach, lettuce, or arugula), 1/2 cucumber (sliced), and 1/2 red onion (thinly sliced).",
        "Step 3: Add the sliced boiled eggs to the Salad mixture.",
        "Step 4: In a small bowl, whisk together 1 tablespoon of olive oil, 1 tablespoon of lemon juice, salt, and pepper to taste to create the dressing.",
        "Step 5: Pour the dressing over the Salad and toss gently to combine all the ingredients.",
        "Step 6: Serve immediately or chill in the fridge before serving."
      ],
      "recipe_ingredients": [
        "4 boiled eggs",
        "1 cup mixed Salad greens",
        "1/2 cucumber, sliced",
        "1/2 red onion, thinly sliced",
        "1 tablespoon olive oil",
        "1 tablespoon lemon juice",
        "Salt and pepper to taste"
      ],
      "recipe_facts": {
        "Calories": 250,
        "Carbs": 10,
        "Fat": 18,
        "Protein": 18,
        "Fiber": 3,
        "Net Carbs": 7,
        "Sodium": 150,
        "Cholesterol": 210
      },
      "recipe_time": "15 Mins"
    },
    {
      "recipe_name": "Curd Rice",
      "recipe_image": "https://img.freepik.com/premium-photo/radish-raita-daikon-mooli-koshimbir-served-bowl-moody-background-selective-focus-indian-healthy-food_466689-57054.jpg?w=826",
      "recipe_category": "Healthy",
      "recipe_description": "Curd rice is a simple, soothing dish made with cooked rice and yogurt. It’s light on the stomach, easy to digest, and perfect for a comforting meal, often enjoyed with a sprinkle of seasoning and fresh herbs.",
      "recipe_steps": [
        "Step 1: Cook 1 cup of rice according to package instructions. Let it cool to room temperature.",
        "Step 2: In a bowl, mix the cooled rice with 1 cup of plain yogurt and a pinch of salt.",
        "Step 3: In a separate small pan, heat 1 tablespoon of oil. Add 1 teaspoon of mustard seeds, 1/2 teaspoon of cumin seeds, and 1 dried red chili. Sauté until the seeds start to splutter.",
        "Step 4: Add 1/4 teaspoon of turmeric powder, 1/4 teaspoon of asafetida (hing), and 1 tablespoon of chopped fresh cilantro. Stir well.",
        "Step 5: Pour the tempering over the curd rice mixture and mix gently.",
        "Step 6: Optional: Garnish with pomegranate seeds or roasted cashews for extra flavor and crunch."
      ],
      "recipe_ingredients": [
        "1 cup cooked rice",
        "1 cup plain yogurt",
        "1 tablespoon oil",
        "1 teaspoon mustard seeds",
        "1/2 teaspoon cumin seeds",
        "1 dried red chili",
        "1/4 teaspoon turmeric powder",
        "1/4 teaspoon asafetida (hing)",
        "1 tablespoon chopped fresh cilantro",
        "Salt to taste",
        "Optional: pomegranate seeds or roasted cashews for garnish"
      ],
      "recipe_facts": {
        "Calories": 200,
        "Carbs": 30,
        "Fat": 7,
        "Protein": 5,
        "Fiber": 2,
        "Net Carbs": 28,
        "Sodium": 400,
        "Cholesterol": 15
      },
      "recipe_time": "15 Mins"
    },
    {
      "recipe_name": "Vegetable Soup",
      "recipe_image": "https://img.freepik.com/free-photo/delicious-cream-pumpkin-soup-bowl-wooden-table_2829-8657.jpg?t=st=1733083008~exp=1733086608~hmac=2628702409a49d0c8383ebd477a673bd544745ea32a2568274fa710958a0c347&w=740",
      "recipe_category": "Healthy",
      "recipe_description": "Vegetable soup is a hearty, nutritious dish made with a variety of fresh vegetables in a light broth. It's easy on the stomach and provides comfort, warmth, and essential nutrients.",
      "recipe_steps": [
        "Step 1: In a large pot, heat 1 tablespoon of olive oil over medium heat. Add 1 chopped onion and sauté for 3-4 Mins until softened.",
        "Step 2: Add 2 cloves of minced garlic, 1 diced carrot, 1 diced celery stalk, and 1 diced potato. Sauté for another 3-4 Mins.",
        "Step 3: Pour in 4 cups of vegetable broth and bring to a boil.",
        "Step 4: Once boiling, reduce the heat and add 1 cup of chopped tomatoes, 1/2 cup of green beans, and 1/2 cup of peas. Let the soup simmer for 20-25 Mins until the vegetables are tender.",
        "Step 5: Season with salt, pepper, and 1 teaspoon of dried thyme or Italian seasoning.",
        "Step 6: Optional: Blend the soup with an immersion blender for a smoother texture or leave it chunky for added texture. Serve hot."
      ],
      "recipe_ingredients": [
        "1 tablespoon olive oil",
        "1 onion, chopped",
        "2 cloves garlic, minced",
        "1 carrot, diced",
        "1 celery stalk, diced",
        "1 potato, diced",
        "4 cups vegetable broth",
        "1 cup chopped tomatoes",
        "1/2 cup green beans, chopped",
        "1/2 cup peas",
        "Salt and pepper to taste",
        "1 teaspoon dried thyme or Italian seasoning"
      ],
      "recipe_facts": {
        "Calories": 150,
        "Carbs": 30,
        "Fat": 4,
        "Protein": 5,
        "Fiber": 7,
        "Net Carbs": 23,
        "Sodium": 600,
        "Cholesterol": 0
      },
      "recipe_time": "30 Mins"
    },
    {
      "recipe_name": "Zucchini Soup",
      "recipe_image": "https://img.freepik.com/free-photo/delicious-green-homemade-broccoli-cream-soup_114579-35136.jpg?t=st=1733083103~exp=1733086703~hmac=cf8de869565a6f82c010525f2a9ddc0aca5f7b60549c06e5a7f21af1e4c43576&w=826",
      "recipe_category": "Healthy",
      "recipe_description": "Zucchini soup is a light, nutrient-rich, and low-calorie dish. This soup is packed with vitamins and minerals, making it a Healthy and refreshing option that is easy to digest.",
      "recipe_steps": [
        "Step 1: In a large pot, heat 1 tablespoon of olive oil over medium heat. Add 1 chopped onion and sauté for 3-4 Mins until softened.",
        "Step 2: Add 2 cloves of minced garlic and sauté for another 1 minute until fragrant.",
        "Step 3: Add 4 cups of chopped zucchini and sauté for 5-6 Mins until the zucchini starts to soften.",
        "Step 4: Pour in 4 cups of vegetable broth and bring the mixture to a boil.",
        "Step 5: Once boiling, reduce the heat and let the soup simmer for 15-20 Mins, until the zucchini is very soft.",
        "Step 6: Blend the soup using an immersion blender or a regular blender until smooth and creamy.",
        "Step 7: Season with salt, pepper, and a pinch of nutmeg or thyme to taste.",
        "Step 8: Serve hot, garnished with fresh herbs or a drizzle of olive oil if desired."
      ],
      "recipe_ingredients": [
        "1 tablespoon olive oil",
        "1 onion, chopped",
        "2 cloves garlic, minced",
        "4 cups zucchini, chopped",
        "4 cups vegetable broth",
        "Salt and pepper to taste",
        "1/4 teaspoon nutmeg or dried thyme",
        "Optional: Fresh herbs or olive oil for garnish"
      ],
      "recipe_facts": {
        "Calories": 120,
        "Carbs": 15,
        "Fat": 7,
        "Protein": 3,
        "Fiber": 4,
        "Net Carbs": 11,
        "Sodium": 400,
        "Cholesterol": 0
      },
      "recipe_time": "25 Mins"
    },
    {
      "recipe_name": "Baked Sweet Potatoes",
      "recipe_image": "https://img.freepik.com/premium-photo/bowl-food-with-carrot-middle_975681-45141.jpg?w=740",
      "recipe_category": "Healthy",
      "recipe_description": "Baked sweet potatoes are a nutritious, easy-to-make dish. Rich in fiber, vitamins, and antioxidants, they provide a satisfying and Healthy option that can be enjoyed as a side or main meal.",
      "recipe_steps": [
        "Step 1: Preheat your oven to 400°F (200°C).",
        "Step 2: Wash and scrub 4 medium-sized sweet potatoes thoroughly. Pat them dry with a towel.",
        "Step 3: Pierce each sweet potato with a fork 3-4 times to allow steam to escape while baking.",
        "Step 4: Rub each sweet potato with a little olive oil and sprinkle with salt.",
        "Step 5: Place the sweet potatoes on a baking sheet lined with parchment paper.",
        "Step 6: Bake for 45-60 Mins, or until the sweet potatoes are soft when pierced with a fork.",
        "Step 7: Optional: Once baked, slice the sweet potatoes open and top with your favorite toppings such as butter, cinnamon, or Greek yogurt."
      ],
      "recipe_ingredients": [
        "4 medium-sized sweet potatoes",
        "1 tablespoon olive oil",
        "Salt to taste",
        "Optional toppings: Butter, cinnamon, or Greek yogurt"
      ],
      "recipe_facts": {
        "Calories": 180,
        "Carbs": 41,
        "Fat": 0,
        "Protein": 4,
        "Fiber": 6,
        "Net Carbs": 35,
        "Sodium": 80,
        "Cholesterol": 0
      },
      "recipe_time": "1 Hr"
    },
    {
      "recipe_name": "Tofu and Vegetables",
      "recipe_image": "https://img.freepik.com/premium-photo/tofu-salad-with-vegetables_1174497-80180.jpg?w=826",
      "recipe_category": "Healthy",
      "recipe_description": "Tofu and vegetables is a simple, Healthy dish packed with protein and essential nutrients. It's a versatile recipe, where tofu is sautéed with colorful vegetables for a light and nutritious meal.",
      "recipe_steps": [
        "Step 1: Press the tofu to remove excess water, then cut it into cubes.",
        "Step 2: Heat 1 tablespoon of olive oil in a large pan over medium heat. Add the tofu cubes and sauté for 5-7 Mins until golden and crispy on all sides. Remove and set aside.",
        "Step 3: In the same pan, add 1 chopped onion, 1 bell pepper, and 1 zucchini, all chopped into bite-sized pieces. Sauté for 5-6 Mins until the vegetables are tender.",
        "Step 4: Add 2 cloves of minced garlic, 1 tablespoon of soy sauce, and a pinch of black pepper. Stir and cook for another 1-2 Mins.",
        "Step 5: Add the cooked tofu back to the pan and mix everything together. Let it cook for another 2-3 Mins.",
        "Step 6: Optional: Garnish with fresh herbs like cilantro or green onions before serving."
      ],
      "recipe_ingredients": [
        "1 block firm tofu",
        "1 tablespoon olive oil",
        "1 onion, chopped",
        "1 bell pepper, chopped",
        "1 zucchini, chopped",
        "2 cloves garlic, minced",
        "1 tablespoon soy sauce",
        "Black pepper to taste",
        "Optional garnish: Fresh cilantro or green onions"
      ],
      "recipe_facts": {
        "Calories": 250,
        "Carbs": 20,
        "Fat": 15,
        "Protein": 15,
        "Fiber": 4,
        "Net Carbs": 16,
        "Sodium": 600,
        "Cholesterol": 0
      },
      "recipe_time": "20 Mins"
    },
    {
      "recipe_name": "French Onion Soup",
      "recipe_image": "https://img.freepik.com/free-photo/view-delicious-dish-food_23-2150777767.jpg?t=st=1733083317~exp=1733086917~hmac=381c42e5d90742eafb76d46eca518ae4f5468b8752535e48f6169cc75d6d03ee&w=826",
      "recipe_category": "Healthy",
      "recipe_description": "French Onion Soup is a comforting, flavorful soup made with caramelized onions, rich broth, and topped with toasted bread and melted cheese. A healthier version can be made with minimal fat while maintaining its rich taste.",
      "recipe_steps": [
        "Step 1: Heat 1 tablespoon of olive oil in a large pot over medium heat. Add 4 large onions, thinly sliced, and cook for 20-25 Mins, stirring occasionally, until the onions are caramelized and golden brown.",
        "Step 2: Add 2 cloves of minced garlic and cook for another 1 minute until fragrant.",
        "Step 3: Pour in 4 cups of low-sodium vegetable or beef broth and bring to a simmer.",
        "Step 4: Add 1 bay leaf, 1 teaspoon of thyme, and salt and pepper to taste. Let the soup simmer for 20 Mins to develop the flavors.",
        "Step 5: Meanwhile, preheat your oven to 400°F (200°C) and toast 4 slices of whole-grain bread.",
        "Step 6: Remove the bay leaf from the soup. Ladle the soup into oven-safe bowls, and top each with a slice of toasted bread and a sprinkle of low-fat cheese (optional).",
        "Step 7: Place the bowls under the broiler for 2-3 Mins or until the cheese is melted and bubbly.",
        "Step 8: Serve hot, garnished with fresh parsley if desired."
      ],
      "recipe_ingredients": [
        "1 tablespoon olive oil",
        "4 large onions, thinly sliced",
        "2 cloves garlic, minced",
        "4 cups low-sodium vegetable or beef broth",
        "1 bay leaf",
        "1 teaspoon dried thyme",
        "Salt and pepper to taste",
        "4 slices whole-grain bread",
        "Low-fat cheese (optional)",
        "Fresh parsley for garnish (optional)"
      ],
      "recipe_facts": {
        "Calories": 180,
        "Carbs": 30,
        "Fat": 5,
        "Protein": 4,
        "Fiber": 6,
        "Net Carbs": 24,
        "Sodium": 500,
        "Cholesterol": 10
      },
      "recipe_time": "1 Hr"
    },
    {
      "recipe_name": "Sweet Corn Soup",
      "recipe_image": "https://img.freepik.com/premium-photo/corn-soup-white-bowl-wooden-table_123827-2091.jpg?w=826",
      "recipe_category": "Healthy",
      "recipe_description": "Sweet Corn Soup is a light, comforting soup made with fresh corn kernels, vegetables, and broth. It's a nutritious and low-calorie option that’s perfect for any meal or as a starter.",
      "recipe_steps": [
        "Step 1: In a large pot, heat 1 tablespoon of olive oil over medium heat. Add 1 small onion, finely chopped, and cook until softened, about 3-4 Mins.",
        "Step 2: Add 2 cloves of minced garlic and cook for another 1 minute until fragrant.",
        "Step 3: Add 4 cups of vegetable broth and bring to a simmer.",
        "Step 4: Add 2 cups of fresh or frozen corn kernels, 1 medium-sized carrot (diced), and 1 celery stalk (diced). Simmer for 15-20 Mins until the vegetables are tender.",
        "Step 5: Use an immersion blender to blend the soup to your desired consistency. You can blend it completely for a creamy texture or leave it slightly chunky for more texture.",
        "Step 6: Season with salt, pepper, and a pinch of paprika or cayenne pepper for some extra flavor.",
        "Step 7: Ladle the soup into bowls and garnish with fresh parsley or cilantro if desired.",
        "Step 8: Serve hot, with a slice of whole-grain bread if desired."
      ],
      "recipe_ingredients": [
        "1 tablespoon olive oil",
        "1 small onion, finely chopped",
        "2 cloves garlic, minced",
        "4 cups vegetable broth",
        "2 cups fresh or frozen corn kernels",
        "1 medium carrot, diced",
        "1 celery stalk, diced",
        "Salt and pepper to taste",
        "1/2 teaspoon paprika or cayenne pepper (optional)",
        "Fresh parsley or cilantro for garnish (optional)",
        "Whole-grain bread (optional)"
      ],
      "recipe_facts": {
        "Calories": 140,
        "Carbs": 30,
        "Fat": 4,
        "Protein": 4,
        "Fiber": 5,
        "Net Carbs": 25,
        "Sodium": 600,
        "Cholesterol": 0
      },
      "recipe_time": "30 Mins"
    }
  ]
}